Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0292E
source: The host isolation of the {0} operator and the direct or transitive host colocation of this operator with the {1} and {2} operators imply that these three operators must be placed in a single partition. The placement of these operators in a single partition creates a conflict because the {3} operator can be restarted, but the {4} operator cannot be restarted.
de: Die Hostisolation des Operators {0} und die direkte oder transitive Hostkolokation dieses Operators mit den Operatoren {1} und {2} implizieren, dass diese drei Operatoren auf eine einzelne Partition verteilt werden müssen. Die Verteilung dieser Operatoren auf eine einzelne Partition führt zu einem Konflikt, weil der Operator {3} erneut gestartet werden kann, der Operator {4} jedoch nicht.
es: El aislamiento de host del operador {0} y la colocación de host directa o transitiva de este operador con los operadores {1} y {2} implican que estos tres operadores deben estar colocados en una sola partición. La colocación de estos operadores en una sola partición crea un conflicto porque el operador {3} se puede reiniciar, pero el operador {4} no se puede reiniciar.
ko: {0} 연산자의 호스트 격리, 그리고 {1} 및 {2} 연산자와 이 연산자의 직접 또는 임시 동일 호스트에 배치는 이들 세 연산자를 하나의 파티션에 배치해야 함을 내포합니다. 이들 연산자를 하나의 파티션에 배치하면 {3} 연산자는 재시작할 수 있지만 {4} 연산자는 재시작할 수 없어 충돌이 발생합니다.
pt_br: O isolamento do host do operador {0} e a colocação de host direta ou transitiva deste operador com os operadores {1} e {2} significam que estes três operadores devem ser colocados em uma única partição. O posicionamento destes operadores em uma única partição cria um conflito, pois o operador {3} pode ser reiniciado, exceto o operador {4}.
zh_tw: {0} 運算子的主機隔離以及此運算子與 {1} 和 {2} 運算子的直接或轉換主機 colocation，默示必須將這三個運算子放置在單個分割區中。將這些運算子放置在單個分割區中會導致衝突，因為可以重新啟動 {3} 運算子，但卻無法重新啟動 {4} 運算子。

# CDISP0293E
source: The host isolation of the {0} operator and the direct or transitive host colocation of this operator with the {1} and {2} operators imply that these three operators must be placed in a single partition. The placement of these operators in a single partition creates a conflict because the {3} operator can be relocated, but the {4} operator cannot be relocated.
de: Die Hostisolation des Operators {0} und die direkte oder transitive Hostkolokation dieses Operators mit den Operatoren {1} und {2} implizieren, dass diese drei Operatoren auf eine einzelne Partition verteilt werden müssen. Die Verteilung dieser Operatoren auf eine einzelne Partition führt zu einem Konflikt, weil der Operator {3} verlagert werden kann, der Operator {4} jedoch nicht.
es: El aislamiento de host del operador {0} y la colocación de host directa o transitiva de este operador con los operadores {1} y {2} implican que estos tres operadores deben estar colocados en una sola partición. La colocación de estos operadores en una sola partición crea un conflicto porque el operador {3} se puede reubicar, pero el operador {4} no se puede reubicar.
ko: {0} 연산자의 호스트 격리, 그리고 {1} 및 {2} 연산자와 이 연산자의 직접 또는 임시 동일 호스트에 배치는 이들 세 연산자를 하나의 파티션에 배치해야 함을 내포합니다. 이들 연산자를 하나의 파티션에 배치하면 {3} 연산자는 재배치할 수 있지만 {4} 연산자는 재배치할 수 없어 충돌이 발생합니다.
pt_br: O isolamento do host do operador {0} e a colocação de host direta ou transitiva deste operador com os operadores {1} e {2} significam que estes três operadores devem ser colocados em uma única partição. A colocação destes operadores em uma única partição cria um conflito, pois o operador {3} pode ser realocado, exceto o operador {4}.
zh_tw: {0} 運算子的主機隔離以及此運算子與 {1} 和 {2} 運算子的直接或轉換主機 colocation，默示必須將這三個運算子放置在單個分割區中。將這些運算子放置在單個分割區中會導致衝突，因為可以重新定位 {3} 運算子，但卻無法重新定位 {4} 運算子。

# CDISP0294E
source: The host isolation of the {0} operator and the direct or transitive host colocation with the {1} operator imply that these two operators must be placed in a single partition. The placement of these operators in a single partition conflicts with the partition isolation of the {2} operator.
de: Die Hostisolation des Operators {0} und die direkte oder transitive Hostkolokation mit dem Operator {1} implizieren, dass diese beiden Operatoren auf eine einzelne Partition verteilt werden müssen. Die Verteilung dieser Operatoren auf eine einzelne Partition steht in Konflikt mit der Partitionsisolation des Operators {2}.
es: El aislamiento de host del operador {0} y la colocación de host directa o transitiva con el operador {1} implican que estos dos operadores deben estar colocados en una sola partición. La colocación de estos operadores en una sola partición entra en conflicto con el aislamiento de la partición del operador {2}.
ko: {0} 연산자의 호스트 격리, 그리고 {1} 연산자와의 직접 또는 임시 동일 호스트에 배치는 이들 두 연산자를 동일 파티션에 배치해야 함을 내포합니다. 이들 연산자를 하나의 파티션에 배치하는 것은 {2} 연산자의 파티션 격리와 충돌합니다.
pt_br: O isolamento do host do operador {0} e a colocação de host direta ou transitiva com o operador {1} significam que estes dois operadores devem ser colocados em uma única partição. O posicionamento destes operadores em uma única partição conflita com o isolamento da partição do operador {2}.
zh_tw: {0} 運算子的主機隔離以及其與 {1} 運算子的直接或轉換主機 colocation，默示必須將這兩個運算子放置在單個分割區中。將這些運算子放置在單個分割區中與 {2} 運算子的分割區隔離相衝突。

# CDISP0295E
source: A host that is common to the direct or transitive host placements of the following operators does not exist: {0}
de: Ein Host für die direkten oder transitiven Hostverteilungen der folgenden Operatoren ist nicht vorhanden: {0}
es: No existe un host que es común para las colocaciones de host directa o transitiva de los operadores siguientes: {0}
ko: 다음 연산자의 직접 또는 임시 호스트 배치에 대해 공통인 호스트가 존재하지 않습니다: {0}
pt_br: Um host que é comum para os posicionamentos de host diretos ou transitivos dos operadores a seguir não existe: {0}
zh_tw: 以下運算子的直接或轉換主機放置所共用的主機不存在：{0}

# CDISP0297E
source: The host exlocation or host isolation specifications cannot be satisfied.
de: Die Hostexlokations- oder Hostisolationsspezifikationen können nicht erfüllt werden.
es: Las especificaciones de ubicación externa del host o de aislamiento de host no se pueden satisfacer.
ko: 호스트 외부 배치 또는 호스트 격리 지정을 만족시킬 수 없습니다.
pt_br: As especificações de deslocamento ou de isolamento de host não podem ser satisfeitas.
zh_tw: 無法滿足主機 exlocation 或主機隔離規格。

# CDISP0298E
source: A feasible placement cannot be found.
de: Eine machbare Verteilung kann nicht gefunden werden.
es: No se puede encontrar una colocación factible.
ko: 실행 가능한 배치를 찾을 수 없습니다.
pt_br: Um posicionamento factível não pode ser localizado.
zh_tw: 找不到可行的放置。

# CDISP0299T
source: Checking the constraints.
de: Einschränkungen werden überprüft.
es: Comprobando las restricciones.
ko: 제한조건을 확인하는 중입니다.
pt_br: Verificando as restrições.
zh_tw: 正在檢查限制項。

# CDISP0300T
source: Optimizing the fusion.
de: Fusion wird optimiert.
es: Optimizando la fusión.
ko: 연합을 최적화하는 중입니다.
pt_br: Otimizando a fusão.
zh_tw: 正在最佳化融合。

# CDISP0301E
source: A stream name is expected, but the {0} identifier is not a stream in this scope.
de: Ein Datenstromname wird erwartet, die Kennung {0} ist jedoch kein Datenstrom in diesem Bereich.
es: Se espera un nombre de secuencia, pero el identificador {0} no es una secuencia en este ámbito.
ko: 스트림 이름이 기대되었으나 {0} ID는 이 범위에 속한 스트림이 아닙니다.
pt_br: Um nome do fluxo é esperado, mas o identificador {0} não é um fluxo neste escopo.
zh_tw: 預期一個串流名稱，但 {0} ID 不是此範圍內的串流。

# CDISP0302E
source: A value name is expected, but the {0} identifier is not a value in this scope.
de: Ein Wertname wird erwartet, die Kennung {0} ist jedoch kein Wert in diesem Bereich.
es: Se espera un nombre de valor, pero el identificador {0} no es un valor en este ámbito.
ko: 값 이름이 기대되었으나 {0} ID는 이 범위에 속한 값이 아닙니다.
pt_br: Um nome do valor é esperado, mas o identificador {0} não é um valor neste escopo.
zh_tw: 預期一個值名稱，但 {0} ID 不是此範圍內的值。

# CDISP0310E
source: The {0} expression for the size of the window eviction policy does not simplify to a literal.
de: Der Ausdruck {0} für die Größe der Fensterbereinigungsrichtlinie kann nicht zu einem Literal vereinfacht werden.
es: La expresión {0} para el tamaño de la política de desalojo de ventana no se simplifica a un literal.
ko: 창 제거 정책의 크기에 대한 {0} 표현식이 리터럴로 간략화되지 않습니다.
pt_br: A expressão {0} para o tamanho da política de desocupação de janela não é simplificada para um literal.
zh_tw: 視窗收回原則大小的 {0} 表示式未簡化為文字。

# CDISP0311E
source: The {0} expression for the size of the window trigger policy does not simplify to a literal.
de: Der Ausdruck {0} für die Größe der Fenstertriggerrichtlinie kann nicht zu einem Literal vereinfacht werden.
es: La expresión {0} para el tamaño de la política de activador de ventana no se simplifica a un literal.
ko: 창 트리거 정책의 크기에 대한 {0} 표현식이 리터럴로 간략화되지 않습니다.
pt_br: A expressão {0} para o tamanho da política do acionador de janela não é simplificada para um literal.
zh_tw: 視窗觸發原則大小的 {0} 表示式未簡化為文字。

# CDISP0312I
source: Clean the compiler generated artifacts and suppress the compilation.
de: Vom Compiler generierte Artefakte bereinigen und Kompilierung unterdrücken.
es: Borre los artefactos generados del compilador y suprima la compilación.
ko: 컴파일러 생성 아티팩트를 지우고 컴파일을 제외합니다.
pt_br: Limpar os artefatos gerados pelo compilador e suprima a compilação.
zh_tw: 清除編譯器產生的構件，並暫停編譯。

# CDISP0313I
source: Set the default transport protocol to one of: tcp, llm_rum_tcp, or llm_rum_ib. Upper case variants are allowed.
de: Standardtransportprotokoll auf tcp, llm_rum_tcp oder llm_rum_ib setzen. Varianten mit Großbuchstaben sind zulässig.
es: Establezca el protocolo de transporte predeterminado en un de estos: tcp, llm_rum_tcp o llm_rum_ib. Las variantes en mayúsculas están permitidas.
ko: 기본 전송 프로토콜을 tcp, llm_rum_tcp 또는 llm_rum_ib 중 하나로 설정합니다. 대문자 변형이 허용됩니다.
pt_br: Configurar o protocolo de transporte padrão para um de: tcp, llm_rum_tcp ou llm_rum_ib. Variantes maiúsculas são permitidas.
zh_tw: 將預設傳輸通訊協定設定為下列其中一個：tcp、llm_rum_tcp 或 llm_rum_ib。容許使用大寫變式。

# CDISP0314I
source: Validate the hostnames that are in the explicit host pools.
de: Hostnamen in expliziten Host-Pools validieren
es: Valide los nombres de host que están en las agrupaciones de hosts explícitos.
ko: 명시 호스트 풀에 있는 호스트 이름을 유효성 확인합니다.
pt_br: Validar os nomes de host que estiverem em conjuntos de host explícitos.
zh_tw: 驗證明確主機儲存區中的主機名稱。

# CDISP0315I
source: Create an xml-based model of the application (.adl file), but suppress the creation of the application artifacts and suppress the build process.
de: XML-basiertes Modell der Anwendung (.adl-Datei) erstellen, die Erstellung der Anwendungsartefakte und den Erstellungsprozess jedoch unterdrücken.
es: Cree un modelo basado en xml de la aplicación (archivo .adl), pero suprima la creación de los artefactos de aplicación y suprima el proceso de creación.
ko: 애플리케이션의 XML 기반 모델(.adl 파일)을 작성하되 애플리케이션 아티팩트의 작성 및 빌드 프로세스를 제외합니다.
pt_br: Criar um modelo baseado em XML do aplicativo (arquivo .adl), mas suprima a criação dos artefatos de aplicativos e suprima o processo de compilação.
zh_tw: 建立應用程式的 XML 型模型（.adl 檔），但暫停建立應用程式構件並暫停建置程序。

# CDISP0316I
source: The main composite to be used.
de: Das zu verwendende Hauptverbundelement.
es: El compuesto principal que se utilizará.
ko: 사용될 기본 복합입니다.
pt_br: O composto principal a ser usado.
zh_tw: 要使用的主要複合項。

# CDISP0318I
source: Do not imply the exlocation constraints from the restartable and relocatable configs.
de: Exlokationseinschränkungen aus den erneut startbaren und verschiebbaren Konfigurationen nicht einschließen.
es: No implique las restricciones de ubicación externa desde configuraciones reiniciables y reubicables.
ko: 재시작 가능 및 재배치 가능 구성의 외부 배치 제한조건을 포함시키지 않습니다.
pt_br: Não significa as restrições de deslocamento das configurações reinicializáveis e realocáveis.
zh_tw: 不默示來自可重新啟動及可重新配置之配置的 exlocation 限制項。

# CDISP0319I
source: Set profiling: set -1 for no profiling (default), set 0 to profile but do not keep the samples, set >0 to profile and keep the samples by using a reservoir of the specified size.
de: Profilerstellung festlegen: -1 für keine Profilerstellung (Standard), 0 für Profilerstellung ohne Beibehaltung der Stichproben, >0 für Profilerstellung unter Beibehaltung der Stichproben und Verwendung eines Behälters mit der angegebenen Größe.
es: Establecer creación de perfiles: establezca -1 para ninguna creación de perfiles (valor predeterminado), establezca 0 para la creación de perfiles pero sin conservar las muestras, establezca >0 para crear perfiles y mantener las muestras utilizando una reserva del tamaño especificado.
ko: 프로파일링 설정: 프로파일링을 수행하지 않는 경우(기본값)에는 -1, 프로파일링을 수행하되 샘플을 보존하지 않으려는 경우에는 0, 프로파일링을 수행하고 지정된 크기의 저장소를 사용하여 샘플을 보존하려는 경우에는 >0을 설정합니다.
pt_br: Configurar a criação de perfil: configure para -1 para nenhuma criação de perfil (padrão), configure para 0 para criar perfil, mas não manter as amostras e configure para >0 para criar o perfil e manter as amostras usando um depósito do tamanho especificado.
zh_tw: 設定側寫：設定 -1 表示不側寫（預設值），設定 0 表示進行側寫但不保留範例，設定為大於 0 的值表示進行側寫並使用指定大小的儲存庫來保留範例。

# CDISP0320I
source: Clean compiler generated artifacts prior to compiling.
de: Vom Compiler generierte Artefakte vor der Kompilierung bereinigen.
es: Borre los artefactos generados del compilador antes de compilar.
ko: 컴파일 전에 컴파일러 생성 아티팩트를 지웁니다.
pt_br: Limpar os artefatos gerados pelo compilador antes da compilação.
zh_tw: 先清除編譯器產生的構件，然後再編譯。

# CDISP0321I
source: Set the sampling rate for profiling (floating point value in range [0.0,1.0]). The default is 1.
de: Stichprobenrate für Profilerstellung festlegen (Gleitkommawert im Bereich [0.0,1.0]). Der Standardwert ist 1.
es: Establezca la tasa de muestreo para la creación de perfiles (valor de coma flotante en el rango [0.0,1.0]). El valor predeterminado es 1.
ko: 프로파일링에 대한 샘플링 비율을 설정합니다([0.0,1.0] 범위의 부동 소수점 값). 기본값은 1입니다.
pt_br: Configurar a taxa de amostragem para criação de perfil (valor de vírgula flutuante no intervalo [0.0,1.0]). O padrão é 1.
zh_tw: 設定用於側寫的取樣率（位於範圍 [0.0,1.0] 中的浮點數值）。預設值為 1。

# CDISP0322I
source: Create a stand alone application executable.
de: Ausführbare Datei einer eigenständigen Anwendung erstellen.
es: Cree un ejecutable de aplicación autónoma.
ko: 독립형 애플리케이션 실행 파일을 작성합니다.
pt_br: Criar um executável do aplicativo independente.
zh_tw: 建立獨立式應用程式執行檔。

# CDISP0323I
source: Generate optimized code with less runtime error checking. Do not use with the --no-optimized-code-generation option.
de: Optimierten Code mit weniger Laufzeitfehlerprüfung generieren. Nicht zusammen mit der Option --no-optimized-code-generation verwenden.
es: Genere código optimizados con menos comprobación de error de tiempo de ejecución. No lo utilice con la opción --no-optimized-code-generation.
ko: 런타임 오류 검사를 덜 수행하는 최적화된 코드를 생성합니다. --no-optimized-code-generation 옵션과 함께 사용하지 마십시오.
pt_br: Gerar código otimizado com menos verificação de erro de tempo de execução. Não use a opção --no-optimized-code-generation.
zh_tw: 產生最佳化程式碼，並執行較少的執行時期錯誤檢查。請勿與 --no-optimized-code-generation 選項搭配使用。

# CDISP0324I
source: Build processing elements by using the source tree. No installation is required.
de: Verarbeitungselemente mithilfe der Quellenbaumstruktur erstellen. Keine Installation erforderlich.
es: Cree elementos de proceso utilizando el árbol origen. No es necesaria instalación.
pt_br: Construir elementos de processamento usando a árvore de origem. Nenhuma instalação é necessária.
zh_tw: 使用來源樹狀結構來建置處理元素。不需要安裝。

# CDISP0325E
source: An unknown custom output function name of {0} is specified for the {1} parameter.
de: Der unbekannte angepasste Ausgabefunktionsname {0} ist für den Parameter {1} angegeben.
es: Se ha especificado un nombre de función de salida personalizada desconocido de {0} para el parámetro {1}.
ko: 알 수 없는 사용자 정의 출력 함수 이름인 {0}이(가) {1} 매개변수에 대해 지정되었습니다.
pt_br: Um nome desconhecido de função de saída customizada de {0} está especificado para o parâmetro {1}.
zh_tw: 對 {1} 參數指定了不明的自訂輸出函數名稱 {0}。

# CDISP0326I
source: Set the size of the default pool.
de: Größe des Standardpools festlegen.
es: Establezca el tamaño de la agrupación predeterminada.
ko: 기본 풀의 크기를 설정합니다.
pt_br: Configurar o tamanho do conjunto padrão.
zh_tw: 設定預設儲存區的大小。

# CDISP0327I
source: The .spl input file.
de: .spl-Eingabedatei.
es: El archivo de entrada .spl.
pt_br: O arquivo de entrada .spl.
zh_tw: .spl 輸入檔。

# CDISP0328I
source: Add a wrapper: sdb as a config for the main composite. Any existing wrapper config that is specified in the source file takes precedence.
de: Wrapper hinzufügen: sdb als Konfiguration für das Hauptverbundelement. Jede vorhandene Wrapperkonfiguration, die in der Quellendatei angegeben ist, hat Vorrang.
es: Añada un derivador: sdb como una configuración para el compuesto principal. Tiene prioridad cualquier configuración de derivador existente que esté especificada en el archivo de origen.
ko: 랩퍼 추가: sdb를 기본 복합의 구성으로 추가합니다. 소스 파일에 지정된 기존 랩퍼 구성이 우선순위를 갖습니다.
pt_br: Incluir um wrapper: sdb como uma configuração para o composto principal. Qualquer configuração do wrapper existente que estiver especificada no arquivo de origem tem precedência.
zh_tw: 新增封套 sdb 作為主要複合項的配置。將優先使用原始檔中指定的任何現有封套配置。

# CDISP0329I
source: Generate non-optimized code with more runtime error checking. Do not use with the --optimized-code-generation option.
de: Nicht optimierten Code mit mehr Laufzeitfehlerprüfung generieren. Nicht zusammen mit der Option --optimized-code-generation verwenden.
es: Genere código no optimizado con más comprobación de error de tiempo de ejecución. No lo utilice con la opción --optimized-code-generation.
ko: 런타임 오류 검사를 더 많이 수행하는 최적화되지 않은 코드를 생성합니다. --optimized-code-generation 옵션과 함께 사용하지 마십시오.
pt_br: Gerar código não otimizado com mais verificação de erro de tempo de execução. Não use com a opção --optimized-code-generation.
zh_tw: 產生未最佳化程式碼，並執行較多的執行時期錯誤檢查。請勿與 --optimized-code-generation 選項搭配使用。

# CDISP0330I
source: Use the specified number of threads for building the binaries (make''s -j parameter).
de: Angegebene Anzahl Threads für das Erstellen von Binarys verwenden (make-Parameter -j).
es: Utilice el número especificado de hebras para crear los binarios (parámetro -j del archivo make).
ko: 바이너리 빌드를 위해 지정된 스레드 수(make의 -j 매개변수)를 사용합니다.
pt_br: Usar o número especificado de encadeamentos para construir os binários (parâmetro -j do make).
zh_tw: 使用指定的執行緒數目來建置二進位檔（make 的 -j 參數）。

# CDISP0332I
source: Generate the facade tuples when it is possible.
de: Fassadentupel generieren, sofern möglich.
es: Genere las tuplas de fachada cuando sea posible.
ko: 가능하면 facade 튜플을 생성합니다.
pt_br: Gerar as tuplas de fachada quando possível.
zh_tw: 在可能時，產生 Facade 值組。

# CDISP0333I
source: Generate a default makefile for building the SPL application.
de: Standardmakefile für das Erstellen der SPL-Anwendung generieren.
es: Genere un archivo make predeterminado para crear la aplicación SPL.
ko: SPL 애플리케이션 빌드를 위한 기본 makefile을 생성합니다.
pt_br: Gerar um makefile padrão para construir o aplicativo SPL.
zh_tw: 產生預設 make 檔以用於建置 SPL 應用程式。

# CDISP0334I
source: Specify the fusion mode. The options are: FDEF is the default fusion, and FOPT is the Optimized fusion. Convenience fusion options that can only be used with the --allow-convenience-fusion-options switch are: FNONE for No fusion, FALL to Fuse all into one, FRAND to Fuse randomly.
de: Fusionsmodus angeben. Optionen: FDEF ist die Standardfusion und FOPT ist die optimierte Fusion. Komfortfusionsoptionen, die nur zusammen mit dem Schalter --allow-convenience-fusion-options verwendet werden können: FNONE für ''Keine Fusion'', FALL für ''Gesamtfusion'', FRAND für ''Zufällige Fusion''.
es: Especifique la modalidad de fusión. Las opciones son: FDEF es la fusión predeterminada, y FOPT es la fusión optimizada. Las opciones de fusión de conveniencia que solo se pueden utilizar con el conmutador --allow-convenience-fusion-options son: FNONE para Sin fusión, FALL para Fusionar todo en uno, FRAND para Fusionar aleatoriamente.
ko: 연합 모드를 지정합니다. 옵션은 FDEF(기본 연합) 및 FOPT(최적화된 연합)입니다. --allow-convenience-fusion-options 스위치를 사용해야만 사용할 수 있는 간편 연합 옵션은 FNONE(연합 안 함), FALL(모두 하나로 연합), FRAND(무작위로 연합)입니다.
pt_br: Especificar o modo de fusão. As opções são: FDEF é a fusão padrão e FOPT é a fusão Otimizada. As opções de fusão de conveniência que podem ser usadas somente com o comutador --allow-convenience-fusion-options são: FNONE para Nenhuma fusão, FALL para Fundir tudo em um e FRAND para Fundir aleatoriamente.
zh_tw: 指定融合模式。選項為：FDEF 是預設融合，FOPT 是最佳化融合。只能與 --allow-convenience-fusion-options 開關搭配使用的便捷融合選項為：FNONE（表示不進行融合）、FALL（表示將所有項融合成一個）、FRAND（表示以隨機方式進行融合）。

# CDISP0335I
source: Set the number of remote hosts for distributed compiling that uses distcc. The available build hosts are selected.
de: Anzahl ferner Hosts für verteilte Kompilierung festlegen, die distcc verwenden. Die verfügbaren Build-Hosts sind ausgewählt.
es: Establezca el número de hosts remotos para la compilación distribuida que utiliza distcc. Se seleccionan los hosts de compilación disponibles.
ko: distcc를 사용하는 분산 컴파일을 위한 원격 호스트의 수를 설정합니다. 사용 가능한 빌드 호스트가 선택됩니다.
pt_br: Configurar o número de hosts remotos para compilação distribuída que usa distcc. Os hosts de compilação disponíveis são selecionados.
zh_tw: 對使用 distcc 的分散式編譯，設定遠端主機數目。選取可用的建置主機。

# CDISP0336I
source: Generate the statically linked processing elements.
de: Statisch verlinkte Verarbeitungselemente generieren.
es: Genere los elementos de proceso enlazados estáticamente.
ko: 통계적으로 링크된 처리 요소를 생성합니다.
pt_br: Gerar os elementos de processamento estaticamente vinculados.
zh_tw: 產生靜態鏈結的處理元素。

# CDISP0337I
source: Set the toolkit lookup paths. Separate multiple paths with {0}. Each path is a toolkit directory, a directory of toolkit directories, or a toolkitList XML file. This path overrides the STREAMS_SPLPATH environment variable.
de: Toolkit-Lookup-Pfade festlegen. Mehrere Pfade mit {0} voneinander trennen. Jeder Pfad ist ein Toolkitverzeichnis, ein Verzeichnis von Toolkitverzeichnissen oder eine XML-Datei ''toolkitList''. Dieser Pfad überschreibt die Umgebungsvariable STREAMS_SPLPATH.
es: Establezca las vías de acceso de búsqueda de kit de herramientas. Separe varias vías de acceso con {0}. Cada vía de acceso es un directorio de kit de herramientas, un directorio de directorios de kit de herramientas, o un archivo XML toolkitList. Esta vía de acceso altera temporalmente la variable de entorno STREAMS_SPLPATH.
ko: 툴킷 검색 경로를 설정합니다. 여러 경로는 {0}(으)로 구분하십시오. 각 경로는 툴킷 디렉토리, 툴킷 디렉토리의 디렉토리, 또는 toolkitList XML 파일입니다. 이 경로는 STREAMS_SPLPATH 환경 변수를 대체합니다.
pt_br: Configurar os caminhos de consulta do kit de ferramentas. Separe múltiplos caminhos com {0}. Cada caminho é um diretório do kit de ferramentas, um diretório dos diretórios do kit de ferramentas ou um arquivo XML toolkitList. Este caminho substitui a variável de ambiente STREAMS_SPLPATH.
zh_tw: 設定工具箱查閱路徑。使用 {0} 來區隔多個路徑。每一個路徑都是一個工具箱目錄、工具箱目錄的目錄或 toolkitList XML 檔。此路徑會置換 STREAMS_SPLPATH 環境變數。

# CDISP0339I
source: Set the compiler to verbose mode.
de: Compiler auf den ausführlichen Modus setzen.
es: Establezca el compilador en la modalidad detallada.
ko: 컴파일러를 상세 모드로 설정합니다.
pt_br: Configurar o compilador para o modo detalhado.
zh_tw: 將編譯器設定為詳細模式。

# CDISP0340I
source: Pass the specified flags to ld while linking occurs.
de: Angegebene Markierungen bei Linking an ld übergeben.
es: Pase los distintivos especificados a ld mientras se produce el enlazado.
ko: 링크가 발생하면 지정된 플래그를 ID에 전달합니다.
pt_br: Transmitir as sinalizações especificadas para o ID enquanto a vinculação ocorre.
zh_tw: 進行鏈結時，將指定的旗標傳遞至 ld。

# CDISP0341I
source: Pass the specified flags to the C++ compiler during the build.
de: Angegebene Markierungen während des Builds an den C++-Compiler übergeben.
es: Pase los distintivos especificados al compilador C++ durante la compilación.
ko: 빌드 중에 지정된 플래그를 C++ 컴파일러에 전달합니다.
pt_br: Transmitir as sinalizações especificadas para o compilador C++ durante a compilação.
zh_tw: 建置期間，將指定的旗標傳遞至 C++ 編譯器。
