Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP9096E
source: The {0} window property key was specified, but it is unknown.
de: Der Fenstereigenschaftsschlüssel {0} wurde angegeben, ist jedoch unbekannt.
es: La clave de la propiedad de ventana {0} se ha especificado, pero es desconocida.
ko: {0} 창 특성 키가 지정되었으나 이 키가 알 수 없는 키입니다.
pt_br: A chave da propriedade da janela {0} foi especificada, mas ela é desconhecida.
zh_tw: 指定了 {0} 視窗內容索引鍵，但該內容索引鍵不明。

# CDISP9097E
source: Perl code segments that are delimited by <% and %> cannot be used in non-generic operators.
de: Perl-Codesegmente, die durch <% und %> begrenzt werden, können in nicht generischen Operatoren nicht verwendet werden.
es: Los segmentos de código Perl que están delimitados mediante <% y %> no se pueden utilizar en operadores no genéricos.
ko: <% 및 %>로 구분된 Perl 코드 세그먼트는 비일반 연산자에서 사용할 수 없습니다.
pt_br: Os segmentos de código Perl que estiverem delimitados por <% e >% não podem ser usados em operadores não genéricos.
zh_tw: 在非一般運算子中，不能使用依 <% 和 %> 定界的 Perl 程式區段。

# CDISP9098E
source: In the {0} resource definition file, a {1} attribute in the {2} message id is missing or empty.
de: In der Ressourcendefinitionsdatei {0} fehlt ein Attribut {1} in der Nachrichten-ID {2} oder es ist leer.
es: En el archivo de definición de recurso {0}, falta un atributo {1} en el id de mensaje {2} o está vacío.
ko: {0} 자원 정의 파일에서 {2} 메시지 ID의 {1} 속성이 누락되거나 비어 있습니다.
pt_br: No arquivo de definição de recurso {0}, um atributo {1} no ID de mensagem {2} está ausente ou vazio.
zh_tw: 在 {0} 資源定義檔中，遺漏了 {2} 訊息 ID 中的 {1} 屬性，或者該屬性是空的。

# CDISP9100E
source: The type of the {0} attribute must be rstring. This attribute is generated by DirectoryScan without an output value.
de: Der Typ des Attributs {0} muss rstring sein. Dieses Attribut wird durch DirectoryScan ohne Ausgabewert generiert.
es: El tipo del atributo {0} debe ser rstring. Este atributo se genera mediante DirectoryScan sin un valor de salida.
ko: {0} 속성의 값은 rstring이어야 합니다. 이 속성은 DirectoryScan에 의해 출력 값 없이 생성됩니다.
pt_br: O tipo do atributo {0} deve ser rstring. Este atributo é gerado pelo DirectoryScan sem um valor de saída.
zh_tw: {0} 屬性的類型必須是 rstring。此屬性由 DirectoryScan 產生，但不含輸出值。

# CDISP9101E
source: The FileSource operator must use the file parameter or an input stream.
de: Der Dateiquellenoperator (FileSource) muss den Parameter ''file'' oder einen Eingabedatenstrom verwenden.
es: El operador FileSource debe utilizar el parámetro de archivo o una secuencia de entrada.
ko: FileSource 연산자는 file 매개변수 또는 입력 스트림을 사용해야 합니다.
pt_br: O operador FileSourcedeve usar o parâmetro de arquivo ou um fluxo de entrada.
zh_tw: FileSource 運算子必須使用 file 參數或輸入串流。

# CDISP9102E
source: The input tuple of a FileSource operator must use one rstring attribute.
de: Das Eingabetupel eines Dateiquellenoperators (FileSource) muss ein rstring-Attribut verwenden.
es: La tupla de entrada de un operador FileSource debe utilizar un atributo rstring.
ko: FileSource 연산자의 입력 튜플은 하나의 rstring 속성이어야 합니다.
pt_br: A tupla de entrada de um operador FileSource deve usar um atributo rstring.
zh_tw: FileSource 運算子的輸入值組必須使用一個 rstring 屬性。

# CDISP9103E
source: The {0} and {1} FileSource options conflict.
de: Die Optionen {0} und {1} des Dateiquellenoperators (FileSource) stehen in Konflikt.
es: Las opciones {0} y {1} FileSource entran en conflicto.
ko: {0} 및 {1} FileSource 옵션이 서로 충돌합니다.
pt_br: As opções de FileSource {0} e {1} estão em conflito.
zh_tw: {0} 和 {1} FileSource 選項有衝突。

# CDISP9104E
source: A FileSource operator must not use the {0} parameter and an input stream.
de: Ein Dateiquellenoperator (FileSource) darf nicht den Parameter {0} und einen Eingabedatenstrom verwenden.
es: Un operador FileSource no debe utilizar el parámetro {0} y una secuencia de entrada.
ko: FileSource 연산자는 {0} 매개변수와 입력 스트림을 함께 사용하지 않아야 합니다.
pt_br: Um operador FileSource não deve usar o parâmetro {0} e um fluxo de entrada.
zh_tw: FileSource 運算子不得使用 {0} 參數和輸入串流。

# CDISP9105E
source: The separator parameter is valid only when the format is csv.
de: Der Parameter ''separator'' ist nur gültig, wenn das Format csv ist.
es: El parámetro de separador solo es válido cuando el formato es csv.
ko: separator 매개변수는 형식이 csv인 경우에만 유효합니다.
pt_br: O parâmetro separador é válido somente quando o formato for CSV.
zh_tw: 僅當格式為 CSV 時，separator 參數才有效。

# CDISP9106E
source: The value of the separator option must be a one byte rstring or (u)int8.
de: Der Wert der Option ''separator'' muss ein rstring- oder (u)int8-Wert sein, der ein Byte lang ist.
es: El valor de la opción de separador debe ser un rstring o (u)int8 de 1 byte.
ko: separator 옵션의 값은 1바이트 rstring 또는 (u)int8이어야 합니다.
pt_br: O valor da opção de separador deve ser um rstring ou um (u)int8 de um byte.
zh_tw: separator 選項的值必須是一個位元組的 rstring 或 (u)int8。

# CDISP9107E
source: The operator requires that the schemas of all the input ports match.
de: Der Operator erfordert, dass die Schemas aller Eingabeports übereinstimmen.
es: El operador requiere que los esquemas de todos los puertos de entrada coincidan.
ko: 이 연산자는 모든 입력 포트의 스키마가 일치하도록 요구합니다.
pt_br: O operador requer que os esquemas de todas as portas de entrada correspondam.
zh_tw: 運算子需要所有輸入埠的綱目都相符。

# CDISP9108E
source: The type of the {0} attribute in the {1} input schema must be {2}, but the actual type is {3}.
de: Der Typ des Attributs {0} im Eingabeschema {1} muss {2} sein, der tatsächliche Typ ist jedoch {3}.
es: El tipo del atributo {0} en el esquema de entrada {1} debe ser {2}, pero el tipo real es {3}.
ko: {1} 입력 스키마에 있는 {0} 속성의 유형은 {2}이(가) 되어야 하지만 실제 유형이 {3}입니다.
pt_br: O tipo do atributo {0} no esquema de entrada {1} deve ser {2}, mas o tipo real é {3}.
zh_tw: {1} 輸入綱目中 {0} 屬性的類型必須是 {2}，但實際類型卻是 {3}。

# CDISP9109E
source: The {0} attribute was not found in the {1} input schema.
de: Das Attribut {0} wurde im Eingabeschema {1} nicht gefunden.
es: El atributo {0} no se ha encontrado en el esquema de entrada {1}.
ko: {1} 입력 스키마에서 {0} 속성을 찾지 못했습니다.
pt_br: O atributo {0} não foi localizado no esquema de entrada {1}.
zh_tw: 在 {1} 輸入綱目中找不到 {0} 屬性。

# CDISP9110E
source: The defaultTuple parameter is valid only when the format is csv.
de: Der Parameter ''defaultTuple'' ist nur gültig, wenn das Format csv ist.
es: El parámetro defaultTuple solo es válido cuando el formato es csv.
ko: defaultTuple 매개변수는 형식이 csv인 경우에만 유효합니다.
pt_br: O parâmetro defaultTuple é válido somente quando o formato for CSV.
zh_tw: 僅當格式為 CSV 時，defaultTuple 參數才有效。

# CDISP9111E
source: The type of the defaultTuple parameter does not match the tuple type of the output port.
de: Der Typ des Parameters ''defaultTuple'' stimmt nicht mit dem Tupeltyp des Ausgabeports überein.
es: El tipo del parámetro defaultTuple no coincide con el tipo de tupla del puerto de salida.
ko: defaultTuple 매개변수의 유형이 출력 포트의 튜플 유형과 일치하지 않습니다.
pt_br: O tipo do parâmetro defaultTuple não corresponde ao tipo de tupla da porta de saída.
zh_tw: defaultTuple 參數的類型與輸出埠的值組類型不符。

# CDISP9112E
source: The {0} parameter cannot be specified for the {1} Join algorithm.
de: Der Parameter {0} kann nicht für den Joinalgorithmus {1} angegeben werden.
es: El parámetro {0} no se puede especificar para el algoritmo de unión {1}.
ko: {0} 매개변수는 {1} Join 알고리즘에 대해 지정할 수 없습니다.
pt_br: O parâmetro {0} não pode ser especificado para um algoritmo de junção {1}.
zh_tw: 不能對 {1} 結合演算法指定 {0} 參數。

# CDISP9113E
source: The {0} parameter cannot be specified for a join with more than one output.
de: Der Parameter {0} kann nicht für einen Join mit mehreren Ausgaben angegeben werden.
es: El parámetro {0} no se puede especificar para una unión con más de una salida.
ko: {0} 매개변수는 출력이 둘 이상인 조인에 대해서 지정할 수 없습니다.
pt_br: O parâmetro {0} não pode ser especificado para uma junção com mais de uma saída.
zh_tw: 不能對具有多個輸出的結合指定 {0} 參數。

# CDISP9114E
source: The encoding parameter is not valid when the format is {0}.
de: Der Parameter ''encoding'' ist nicht gültig, wenn das Format {0} ist.
es: El parámetro de codificación no es válido cuando el formato es {0}.
ko: 형식이 {0}인 경우에는 encoding 매개변수가 유효하지 않습니다.
pt_br: O parâmetro de codificação não é válido quando o formato for {0}.
zh_tw: 當格式為 {0} 時，encoding 參數無效。

# CDISP9115E
source: The number of expressions specified for the {0} parameter does not match the number of expressions specified for the key parameter.
de: Die Anzahl der für den Parameter {0} angegebenen Ausdrücke stimmt nicht mit der für den Parameter ''key'' angegebenen Anzahl überein.
es: El número de expresiones especificado para el parámetro {0} no coincide con el número de expresiones especificado para el parámetro de clave.
ko: {0} 매개변수에 대해 지정된 표현식의 수가 key 매개변수에 대해 지정된 표현식의 수와 일치하지 않습니다.
pt_br: O número de expressões especificadas para o parâmetro {0} não corresponde ao número de expressões especificadas para o parâmetro de chave.
zh_tw: 對 {0} 參數指定的表示式數目與對 key 參數指定的表示式數目不符。

# CDISP9116E
source: When the removeKey parameter is specified, exactly three input ports are required, but one input port is missing.
de: Wenn der Parameter ''removeKey'' angegeben wird, sind genau drei Eingabeports erforderlich, es fehlt jedoch ein Eingabeport.
es: Cuando se especifica el parámetro removeKey, son necesarios exactamente tres puertos de entrada, pero falta un puerto de entrada.
ko: removeKey 매개변수가 지정된 경우에는 정확히 세 개의 입력 포트가 필요하지만, 한 입력 포트가 누락되었습니다.
pt_br: Quando o parâmetro removeKey é especificado, exatamente três portas de entrada são necessárias, mas uma porta de entrada está ausente.
zh_tw: 指定了 removeKey 參數時，剛好需要 3 個輸入埠，但卻遺漏了一個輸入埠。

# CDISP9117E
source: Three input ports are specified, but the removeKey parameter is missing.
de: Drei Eingabeports sind angegeben, jedoch fehlt der Parameter ''removeKey''.
es: Se han especificado tres puertos de entrada, pero falta el parámetro removeKey.
ko: 세 개의 입력 포트가 지정되었으나 removeKey 매개변수가 누락되었습니다.
pt_br: Três portas de entrada são especificadas, mas o parâmetro removeKey está ausente.
zh_tw: 指定了 3 個輸入埠，但卻遺漏了 removeKey 參數。

# CDISP9118E
source: The type of the value at the {1} index for the key parameter is {2}, and does not match the type of the {0} parameter, which is {3}.
de: Der Typ des Werts im Index {1} für den Schlüsselparameter ist {2} und stimmt nicht mit dem Typ des Parameters {0} überein, der {3} ist.
es: El tipo del valor en el índice {1} para el parámetro de clave es {2}, y no coincide con el tipo del parámetro {0}, que es {3}.
ko: key 매개변수의 {1} 인덱스에서의 값 유형이 {2}이며, 이 유형이 {0} 매개변수의 유형인 {3}과(와) 일치하지 않습니다.
pt_br: O tipo do valor no índice {1} para o parâmetro de chave é {2}, que não corresponde ao tipo do parâmetro {0}, que é {3}.
zh_tw: 在 key 參數的 {1} 索引處，值類型為 {2}，該類型與 {0} 參數的類型 {3} 不符。

# CDISP9120E
source: The {1} attribute does not exist in the schema for port number {0}.
de: Das Attribut {1} ist im Schema für Portnummer {0} nicht vorhanden.
es: El atributo {1} no existe en el esquema para el número de puerto {0}.
ko: 포트 번호 {0}의 스키마에 {1} 속성이 존재하지 않습니다.
pt_br: O atributo {1} não existe no esquema para o número da porta {0}.
zh_tw: {1} 屬性不在埠號 {0} 的綱目中。

# CDISP9121E
source: The type of the {1} attribute in the schema for port number {0} is {2}, but the {3} type is expected.
de: Der Typ des Attributs {1} im Schema für Portnummer {0} ist {2}, jedoch wird der Typ {3} erwartet.
es: El tipo del atributo {1} en el esquema para el número de puerto {0} es {2}, pero se esperaba el tipo {3}.
ko: 포트 번호 {0}의 스키마에 포함된 {1} 속성의 유형이 {2}이지만 기대된 항목은 {3} 유형입니다.
pt_br: O tipo do atributo {1} no esquema para o número da porta {0} é {2}, mas o tipo {3} é esperado.
zh_tw: 在埠號 {0} 的綱目中，{1} 屬性的類型是 {2}，但預期 {3} 類型。

# CDISP9122E
source: In the schema for port number {0}, an attribute with the {1} type does not exist.
de: Im Schema für Portnummer {0} ist ein Attribut mit dem Typ {1} nicht vorhanden.
es: En el esquema para el número de puerto {0}, no existe un atributo con el tipo {1}.
ko: 포트 번호 {0}의 스키마에 {1} 유형의 속성이 존재하지 않습니다.
pt_br: No esquema para o número da porta {0}, um atributo com o tipo {1} não existe.
zh_tw: 在埠號 {0} 的綱目中，類型為 {1} 的屬性不存在。

# CDISP9123E
source: The {2} type of the {1} attribute is not valid in the schema for port number {0}.
de: Der Typ {2} des Attributs {1} ist im Schema für Portnummer {0} nicht gültig.
es: El tipo {2} del atributo {1} no es válido en el esquema para el número de puerto {0}.
ko: {1} 속성의 {2} 유형은 포트 번호 {0}의 스키마에 대해 유효하지 않습니다.
pt_br: O tipo {2} do atributo {1} não é válido no esquema para o número da porta {0}.
zh_tw: 在埠號 {0} 的綱目中，{2} 類型的 {1} 屬性無效。

# CDISP9124E
source: The type of the {1} attribute in the schema for port number {0} is {2}, but the required type for this attribute must be one of the following types: {3}.
de: Der Typ des Attributs {1} im Schema für Portnummer {0} ist {2}, jedoch muss der erforderliche Typ für dieses Attribut einer der folgenden Typen sein: {3}.
es: El tipo del atributo {1} en el esquema para el número de puerto {0} es {2}, pero el tipo necesario para este atributo debe ser de uno de los tipos siguientes: {3}.
ko: 포트 번호 {0}의 스키마에 포함된 {1} 속성의 유형이 {2}이지만 이 속성의 필수 유형은 다음 유형 중 하나여야 합니다: {3}.
pt_br: O tipo do atributo {1} no esquema para o número da porta {0} é {2}, mas o tipo necessário para este atributo deve ser um dos seguintes: {3}.
zh_tw: 在埠號 {0} 的綱目中，{1} 屬性的類型是 {2}，但此屬性的必要類型必須是下列其中一種類型：{3}。

# CDISP9125E
source: The quoteStrings parameter is valid only when the format is csv.
de: Der Parameter ''quoteStrings'' ist nur gültig, wenn das Format csv ist.
es: El parámetro quoteStrings solo es válido cuando el formato es csv.
ko: quoteStrings 매개변수는 형식이 csv인 경우에만 유효합니다.
pt_br: O parâmetro quoteStrings é válido somente quando o formato for CSV.
zh_tw: 僅當格式為 CSV 時，quoteStrings 參數才有效。

# CDISP9127E
source: The code formatting failed while the {0} command was running. The return code is: {1,number,0}.
de: Die Codeformatierung ist während der Ausführung des Befehls {0} fehlgeschlagen. Rückgabecode: {1,number,0}.
es: El formateo de código ha fallado mientras se estaba ejecutando el mandato {0}. El código de retorno es: {1,número,0}.
ko: {0} 명령이 실행되는 중에 코드 포맷팅이 실패했습니다. 리턴 코드는 {1,number,0}입니다.
pt_br: A formatação de código falhou enquanto o comando {0} estava em execução. O código de retorno é: {1,number,0}.
zh_tw: 執行 {0} 指令時，程式碼格式化作業失敗。回覆碼為：{1,number,0}。

# CDISP9128E
source: An incorrect number of tuple variable names were passed to the adaptCppExpression() routine.
de: Eine falsche Anzahl Tupelvariablennamen wurde an die Routine adaptCppExpression() übergeben.
es: Se ha pasado un número incorrecto de nombres de variable de tupla a la rutina adaptCppExpression().
ko: adaptCppExpression() 루틴에 올바르지 않은 수의 튜플 변수 이름이 전달되었습니다.
pt_br: Um número incorreto de nomes de variáveis de tupla foi transmitido para a rotina adaptCppExpression().
zh_tw: 傳遞至 adaptCppExpression() 常式的值組變數名稱數目不正確。

# CDISP9129E
source: The {0} operator kind is specified. The valid values for the operator kind are: generic, c++, and java.
de: Die Operatorart {0} ist angegeben. Gültige Werte für die Operatorart: generic, c++ und java.
es: Se ha especificado el tipo de operador {0}. Los valores válidos para el tipo de operador son: genérico, c++ y java.
ko: {0} 연산자 종류가 지정되었습니다. operator 종류에 대해 유효한 값은 generic, c++ 및 java입니다.
pt_br: O tipo do operador {0} foi especificado. Os valores válidos para o tipo de operador são: generic, c++ e java.
zh_tw: 指定了 {0} 運算子類型。運算子類型的有效值為：generic、c++ 和 java。

# CDISP9135I
source: usage: {0} -h, --help | [-F, --use-transport <transport-name>] [-s, --silent] [-l, --local] [-o, --output-directory <dir>] [-i, --instance-id <instance-name>][-d, --data-directory <dir>] -h, --help Get (this) usage information -F, --use-transport <transport-name> Run transport performance test for specific transport. Can be one of: tcp : default llm_rum_tcp : llm_rum_ib : -s, --silent Suppress the details -i, --instance-id <instance-name> Provide instance for running distributed performance tests -o, --output-directory <directory-name> Write output file (transportStatModelFor_XXX.xml) to specified directory. Default directory is ./output/etc/stat -d, --data-directory <directory-name> The location of an existing data directory that is shared by the hosts in the instance and the host running the application If not specified, a directory named data will be created and used. This assumes a shared file system. -l, --local Run transport performance test on a single node (local). In this case the output file name will have _local as postfix. (transportStatModelFor_XXX_local.xml) Create a transport statistic model (transportStatModelFor_XXX.xml) by running a transport performance test on the cluster.
de: Syntax: {0} -h, --help | [-F, --use-transport <Transportname>] [-s, --silent] [-l, --local] [-o, --output-directory <Verzeichnis>] [-i, --instance-id <Instanzname>][-d, --data-directory <Verzeichnis>] -h, --help (Diese) Syntaxinformationen abrufen -F, --use-transport <Transportname> Transportleistungstest für bestimmtes Transportprotokoll ausführen. Kann einer der folgenden Werte sein: tcp : Standardwert llm_rum_tcp : llm_rum_ib : -s, --silent Details unterdrücken -i, --instance-id <Instanzname> Instanz für Ausführung verteilter Leistungstests angeben -o, --output-directory <Verzeichnisname> Ausgabedatei (transportStatModelFor_XXX.xml) in angegebenes Verzeichnis schreiben. Standardverzeichnis: ./output/etc/stat -d, --data-directory <Verzeichnisname> Position eines vorhandenen Datenverzeichnisses, das von den Hosts in der Instanz und dem Host, der die Anwendung ausführt, gemeinsam genutzt wird. Wird kein Verzeichnis angegeben, wird das Verzeichnis ''data'' erstellt und verwendet. Hierbei wird ein gemeinsam genutztes Dateisystem vorausgesetzt. -l, --local Transportleistungstest für einen einzelnen Knoten (lokal) ausführen. In diesem Fall ist die Erweiterung des Ausgabedateinamens _local. (transportStatModelFor_XXX_local.xml) Erstellt ein Transportstatistikmodell (transportStatModelFor_XXX.xml) durch die Ausführung eines Transportleistungstests für den Cluster.
es: uso: {0} -h, --help | [-F, --use-transport <transport-name>] [-s, --silent] [-l, --local] [-o, --output-directory <dir>] [-i, --instance-id <instance-name>][-d, --data-directory <dir>] -h, --help Obtener (esta) información de uso -F, --use-transport <transport-name> Ejecutar prueba de rendimiento de transporte para transporte específico. Puede ser uno de estos: tcp : predeterminado llm_rum_tcp : llm_rum_ib : -s, --silent Suprimir los detalles -i, --instance-id <instance-name> Proporcionar instancia para ejecutar pruebas de rendimiento distribuidas -o, --output-directory <directory-name> Escribir archivo de salida (transportStatModelFor_XXX.xml) en directorio especificado. El directorio predeterminado es ./output/etc/stat -d, --data-directory <directory-name> La ubicación de un directorio de datos existente que comparten los hosts en la instancia y el host que ejecuta la aplicación Si no se especifica, se creará y utilizará un directorio llamado data. Esto supone un sistema de archivos compartidos. . -l, --local Ejecutar prueba de rendimiento de transporte en un solo nodo (local). En este caso, el nombre del archivo de salida tendrá _local como postfijo. (transportStatModelFor_XXX_local.xml) Crear un modelo estadístico de transporte (transportStatModelFor_XXX.xml) ejecutando una prueba de rendimiento de transporte en el clúster.
ko: 사용법: {0} -h, --help | [-F, --use-transport <transport-name>] [-s, --silent] [-l, --local] [-o, --output-directory <dir>] [-i, --instance-id <instance-name>][-d, --data-directory <dir>] -h, --help 사용법 정보를 가져옵니다. -F, --use-transport <transport-name> 특정 전송에 대해 전송 성능 테스트를 실행합니다. 대상은 다음 중 하나가 될 수 있습니다. tcp : 기본값 llm_rum_tcp : llm_rum_ib : -s, --silent 세부사항을 제외합니다. -i, --instance-id <instance-name> 분산 성능 테스트 실행을 위한 인스턴스를 제공합니다. -o, --output-directory <directory-name> 출력 파일(transportStatModelFor_XXX.xml)을 지정된 디렉토리에 씁니다. 기본 디렉토리는 ./output/etc/stat입니다. -d, --data-directory <directory-name> 인스턴스에 있는 호스트와 애플리케이션을 실행하는 호스트 간에 공유되는 기존 데이터 디렉토리의 위치입니다. 지정되지 않은 경우에는 data라는 이름의 디렉토리가 작성되어 사용됩니다. 이 경우 시스템은 공유 파일 시스템으로 간주됩니다. -l, --local 단일 노드(local)에 대해 전송 성능 테스트를 실행합니다. 이 경우 출력 파일 이름에는 _local이 접미부로 추가됩니다. (transportStatModelFor_XXX_local.xml) 클러스터에 대해 전송 성능 테스트를 실행하여 전송 통계 모델(transportStatModelFor_XXX.xml)을 작성합니다.
pt_br: uso: {0} -h, --help | [-F, --use-transport <transport-name>] [-s, --silent] [-l, --local] [-o, --output-directory <dir>] [-i, --instance-id <instance-name>][-d, --data-directory <dir>] -h, --help obtém (estas) informações de uso -F, --use-transport <transport-name> executa o teste de desempenho de transporte para transporte específico. pode ser um de: tcp : padrão llm_rum_tcp : llm_rum_ib : -s, --silent suprime os detalhes -i, --instance-id <instance-name> fornece instância para executar testes de desempenho distribuído -o, --output-directory <directory-name> arquivo de saída de gravação (transportStatModelFor_XXX.xml) para um diretório especificado. O diretório padrão é ./output/etc/stat -d, --data-directory <directory-name> o local de um diretório de dados existente que é compartilhado pelos hosts na instância e pelo host que executa o aplicativo. Se não for especificado, um diretório denominado data será criado e usado. Isto supõe um sistema de arquivo compartilhado. -l, --local executa o teste de desempenho de transporte em um nó único (local) Neste caso, o nome do arquivo de saída terá _local como sufixo. (transportStatModelFor_XXX_local.xml) Crie um modelo de estatísticas de transporte (transportStatModelFor_XXX.xml) executando um teste de desempenho de transporte no cluster.
zh_tw: 用法：{0} -h, --help | [-F, --use-transport <transport-name>] [-s, --silent] [-l, --local] [-o, --output-directory <dir>] [-i, --instance-id <instance-name>][-d, --data-directory <dir>] -h, --help 取得（此）用法資訊 -F, --use-transport <transport-name> 對特定的傳輸執行傳輸效能測試。 可以是下列其中一項： tcp：預設值 llm_rum_tcp： llm_rum_ib ： -s, --silent 暫停詳細資料 -i, --instance-id <instance-name> 提供用於執行分散式效能測試的實例 -o, --output-directory <directory-name> 將輸出檔 (transportStatModelFor_XXX.xml) 寫入指定的目錄。 預設目錄為 ./output/etc/stat -d, --data-directory <directory-name> 現有 data 目錄的位置，實例中的主機與執行該應用程式的主機共用該目錄 如果未指定，則將建立名為 data 的目錄，並使用該目錄。這假定一個共用檔案系統。 -l, --local 對單一節點執行傳輸效能測試（本端）。 在此情況下，輸出檔名稱將具有 _local 作為字尾。 (transportStatModelFor_XXX_local.xml) 透過在叢集上執行傳輸效能測試，來建立傳輸統計資料模型 (transportStatModelFor_XXX.xml)。

# CDISP9136E
source: The {0} transport kind is specified. The valid values for the transport kind are: tcp, llm_rum_tcp, and llm_run_ib.
de: Die Transportart {0} ist angegeben. Gültige Werte für die Transportart: tcp, llm_rum_tcp und llm_run_ib.
es: Se ha especificado el tipo de transporte {0}. Los valores válidos para el tipo de transporte son: tcp, llm_rum_tcp y llm_run_ib.
ko: {0} 전송 종류가 지정되었습니다. 전송 종류에 대해 유효한 값은 tcp, llm_rum_tcp 및 llm_run_ib입니다.
pt_br: O tipo de transporte {0} está especificado. Os valores válidos para o tipo de transporte são: tcp, llm_rum_tcp e llm_run_ib.
zh_tw: 指定了 {0} 傳輸類型。傳輸類型的有效值為：tcp、llm_rum_tcp 和 llm_run_ib。

# CDISP9137E
source: The STREAMS_INSTALL environment variable is not defined.
de: Die Umgebungsvariable STREAMS_INSTALL ist nicht definiert.
es: La variable de entorno STREAMS_INSTALL no está definida.
ko: STREAMS_INSTALL 환경 변수가 정의되지 않았습니다.
pt_br: A variável de ambiente STREAMS_INSTALL não está definida.
zh_tw: 未定義 STREAMS_INSTALL 環境變數。

# CDISP9138E
source: The {0} type from the {1} attribute is not a supported as an attribute type by IBM InfoSphere Streams Version 1.x.
de: Der Typ {0} vom Attribut {1} wird von IBM InfoSphere Streams Version 1.x nicht als Attributtyp unterstützt.
es: El tipo {0} del atributo {1} no está soportado como un tipo de atributo por IBM InfoSphere Streams Versión 1.x.
ko: {1} 속성의 {0} 유형은 IBM InfoSphere Streams 버전 1.x에서 속성 유형으로 지원되지 않습니다.
pt_br: O tipo {0} do atributo {1} não é suportado como um tipo de atributo pelo IBM InfoSphere Streams Versão 1.x.
zh_tw: 來自 {1} 屬性的 {0} 類型不是 IBM InfoSphere Streams 1.x 版支援的屬性類型。
