Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0537E
source: The {0} reserved parameter name in the Java operator model is not valid.
de: Der reservierte Parametername {0} im Java-Operatormodell ist nicht gültig.
es: El nombre de parámetro reservado {0} en el modelo de operador Java no es válido.
ko: Java 연산자 모델의 {0} 예약된 매개변수 이름이 유효하지 않습니다.
pt_br: O nome do parâmetro reservado {0} no modelo do operador Java não é válido.
zh_tw: Java 運算子模型中的 {0} 保留參數名稱無效。

# CDISP0538E
source: The {0} reserved parameter name in the Java operator instance is not valid.
de: Der reservierte Parametername {0} in der Java-Operatorinstanz ist nicht gültig.
es: El nombre de parámetro reservado {0} en la instancia del operador Java no es válido.
ko: Java 연산자 인스턴스의 {0} 예약된 매개변수 이름이 유효하지 않습니다.
pt_br: O nome do parâmetro reservado {0} na instância do operador Java não é válido.
zh_tw: Java 運算子實例中的 {0} 保留參數名稱無效。

# CDISP0539E
source: The {0} clause cannot be followed by the {1} clause. The expected order of the clauses is: {2}.
de: Auf die Klausel {0} darf nicht die Klausel {1} folgen. Die erwartete Reihenfolge der Klauseln ist: {2}.
es: La cláusula {0} no puede ir seguida de la cláusula {1}. El orden previsto de la cláusula es: {2}.
ko: {0} 절 뒤에는 {1} 절이 올 수 없습니다. 기대된 절 순서는 {2}입니다.
pt_br: A cláusula {0} não pode ser seguida pela cláusula {1}. A ordem esperada das cláusulas é: {2}.
zh_tw: {0} 子句不能後跟 {1} 子句。預期的子句順序是：{2}。

# CDISP0540E
source: The SPL compiler reaches the {0} namespace by using multiple paths. The paths are: {1} and {2}.
de: Der SPL-Compiler erreicht den Namensbereich {0} durch die Verwendung mehrerer Pfade. Pfade: {1} und {2}.
es: El compilador SPL alcanza el espacio de nombres {0} mediante el uso de varias vías de acceso. Las vías de acceso son: {1} y {2}.
ko: SPL 컴파일러가 여러 경로를 사용하여 {0} 네임스페이스에 접근합니다. 이들 경로는 {1} 및 {2}입니다.
pt_br: O compilador de SPL atinge o namespace {0} usando caminhos múltiplos. Os caminhos são: {1} e {2}.
zh_tw: SPL 編譯器透過使用多個路徑來呼叫到 {0} 名稱空間。路徑為：{1} 和 {2}。

# CDISP0541E
source: The {0} file was not found.
de: Die Datei {0} wurde nicht gefunden.
es: El archivo {0} no se ha encontrado.
ko: {0} 파일을 찾지 못했습니다.
pt_br: O arquivo {0} não foi localizado.
zh_tw: 找不到 {0} 檔案。

# CDISP0542E
source: spl is the top-level namespace and is reserved.
de: ''spl'' ist der Namensbereich der höchsten Ebene und reserviert.
es: spl es el espacio de nombres de nivel superior y está reservado.
ko: spl은 최상위 네임스페이스이며 예약되어 있습니다.
pt_br: Spl é o namespace de nível superior e é reservado.
zh_tw: SPL 是最上層名稱空間，已予以保留。

# CDISP0543W
source: The {0} file is not indexed because it is in a reserved directory.
de: Die Datei {0} ist nicht indexiert, weil sie sich in einem reservierten Verzeichnis befindet.
es: El archivo {0} no está indexado porque está en un directorio reservado.
ko: {0} 파일이 예약된 디렉토리에 포함되어 있어 인덱스화되지 않았습니다.
pt_br: O arquivo {0} não está indexado, pois ele está em um diretório reservado.
zh_tw: 未建立 {0} 檔案的索引，因為該檔案位於保留目錄中。

# CDISP0544E
source: The {0} identifier is not an attribute of the {1} tuple.
de: Die Kennung {0} ist kein Attribut des Tupels {1}.
es: El identificador {0} no es un atributo de la tupla {1}.
ko: {0} ID는 {1} 튜플의 속성이 아닙니다.
pt_br: O identificador {0} não é um atributo da tupla {1}.
zh_tw: {0} ID 不是 {1} 值組的屬性。

# CDISP0545E
source: Duplicate output assignment exists for the {0} attribute.
de: Für das Attribut {0} ist eine doppelte Ausgabezuweisung vorhanden.
es: Existe una asignación de salida duplicada para el atributo {0}.
ko: {0} 속성에 대해 중복된 출력 지정이 존재합니다.
pt_br: Uma designação de saída duplicada existe para o atributo {0}.
zh_tw: 存在對 {0} 屬性的重複輸出指派。

# CDISP0546E
source: The {0} subexpression of the {1} subscription expression is not valid.
de: Der Unterausdruck {0} des Subskriptionsausdrucks {1} ist nicht gültig.
es: La subexpresión {0} de la expresión desuscripción {1} no es válida.
ko: {1} subscription 표현식의 {0} 하위 표현식이 유효하지 않습니다.
pt_br: A subexpressão {0} da expressão de assinatura {1} não é válida.
zh_tw: {1} subscription 表示式的 {0} 子表示式無效。

# CDISP0547I
source: Display this help and exit.
de: Diese Hilfe anzeigen und beenden.
es: Muestre esta salida y salga.
ko: 이 도움말을 표시하고 종료합니다.
pt_br: Exibir essa ajuda e sair.
zh_tw: 顯示此說明並結束。

# CDISP0548E
source: The end-of-file (EOF) for the input file was reached prematurely.
de: Das Dateiende für die Eingabedatei wurde vorzeitig erreicht.
es: El fin del archivo (EOF) para el archivo de entrada se ha alcanzado de forma prematura.
ko: 입력 파일의 파일의 끝(EOF)에 예기치 않게 도달했습니다.
pt_br: O fim do arquivo (EOF) para o arquivo de entrada foi atingido prematuramente.
zh_tw: 倉促地呼叫到輸入檔的檔案結尾 (EOF)。

# CDISP0554I
source: Specifies the directory that is used for locating the transport statistic files.
de: Gibt das Verzeichnis an, das für das Lokalisieren der Transportstatistikdateien verwendet wird.
es: Especifica el directorio que se utiliza para localizar los archivos estáticos de transporte.
ko: 전송 통계 파일을 찾는 데 사용되는 디렉토리를 지정합니다.
pt_br: Especifica o diretório que é usado para localizar os arquivos de estatísticas de transporte.
zh_tw: 指定用於尋找傳輸統計資料檔案的目錄。

# CDISP0555E
source: The {0} path to the transport statistics directory exists, but it is not a directory.
de: Der Pfad {0} zum Transportstatistikverzeichnis ist vorhanden, es handelt sich jedoch nicht um ein Verzeichnis.
es: Existe la vía de acceso {0} del directorio de estadísticas de transporte, pero no es un directorio.
ko: 전송 통계 디렉토리에 대한 {0} 경로가 존재하지만 이 경로가 디렉토리가 아닙니다.
pt_br: O caminho {0} para o diretório de estatísticas de transporte existe, mas não é um diretório.
zh_tw: 傳輸統計資料目錄的 {0} 路徑存在，但卻不是目錄。

# CDISP0560E
source: The {0} expression for the queue name parameter must be an input port.
de: Der Ausdruck {0} für den Parameter für den Namen der Warteschlange muss ein Eingabeport sein.
es: La expresión {0} para el parámetro de nombre de cola debe ser un puerto de entrada.
ko: 큐 이름 매개변수에 대한 {0} 표현식은 입력 포트여야 합니다.
pt_br: A expressão {0} para o parâmetro de nome da fila deve ser uma porta de entrada.
zh_tw: 佇列名稱參數的 {0} 表示式必須是輸入埠。

# CDISP0561D
source: DETAILS
es: DETALLES
ko: 세부사항
pt_br: DETALHES
zh_tw: 詳細資料

# CDISP0562E
source: The number of available hosts in the {1} pool is {0,number,0}. This number is not sufficient to support the {2,number,0} actual hosts of the operators that use Host Exlocation {3} and are assigned to the {4} pool.
de: Die Anzahl verfügbarer Hosts im Pool {1} ist {0,number,0}. Diese Anzahl reicht nicht aus, um die {2,number,0} tatsächlichen Hosts der Operatoren zu unterstützen, die die Hostexlokation {3} verwenden und dem Pool {4} zugewiesen sind.
es: El número de hosts disponibles en la agrupación {1} es {0,número,0}. Este número no es suficiente para dar soporte a los {2,número,0} hosts reales de los operadores que utilizan la Colocación externa {3} y que están asignados a la agrupación {4}.
ko: {1} 풀에서 사용 가능한 호스트의 수가 {0,number,0}개입니다. 이는 호스트에 외부 배치 {3}을(를) 사용하며 {4} 풀에 지정된 연산자의 {2,number,0}개 실제 호스트를 지원하기에는 충분하지 않습니다.
pt_br: O número de hosts disponíveis no conjunto {1} é {0,number,0}. Este número não é suficiente para suportar os {2,number,0} hosts reais dos operadores que usam Deslocamento de host {3} e que estiverem designados ao conjunto {4}.
zh_tw: {1} 儲存區中的可用主機數目是 {0,number,0}。此數目不足，無法支援運算子的 {2,number,0} 個實際主機，這些運算子使用主機 exlocation {3} 並且已指派給 {4} 儲存區。

# CDISP0564E
source: attribute
de: Attribut
es: atributo
ko: 속성
zh_tw: 屬性

# CDISP0565E
source: attribute assignment
de: Attributzuweisung
es: asignación de atributo
ko: 속성 지정
pt_br: designação do atributo
zh_tw: 屬性指派

# CDISP0566E
source: attribute declaration
de: Attributdeklaration
es: declaración de atributo
ko: 속성 선언
pt_br: declaração de atributo
zh_tw: 屬性宣告

# CDISP0567E
source: block statement
de: Blockanweisung
es: sentencia de bloque
ko: 블록문
pt_br: instrução de bloco
zh_tw: 區塊陳述式

# CDISP0568E
source: block statement
de: Blockanweisung
es: sentencia de bloque
ko: 블록문
pt_br: instrução de bloco
zh_tw: 區塊陳述式

# CDISP0569E
source: bounds formals
de: formaler Grenzparameter
es: formales de límites
ko: 바운드 정규
pt_br: formais de limites
zh_tw: 範圍格式

# CDISP0570E
source: call expression
de: Aufrufausdruck
es: expresión de llamada
ko: 표현식 호출
pt_br: expressão de chamada
zh_tw: 呼叫表示式

# CDISP0571E
source: cast expression
de: Umsetzungsausdruck
es: expresión de conversión de tipo de datos
ko: 표현식 캐스트
pt_br: expressão cast
zh_tw: 強制轉型表示式

# CDISP0572E
source: compilation unit
de: Kompiliereinheit
es: unidad de compilación
ko: 컴파일 단위
pt_br: Unidade de compilação
zh_tw: 編譯單元

# CDISP0573E
source: composite operator body
de: Hauptteil des Verbundoperators
es: cuerpo del operador compuesto
ko: 복합 연산자 본문
pt_br: corpo do operador composto
zh_tw: 複合運算子主體

# CDISP0574E
source: composite operator definition
de: Definition des Verbundoperators
es: definición de operador compuesto
ko: 복합 연산자 정의
pt_br: definição do operador composto
zh_tw: 複合運算子定義

# CDISP0575E
source: composite formal initializer
de: formaler Verbundinitialisierungsoperator
es: inicializador formal compuesto
ko: 복합 정규 이니셜라이저
pt_br: inicializador formal composto
zh_tw: 複合格式起始設定程式

# CDISP0576E
source: composite operator head
de: Header des Verbundoperators
es: cabecera de operador compuesto
ko: 복합 연산자 헤드
pt_br: cabeçalho do operador composto
zh_tw: 複合運算子頭

# CDISP0577E
source: composite port
de: Verbundport
es: puerto compuesto
ko: 복합 포트
pt_br: porta composta
zh_tw: 複合埠

# CDISP0578E
source: config item
de: Konfigurationselement
es: elemento de config
ko: 구성 항목
pt_br: item de configuração
zh_tw: 配置項目

# CDISP0579E
source: type definition
de: Typdefinition
es: definición de tipo
ko: 유형 정의
pt_br: definição de tipo
zh_tw: 類型定義

# CDISP0580E
source: digit
de: Ziffer
es: dígito
ko: 숫자
pt_br: dígito
zh_tw: 數字

# CDISP0581E
source: enum type
de: Aufzählungstyp
es: tipo de enumeración
ko: enum 유형
pt_br: tipo de enum
zh_tw: 列舉類型

# CDISP0582E
source: exponent
es: exponente
ko: 지수
pt_br: exponente
zh_tw: 指數

# CDISP0583E
source: expression
de: Ausdruck
es: expresión
ko: 표현식
pt_br: expressão
zh_tw: 表示式

# CDISP0584E
source: expression mode
de: Ausdrucksmodus
es: modalidad de expresión
ko: 표현식 모드
pt_br: modo de expressão
zh_tw: 表示式模式

# CDISP0585E
source: expression statement
de: Ausdrucksanweisung
es: sentencia de expresión
ko: 표현문
pt_br: instrução de expressão
zh_tw: 表示式陳述式

# CDISP0586E
source: floating point literal
de: Gleitkommaliteral
es: literal de coma flotante
ko: 부동 소수점 리터럴
pt_br: literal de vírgula flutuante
zh_tw: 浮點文字

# CDISP0587E
source: for loop initializer
de: For-Schleifeninitialisierungsoperator
es: inicializador de bucle for
ko: for 루프 이니셜라이저
pt_br: inicializador loop for
zh_tw: 適用於迴圈起始設定程式

# CDISP0588E
source: function
de: Funktion
es: función
ko: 함수
pt_br: Função
zh_tw: 函數

# CDISP0589E
source: function definition
de: Funktionsdefinition
es: definición de función
ko: 함수 정의
pt_br: definição de função
zh_tw: 函數定義

# CDISP0590E
source: function formal
de: formaler Funktionsparameter
es: formal de función
ko: 함수 정규
pt_br: formal de função
zh_tw: 函數格式

# CDISP0591E
source: function head
de: Funktionsheader
es: cabecera de función
ko: 함수 헤드
pt_br: cabeçalho da função
zh_tw: 函數頭

# CDISP0592E
source: function prototype
de: Funktionsprototyp
es: prototipo de función
ko: 함수 프로토타입
pt_br: protótipo de função
zh_tw: 函數原型

# CDISP0593E
source: hex digit
de: Hex-Ziffer
es: dígito hex
ko: 16진 숫자
pt_br: dígito hexadecimal
zh_tw: 十六進位數字

# CDISP0594E
source: hex literal
es: literal hex
ko: 16진 리터럴
pt_br: literal hexadecimal
zh_tw: 十六進位文字

# CDISP0595E
source: identifier
de: Kennung
es: identificador
ko: ID
zh_tw: ID

# CDISP0596E
source: integer literal
de: ganzzahliges Literal
es: literal entero
ko: 정수 리터럴
pt_br: literal inteiro
zh_tw: 整數文字

# CDISP0597E
source: list literal
de: Listenliteral
es: literal de lista
ko: 목록 리터럴
pt_br: lista literal
zh_tw: 清單文字

# CDISP0598E
source: list type
de: Listentyp
es: tipo de lista
ko: 목록 유형
pt_br: tipo de lista
zh_tw: 清單類型

# CDISP0599E
source: local variable declaration
de: lokale Variablendeklaration
es: declaración de variable local
ko: 로컬 변수 선언
pt_br: declaração de variável local
zh_tw: 區域變數宣告

# CDISP0600E
source: local variable declaration item
de: Element der lokalen Variablendeklaration
es: elemento de declaración de variable local
ko: 로컬 변수 선언 항목
pt_br: item de declaração de variável local
zh_tw: 區域變數宣告項目

# CDISP0601E
source: map literal
es: literal de correlación
ko: 맵 리터럴
pt_br: literal de mapa
zh_tw: 對映文字

# CDISP0602E
source: map type
de: Maptyp
es: tipo de correlación
ko: 맵 유형
pt_br: tipo de mapa
zh_tw: 對映類型

# CDISP0603E
source: modifiers
de: Modifikatoren
es: modificadores
ko: 수정자
pt_br: modificadores
zh_tw: 修飾元

# CDISP0604E
source: namespace name
de: Namensbereichsname
es: nombre de espacio de nombres
ko: 네임스페이스 이름
pt_br: nome do namespace
zh_tw: 名稱空間名稱

# CDISP0605E
source: none
de: ohne
es: ninguno
ko: 없음
pt_br: nenhuma
zh_tw: 無

# CDISP0606E
source: expressions
de: Ausdrücke
es: expresiones
ko: 표현식
pt_br: expressões
zh_tw: 表示式

# CDISP0607E
source: operator invocation actual of name format
de: tatsächlicher Parameterwert des Operatoraufrufs im Namensformat
es: valor real de invocación de operador de formato de nombre
ko: 이름 형식의 연산자 호출 실제
pt_br: chamada real de operador de formato de nome
zh_tw: 名稱格式的實際運算子呼叫

# CDISP0608E
source: operator invocation actual of type format
de: tatsächlicher Parameterwert des Operatoraufrufs im Typformat
es: valor real de invocación de operador de formato de tipo
ko: 유형 형식의 연산자 호출 실제
pt_br: chamada real do operador de formato de tipo
zh_tw: 類型格式的實際運算子呼叫

# CDISP0609E
source: operator
es: operador
ko: 연산자
pt_br: operador
zh_tw: 運算子

# CDISP0610E
source: operator inputs
de: Operatoreingaben
es: entradas de operador
ko: 연산자 입력
pt_br: entradas do operador
zh_tw: 運算子輸入

# CDISP0611E
source: operator invocation
de: Operatoraufruf
es: invocación de operador
ko: 연산자 호출
pt_br: chamada do operador
zh_tw: 運算子呼叫

# CDISP0612E
source: operator invocation actual
de: tatsächlicher Parameterwert des Operatoraufrufs
es: valor real de invocación de operador
ko: 연산자 호출 실제
pt_br: chamada real do operador
zh_tw: 實際運算子呼叫

# CDISP0613E
source: operator invocation body
de: Hauptteil des Operatoraufrufs
es: cuerpo de invocación de operador
ko: 연산자 호출 본문
pt_br: corpo de chamada do operador
zh_tw: 運算子呼叫主體

# CDISP0614E
source: operator invocation head
de: Header des Operatoraufrufs
es: cabecera de invocación de operador
ko: 연산자 호출 헤드
pt_br: cabeçalho de chamada do operador
zh_tw: 運算子呼叫頭

# CDISP0615E
source: operator invocation output
de: Ausgabe des Operatoraufrufs
es: salida de invocación de operador
ko: 연산자 호출 출력
pt_br: saída de chamada do operador
zh_tw: 運算子呼叫輸出

# CDISP0616E
source: parenthesized expression
de: Klammerausdruck
es: expresión entre paréntesis
ko: 괄호로 묶인 표현식
pt_br: expressão entre parênteses
zh_tw: 括弧表示式

# CDISP0617E
source: port inputs
de: Porteingaben
es: entradas de puerto
ko: 포트 입력
pt_br: entradas da porta
zh_tw: 埠輸入

# CDISP0618E
source: postfix expression
de: Postfixausdruck
es: expresión postfija
ko: 접미부 표현식
pt_br: expressão de sufixo
zh_tw: 尾碼表示式

# CDISP0619E
source: prefix expression
de: Präfixausdruck
es: expresión de prefijo
ko: 접두부 표현식
pt_br: expressão de prefixo
zh_tw: 字首表示式

# CDISP0620E
source: primitive type
de: primitiver Typ
es: tipo de primitiva
ko: 기본 유형
pt_br: tipo primitivo
zh_tw: 初始類型

# CDISP0621E
source: function prototype formals
de: formaler Funktionsprototypparameter
es: formales de prototipo de función
ko: 함수 프로토타입 정규
pt_br: formais do protótipo de função
zh_tw: 函數原型格式

# CDISP0622E
source: set literal
de: Gruppenliteral
es: literal de conjunto
ko: 세트 리터럴
pt_br: literal de conjunto
zh_tw: 設定文字

# CDISP0623E
source: set type
de: Gruppentyp
es: tipo de conjunto
ko: 세트 유형
pt_br: tipo de configuração
zh_tw: 設定類型

# CDISP0626E
source: slice
es: porción
ko: 슬라이스
pt_br: fatia
zh_tw: 截塊

# CDISP0627E
source: subscript expression
de: Indexausdruck
es: expresión de subscript
ko: 서브스크립트 표현식
pt_br: expressão de subscrito
zh_tw: 下標表示式

# CDISP0628E
source: tuple attribute list
de: Tupelattributliste
es: lista de atributos de tupla
ko: 튜플 속성 목록
pt_br: lista de atributos de tupla
zh_tw: 值組屬性清單

# CDISP0629E
source: tuple extendee list
de: Liste erweiterter Tupel
es: lista ampliada de tuplas
ko: 튜플 피확장자 목록
pt_br: lista estendida de tupla
zh_tw: 值組被延伸項清單

# CDISP0630E
source: tuple literal
de: Tupelliteral
es: literal de tupla
ko: 튜플 리터럴
pt_br: literal de tupla
zh_tw: 值組文字

# CDISP0631E
source: tuple type
de: Tupeltyp
es: tipo de tupla
ko: 튜플 유형
pt_br: tipo de tupla
zh_tw: 值組類型

# CDISP0632E
source: type arguments
de: Typargumente
es: argumentos de tipo
ko: 유형 인수
pt_br: argumentos de tipo
zh_tw: 類型引數

# CDISP0633E
source: type dimensions
de: Typdimensionen
es: dimensiones de tipo
ko: 유형 차원
pt_br: dimensões de tipo
zh_tw: 類型維度

# CDISP0634E
source: type formal
de: formaler Typparameter
es: formal de tipo
ko: 유형 정규
pt_br: formal de tipo
zh_tw: 類型格式

# CDISP0635E
source: type formals
de: formale Typparameter
es: formales de tipo
ko: 유형 정규
pt_br: formal de tipo
zh_tw: 類型格式

# CDISP0636E
source: type name
de: Typname
es: nombre de tipo
ko: 유형 이름
pt_br: nome do tipo
zh_tw: 類型名稱

# CDISP0637E
source: use directives
de: use-Anweisungen
es: directivas de uso
ko: use 지시문
pt_br: diretivas de uso
zh_tw: use 指引

# CDISP0638E
source: use directive tail
de: Nachsatz der Anweisung ''use''
es: cola de directiva de uso
ko: use 지시문 후미
pt_br: usar diretiva tail
zh_tw: use 指引結尾

# CDISP0639E
source: whitespace
de: Leerzeichen
es: espacio en blanco
ko: 공백
pt_br: espaço em branco
zh_tw: 空格

# CDISP0640E
source: end of file
de: Dateiende
es: fin de archivo
ko: EOF
pt_br: fim de arquivo
zh_tw: 檔案結尾

# CDISP0641E
source: parameter signature
de: Parametersignatur
es: firma de parámetro
ko: 매개변수 시그니처
pt_br: assinatura de parâmetro
zh_tw: 參數簽章

# CDISP0642E
source: statement
de: Anweisung
es: sentencia
ko: 명령문
pt_br: declaração
zh_tw: 陳述式

# CDISP0643E
source: The {0} identifier is a reserved word and cannot be used.
de: Die Kennung {0} ist ein reserviertes Wort und kann nicht verwendet werden.
es: El identificador {0} es una palabra reservada y no se puede utilizar.
ko: {0} ID는 예약어이며 사용할 수 없습니다.
pt_br: O identificador {0} é uma palavra reservada e não pode ser usado.
zh_tw: {0} ID 是保留字，不能使用。

# CDISP0650E
source: The null type may not appear on the left side of an optional type operator.
de: Der Typ ''null'' darf nicht auf der linken Seite eines optionalen Typoperators stehen.
es: Es posible que el tipo nulo no aparezca en el lado izquierdo de un operador de tipo opcional.
ko: 선택적 유형 연산자의 왼쪽에는 널 유형이 표시될 수 없습니다.
pt_br: O tipo nulo pode não aparecer ao lado esquerdo de um operador de tipo opcional.
zh_tw: 空類型不可出現在選用類型運算子的左側。

# CDISP0651E
source: The null type may not appear on both sides of an infix operator.
de: Der Typ ''null'' darf nicht auf beiden Seiten eines eingebetteten Operators stehen.
es: Es posible que el tipo nulo no aparezca a ambos lados de un operador de infix.
ko: infix 연산자의 양쪽에는 널 유형이 표시될 수 없습니다.
pt_br: O tipo nulo pode não aparecer em ambos os lados de um operador infix.
zh_tw: 空類型不可同時出現在中置運算子左右兩側。

# CDISP0652E
source: the same type as
de: derselbe Typ wie
es: el mismo tipo que
ko: 다음과 같은 유형
pt_br: o mesmo tipo que
zh_tw: 與下列項目相同類型

# CDISP0653E
source: the same collection type as
de: derselbe Erfassungstyp wie
es: el mismo tipo de colección que
ko: 다음과 같은 콜렉션 유형
pt_br: o mesmo tipo de coleção que
zh_tw: 與下列項目相同的收集類型

# CDISP0654E
source: an element type of
de: ein Elementtyp von
es: un tipo de elemento de
ko: 다음의 요소 유형
pt_br: um tipo de elemento de
zh_tw: 下列項目的元素類型

# CDISP0655E
source: a container type for
de: ein Containertyp für
es: un tipo de contenedor para
ko: 다음의 컨테이너 유형
pt_br: um tipo de contêiner para
zh_tw: 下列項目的儲存器類型

# CDISP0656E
source: or
de: oder
es: o
ko: 또는
zh_tw: 或

# CDISP0657E
source: A type mismatch exists at the {0} shift operator. Operands of the {1} and {2} types were found.
de: Beim Shift-Operator {0} liegt eine Typabweichung vor. Operanden der Typen {1} und {2} wurden gefunden.
es: Existe una discrepancia de tipo en el operador de desplazamiento {0}. Se han encontrado operandos de los tipos {1} y {2}.
ko: {0} shift 연산자에 유형 불일치가 존재합니다. {1} 및 {2} 유형의 피연산자를 발견했습니다.
pt_br: Uma incompatibilidade de tipo existe no operador de mudança {0}. Operandos dos tipos {1} e {2} foram encontrados.
zh_tw: {0} 移位運算子處存在類型不符。找到了 {1} 及 {2} 類型的運算元。

# CDISP0658E
source: A type mismatch exists at the {0} infix operator. Operands of the {1} and {2} types are found, but operands of type {3} are expected.
de: Beim eingebetteten Operator {0} liegt eine Typabweichung vor. Operanden der Typen {1} und {2} wurden gefunden, jedoch wurden Operanden des Typs {3} erwartet.
es: Existe una discrepancia de tipo en el operador de infix {0}. Se han encontrado operandos de los tipos {1} y {2}, pero se esperan operandos del tipo {3}.
ko: {0} infix 연산자에 유형 불일치가 존재합니다. {1} 및 {2} 유형의 피연산자가 발견되었으나 기대된 항목은 유형 {3}의 피연산자입니다.
pt_br: Uma incompatibilidade de tipo existe no operador infix {0}. Foram localizados operandos dos tipos {1} e {2}, mas são esperados operandos do tipo {3}.
zh_tw: {0} 中置運算子處存在類型不符。找到了 {1} 及 {2} 類型的運算元，但卻預期類型為 {3} 的運算元。

# CDISP0659E
source: numeric, timestamp, or string
de: numeric, timestamp oder string
es: numérico, fecha y hora o serie
ko: 숫자, 시간소인 또는 문자열
pt_br: numérico, registro de data e hora ou sequência
zh_tw: 數值、時間戳記或字串

# CDISP0660E
source: integral or boolean
de: integral oder boolean
es: integral o booleano
ko: 정수형 또는 부울
pt_br: integral ou booleano
zh_tw: 整數或布林值

# CDISP0661E
source: boolean
es: booleano
ko: 부울
pt_br: Booleano
zh_tw: 布林值

# CDISP0662E
source: integral
ko: 정수형
zh_tw: 整數

# CDISP0663E
source: numeric
es: numérico
ko: 숫자
pt_br: numéricos
zh_tw: 數值

# CDISP0664E
source: ordered
es: ordenado
ko: 순서 지정됨
pt_br: ordenada
zh_tw: 已排序

# CDISP0665E
source: numeric or timestamp
de: numeric oder timestamp
es: numérico o fecha y hora
ko: 숫자 또는 시간소인
pt_br: numérico ou registro de data e hora
zh_tw: 數值或時間戳記

# CDISP0666E
source: The transport statistics data failed to load in the following file: {0}. The error is: {1}.
de: Die statistischen Transportdaten konnten nicht in die folgende Datei geladen werden: {0}. Fehler: {1}.
es: Los datos de estadísticas de transporte no se han podido cargar en el archivo siguiente: {0}. El error es: {1}.
ko: 다음 파일에서 전송 통계 데이터 로드가 실패했습니다: {0}. 오류는 {1}입니다.
pt_br: Os dados de estatísticas de transporte falharam ao carregar no seguinte arquivo: {0}. O erro é: {1}.
zh_tw: 無法將傳輸統計資料載入下列檔案：{0}。錯誤為：{1}。

# CDISP0670E
source: Illegal consistent region topology: Operator {0} input port {1} has streams from both consistent and autonomous regions feeding it.
de: Unzulässige Topologie für konsistente Region: Dem Eingabeport {1} des Operators {0} werden Datenströme aus konsistenten und autonomen Regionen zugeführt.
es: Topología de región coherente ilegal: El puerto de entrada del operador {0} {1} tiene secuencias de ambas regiones, coherente y autónoma, que le proporcionan información.
ko: 잘못된 일관성 있는 영역 토폴로지: 연산자 {0} 입력 포트 {1}에 데이터를 전달하는 일관성 있는 영역 및 자율 영역의 스트림이 모두 포함되어 있습니다.
pt_br: Topologia de região consistente ilegal: a porta de entrada {1} do operador {0} está sendo alimentada por fluxos de regiões consistentes e autônomas.
zh_tw: 一致區域拓蹼無效：運算子 {0} 輸入埠 {1} 具有來自一致區域以及自主區域（作為資訊來源）的串流。

# CDISP0671E
source: The value of the {0} attribute of the {1} annotation is not unique.
de: Der Wert des Attributs {0} der Annotation {1} ist nicht eindeutig.
es: El valor del atributo {0} de la anotación {1} no es exclusivo.
ko: {1} 어노테이션의 {0} 속성에 대한 값이 고유하지 않습니다.
pt_br: O valor do atributo {0} da anotação {1} não é exclusivo.
zh_tw: {1} 註釋之 {0} 屬性的值不是唯一的。
