Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0218E
source: The {0} assignment expression is not an attribute expression. The operator model for the {1} operator expects an attribute expression.
de: Der Zuordnungsausdruck {0} ist kein Attributausdruck. Das Operatormodell für den Operator {1} erwartet einen Attributausdruck.
es: La expresión de asignación {0} no es una expresión de atributo. El modelo de operador para el operador {1} espera una expresión de atributo.
ko: {0} 지정 표현식이 속성 표현식이 아닙니다. {1} 연산자의 연산자 모델에서는 속성 표현식을 기대하고 있습니다.
pt_br: A expressão de designação {0} não é uma expressão do atributo. O modelo do operador para o operador {1} espera uma expressão de atributo.
zh_tw: {0} 指派表示式不是屬性表示式。{1} 運算子的運算子模型預期一個屬性表示式。

# CDISP0219E
source: The {0,number,0} value of the profiling parameter needs to be >= -1.
de: Der Wert {0,number,0} des Profilerstellungsparameters muss >= -1 sein.
es: El valor {0,número,0} del parámetro de perfilado debe ser >= -1.
ko: 프로파일링 매개변수의 {0,number,0} 값은 >= -1이어야 합니다.
pt_br: O valor {0,number,0} do parâmetro de criação de perfil precisa ser >= -1.
zh_tw: 側寫參數的 {0,number,0} 值需要大於或等於 -1。

# CDISP0220E
source: The sampling rate for profiling {0} must be a floating point value.
de: Die Stichprobenrate für Profilerstellung {0} muss ein Gleitkommawert sein.
es: LA tasa de muestreo para la creación de perfiles {0} debe ser un valor de coma flotante.
ko: 프로파일링의 샘플링 비율 {0}은(는) 부동 소수점 값이어야 합니다.
pt_br: A taxa de amostragem para a criação de perfil {0} deve ser um valor de vírgula flutuante.
zh_tw: 用於側寫 {0} 的取樣率必須是浮點數值。

# CDISP0221E
source: The sampling rate for profiling {0} needs to be >= 0 and <= 1.
de: Die Stichprobenrate für Profilerstellung {0} muss >= 0 und <= 1 sein.
es: La tasa de muestreo para la creación de perfiles {0} debe ser >= 0 y <= 1.
ko: 프로파일링의 샘플링 비율 {0}은(는) >= 0 및 <= 1이어야 합니다.
pt_br: A taxa de amostragem para criação de perfil {0} precisa ser >= 0 e <= 1.
zh_tw: 用於側寫 {0} 的取樣率需要大於或等於 0 且小於或等於 1。

# CDISP0223E
source: A window is defined for port number {0,number,0} of the {1} operator, but the operator model specifies that the port must not define a window.
de: Ein Fenster ist für Portnummer {0,number,0} des Operators {1} definiert, das Operatormodell gibt jedoch an, dass der Port kein Fenster definieren darf.
es: Está definida una ventana para el número de puerto {0,número,0} del operador {1}, pero el modelo de operador especifica que el puerto no debe definir una ventana.
ko: {1} 연산자의 {0,number,0} 포트 번호에 대해 창이 정의되었으나 연산자 모델에는 포트에서 창을 정의하지 않도록 지정되어 있습니다.
pt_br: Uma janela está definida para o número da porta {0,number,0} do operador {1}, mas o modelo do operador especifica que a porta não deve definir uma janela.
zh_tw: 已對 {1} 運算子的埠號 {0,number,0} 定義了視窗，但運算子模型卻指定該埠不得定義視窗。

# CDISP0224E
source: A window is not defined for port number {0,number,0} of the {1} operator, but the operator model specifies that the port requires a window.
de: Ein Fenster ist für Portnummer {0,number,0} des Operators {1} nicht definiert, das Operatormodell gibt jedoch an, dass der Port ein Fenster erfordert.
es: No está definida una ventana para el número de puerto {0,número,0} del operador {1}, pero el modelo de operador especifica que el puerto requiere una ventana.
ko: {1} 연산자의 {0,number,0} 포트 번호에 대해 창이 정의되지 않았으나 연산자 모델에는 포트에서 창을 요구하도록 지정되어 있습니다.
pt_br: Uma janela não está definida para o número da porta {0,number,0} do operador {1}, mas o modelo do operador especifica que a porta requer uma janela.
zh_tw: 未對 {1} 運算子的埠號 {0,number,0} 定義視窗，但運算子模型卻指定該埠需要視窗。

# CDISP0225E
source: The logic clause in the {0} operator modifies the incoming tuple of port number {1,number,0}. However, the operator model specifies that this tuple is not mutable.
de: Die Klausel ''logic'' im Operator {0} modifiziert das ankommende Tupel der Portnummer {1,number,0}. Das Operatormodell gibt jedoch an, dass dieses Tupel nicht veränderbar ist.
es: La cláusula lógica del operador {0} modifica la tupla entrante del número de puerto {1,número,0}. Sin embargo, el modelo de operador especifica que esta tuple no es mutable.
ko: {0} 연산자의 logic 절이 포트 번호 {1,number,0}의 수신 튜플을 수정합니다. 그러나 연산자 모델에는 이 튜플을 변경할 수 없다고 지정되어 있습니다.
pt_br: A cláusula de lógica no operador {0} modifica a tupla de entrada de número de porta {1,number,0}. No entanto, o modelo do operador especifica que esta tupla não é mutável.
zh_tw: {0} 運算子中的 logic 子句修改了埠號 {1,number,0} 的送入值組。不過，運算子模型卻指定此值組不可變。

# CDISP0226E
source: The output clause in the {0} operator modifies the incoming tuple of port number {1,number,0}. However, the operator model specifies that this tuple is not mutable.
de: Die Klausel ''output'' im Operator {0} modifiziert das ankommende Tupel der Portnummer {1,number,0}. Das Operatormodell gibt jedoch an, dass dieses Tupel nicht veränderbar ist.
es: La cláusula de salida del operador {0} modifica la tupla entrante del número de puerto {1,número,0}. Sin embargo, el modelo de operador especifica que esta tuple no es mutable.
ko: {0} 연산자의 output 절이 포트 번호 {1,number,0}의 수신 튜플을 수정합니다. 그러나 연산자 모델에는 이 튜플을 변경할 수 없다고 지정되어 있습니다.
pt_br: A cláusula de saída no operador {0} modifica a tupla recebida de número de porta {1,number,0}. No entanto, o modelo do operador especifica que esta tupla não é mutável.
zh_tw: {0} 運算子中的 output 子句修改了埠號 {1,number,0} 的送入值組。不過，運算子模型卻指定此值組不可變。

# CDISP0227E
source: The {0} parameter in the {1} operator modifies the incoming tuple of port number {2,number,0}. However, the operator model specifies that this tuple is not mutable.
de: Der Parameter {0} im Operator {1} modifiziert das ankommende Tupel der Portnummer {2,number,0}. Das Operatormodell gibt jedoch an, dass dieses Tupel nicht veränderbar ist.
es: El parámetro {0} del operador {1} modifica la tupla entrante del número de puerto {2,número,0}. Sin embargo, el modelo de operador especifica que esta tuple no es mutable.
ko: {1} 연산자의 {0} 매개변수가 {2,number,0} 포트 번호의 수신 튜플을 수정합니다. 그러나 연산자 모델에는 이 튜플을 변경할 수 없다고 지정되어 있습니다.
pt_br: O parâmetro {0} no operador {1} modifica a tupla recebida do número de porta {2,number,0}. No entanto, o modelo do operador especifica que esta tupla não é mutável.
zh_tw: {1} 運算子中的 {0} 參數修改了埠號 {2,number,0} 的送入值組。不過，運算子模型卻指定此值組不可變。

# CDISP0228E
source: A port is accessed by the {0} expression in the {1} parameter, but the operator model for the {2} operator does not allow access to this port.
de: Der Ausdruck {0} im Parameter {1} greift auf einen Port zu, das Operatormodell für den Operator {2} lässt jedoch keinen Zugriff auf diesen Port zu.
es: La expresión {0} accede a un puerto en el parámetro {1}, pero el modelo de operador para el operador {2} no permite el acceso a este puerto.
ko: {1} 매개변수의 {0} 표현식에서 포트에 액세스하지만, {2} 연산자의 연산자 모델에서는 이 포트에 대한 액세스를 허용하지 않습니다.
pt_br: Uma porta é acessada pela expressão {0} no parâmetro {1}, mas o modelo do operador para o operador {2} não permite acesso a esta porta.
zh_tw: {1} 參數中的 {0} 表示式存取了某個埠，但是 {2} 運算子的運算子模型卻不容許存取此埠。

# CDISP0229E
source: The port number {0,number,0} is not valid
de: Die Portnummer {0,number,0} ist nicht gültig.
es: El número de puerto {0,número,0} no es válido
ko: 포트 번호 {0,number,0}이(가) 유효하지 않습니다.
pt_br: O número da porta {0,number,0} não é válido
zh_tw: 埠號 {0,number,0} 無效

# CDISP0230E
source: The following main composite name is not a valid identifier: {0}.
de: Der folgende Hauptverbundname ist keine gültige Kennung: {0}.
es: El nombre compuesto principal siguiente no es un identificador válido: {0}.
ko: 다음 기본 복합 이름은 유효한 ID가 아닙니다: {0}.
pt_br: O nome composto principal a seguir não é um identificador válido: {0}.
zh_tw: 下列主要複合項名稱不是有效 ID：{0}。

# CDISP0231E
source: The output clause in the {0} operator specifies assignment expressions for output port number {1,number,0}, but the value for the expression mode is specified as Nonexistent in the operator model.
de: Die Klausel ''output'' im Operator {0} gibt Zuweisungsausdrücke für Ausgabeportnummer {1,number,0} an, der Wert für den Ausdrucksmodus ist im Operatormodell jedoch als ''Nonexistent'' angegeben.
es: La cláusula de salida del operador {0} especifica expresiones de asignación para el número de puerto de salida {1,número,0}, pero el valor para la modalidad de expresión se especifica como Nonexistent (no existente) en el modelo de operador.
ko: {0} 연산자의 output 절에서 출력 포트 번호 {1,number,0}에 대한 지정 표현식을 지정하지만 연산자 모델에 표현식 모드의 값이 Nonexistent로 지정되어 있습니다.
pt_br: A cláusula de saída no operador {0} especifica expressões de designação para o número da porta de saída {1,number,0}, mas o valor para o modo de expressão está especificado como Nonexistent no modelo do operador.
zh_tw: {0} 運算子中的 output 子句對輸出埠號 {1,number,0} 指定了指派表示式，但在運算子模型中，卻將表示式模式的值指定為 Nonexistent。

# CDISP0232E
source: An error was encountered during the generation of the code for the {0} operator.
de: Während der Generierung des Codes für den Operator {0} ist ein Fehler aufgetreten.
es: Se ha encontrado un error durante la generación del código para el operador {0}.
ko: {0} 연산자에 대한 코드 생성 중에 오류가 발생했습니다.
pt_br: Um erro foi encontrado durante a geração do código para o operador {0}.
zh_tw: 產生 {0} 運算子的程式碼期間發生錯誤。

# CDISP0236E
source: The {0} environment variable is not set.
de: Die Umgebungsvariable {0} ist nicht festgelegt.
es: La variable de entorno {0} no está establecida.
ko: {0} 환경 변수가 설정되지 않았습니다.
pt_br: A variável de ambiente {0} não está configurada.
zh_tw: 未設定 {0} 環境變數。

# CDISP0238E
source: The {0} function expects a string literal, but found the following expression: {1}.
de: Die Funktion {0} erwartet ein Zeichenfolgeliteral, aber der folgende Ausdruck wurde gefunden: {1}.
es: La función {0} espera un literal de serie, pero se ha encontrado la expresión siguiente: {1}.
ko: {0} 함수에서 문자열 리터럴을 기대했으나 다음 표현식을 발견했습니다: {1}.
pt_br: A função {0} espera uma sequência literal, mas encontrou a seguinte expressão: {1}.
zh_tw: {0} 函數預期一個字串文字，但卻找到下列表示式：{1}。

# CDISP0239E
source: A compile time cast failed. The error is: {0}.
de: Eine Kompilierzeitumsetzung ist fehlgeschlagen. Fehler: {0}.
es: La conversión de tipo de datos del tiempo de compilación ha fallado. El error es: {0}.
ko: 컴파일 시간 캐스트가 실패했습니다. 오류는 {0}입니다.
pt_br: Uma conversão de tempo de compilação falhou. O erro é: {0}.
zh_tw: 編譯時期強制轉型失敗。錯誤為：{0}。

# CDISP0240E
source: The boolean type is expected for the {0} predicate, but the following type is found: {1}.
de: Für das Prädikat {0} wird der boolesche Typ erwartet, es wurde jedoch der folgende Typ gefunden: {1}.
es: Se espera el tipo booleano para el predicado {0}, pero se ha encontrado el tipo siguiente: {1}.
ko: {0} 술어에 대해 boolean 유형이 기대되었으나 다음 유형을 발견했습니다: {1}.
pt_br: O tipo booleano é esperado para o predicado {0}, mas o tipo a seguir foi localizado: {1}.
zh_tw: {0} 述詞預期布林類型，但卻找到下列類型：{1}。

# CDISP0241E
source: Cannot find the location for the {0} library, version {1} (Description {2}) in the META-INF/SC.MF file.
de: Die Position für die Bibliothek {0}, Version {1} (Beschreibung {2}) kann in der Datei META-INF/SC.MF nicht gefunden werden.
es: No se puede encontrar la ubicación para la biblioteca {0}, versión {1} (Descripción {2}) en el archivo META-INF/SC.MF.
pt_br: Não é possível encontrar o local para a biblioteca {0}, versão {1} (descrição {2}) no arquivo META-INF/SC.MF.
zh_tw: 在 META-INF/SC.MF 檔中，找不到 {0} 程式庫 {1} 版（說明 {2}）的位置。

# CDISP0242T
source: Creating the SPL Makefile.
de: SPL-Makefile wird erstellt.
es: Creando el archivo make de SPL
ko: SPL Makefile을 작성하는 중입니다.
pt_br: Criando o Makefile do SPL.
zh_tw: 正在建立 SPL make 檔。

# CDISP0243T
source: Creating the types.
de: Typen werden erstellt.
es: Creando los tipos.
ko: 유형을 작성하는 중입니다.
pt_br: Criando os tipos.
zh_tw: 正在建立類型。

# CDISP0244T
source: Creating the functions.
de: Funktionen werden erstellt.
es: Creando las funciones.
ko: 함수를 작성하는 중입니다.
pt_br: Criando as funções.
zh_tw: 正在建立函數。

# CDISP0245T
source: Building the binaries.
de: Binarys werden erstellt.
es: Creando los binarios.
ko: 바이너리를 빌드하는 중입니다.
pt_br: Construindo os binários.
zh_tw: 正在建置二進位檔。

# CDISP0247E
source: Interrupted.
de: Unterbrochen.
es: Interrumpido.
ko: 인터럽트되었습니다.
pt_br: Interrompido.
zh_tw: 已岔斷。

# CDISP0248I
source: Skipping the generation of the header for {0} {1}.
de: Generierung des Headers für {0} {1} wird übersprungen.
es: Omitiendo la generación de la cabecera para {0} {1}.
ko: {0} {1}의 헤더 생성을 건너뛰는 중입니다.
pt_br: Ignorando a geração do cabeçalho para {0} {1}.
zh_tw: 正在跳過產生 {0} {1} 的標頭。

# CDISP0249I
source: Skipping the generation of the source for {0} {1}.
de: Generierung der Quelle für {0} {1} wird übersprungen.
es: Omitiendo la generación del origen para {0} {1}.
ko: {0} {1}의 소스 생성을 건너뛰는 중입니다.
pt_br: Ignorando a geração da origem para {0} {1}.
zh_tw: 正在跳過產生 {0} {1} 的原始檔。

# CDISP0250I
source: Generating the header for {0} {1}.
de: Header für {0} {1} wird generiert.
es: Generando la cabecera para {0} {1}.
ko: {0} {1}의 헤더를 생성하는 중입니다.
pt_br: Gerando o cabeçalho para {0} {1}.
zh_tw: 正在產生 {0} {1} 的標頭。

# CDISP0251I
source: Generating the source for {0} {1}.
de: Quelle für {0} {1} wird generiert.
es: Generando el origen para {0} {1}.
ko: {0} {1}의 소스를 생성하는 중입니다.
pt_br: Gerando a origem para {0} {1}.
zh_tw: 正在產生 {0} {1} 的原始檔。

# CDISP0252I
source: Creating the code generator for {0}.
de: Codegenerator für {0} wird erstellt.
es: Creando el generador de códigos para {0}.
ko: {0}의 코드 생성 프로그램을 작성하는 중입니다.
pt_br: Criando o gerador de código para {0}.
zh_tw: 正在建立 {0} 的程式碼產生器。

# CDISP0253T
source: Creating the operators.
de: Operatoren werden erstellt.
es: Creando los operadores.
ko: 연산자를 작성하는 중입니다.
pt_br: Criando os operadores.
zh_tw: 正在建立運算子。

# CDISP0254T
source: Creating the processing elements.
de: Verarbeitungselemente werden erstellt.
es: Creando los elementos de proceso.
ko: 처리 요소를 작성하는 중입니다.
pt_br: Criando os elementos de processamento.
zh_tw: 正在建立處理元素。

# CDISP0256T
source: Creating the application model.
de: Anwendungsmodell wird erstellt.
es: Creando el modelo de aplicación.
ko: 애플리케이션 모델을 작성하는 중입니다.
pt_br: Criando o modelo de aplicativo.
zh_tw: 正在建立應用程式模型。

# CDISP0262E
source: The following value for the maximum processing element cpu fraction must be a floating point value: {0}.
de: Der folgende Wert für den maximalen CPU-Bruchteil des Verarbeitungselements muss ein Gleitkommawert sein: {0}.
es: El valor siguiente para la fracción máxima de CPU de elemento de proceso debe ser un valor de coma flotante: {0}.
ko: 최대 처리 요소 CPU 소수에 대한 다음 값은 부동 소수점 값이어야 합니다: {0}.
pt_br: O valor a seguir para a fração máxima do elemento de processamento da CPU deve ser um valor de vírgula flutuante: {0}.
zh_tw: 上限處理元素 CPU 分數的下列值必須是浮點數值：{0}。

# CDISP0263E
source: The {0} argument value for the maximum PE cpu fraction needs to be >= 0.
de: Der Argumentwert {0} für den maximalen PE-CPU-Bruchteil muss >= 0 sein.
es: El valor de argumento {0} para la fracción máxima de CPU PE debe ser >= 0.
ko: 최대 PE CPU 소수에 대한 {0} 인수 값은 >= 0이어야 합니다.
pt_br: O valor do argumento {0} para a fração máxima PE da CPU precisa ser >= 0.
zh_tw: 上限 PE CPU 分數的 {0} 引數值需要大於或等於 0。

# CDISP0284E
source: The {0} value of the partition exlocation for the {1} and {2} operators conflicts with the direct or transitive partition colocation of the operators.
de: Der Wert {0} der Partitionsexlokation für die Operatoren {1} und {2} steht in Konflikt mit der direkten oder transitiven Partitionskolokation der Operatoren.
es: El valor {0} de la ubicación externa de la partición para los operadores {1} y {2} entra en conflicto con la ubicación conjunta de partición directa o transitiva de los operadores.
ko: {1} 및 {2} 연산자의 파티션 외부 배치 값 {0}이(가) 연산자의 직접 또는 임시 파티션 동일 배치와 충돌합니다.
pt_br: O valor {0} do deslocamento da partição para os operadores {1} e {2} conflita com a colocação de partição direta ou transitiva dos operadores.
zh_tw: {1} 與 {2} 運算子之分割區 exlocation 的 {0} 值與運算子的直接或轉換分割區 colocation 相衝突。

# CDISP0285E
source: The {0} operator can be restarted, but the {1} cannot be restarted, which conflicts with the direct or transitive partition colocation of the operators.
de: Der Operator {0} kann erneut gestartet werden, {1} kann jedoch nicht erneut gestartet werden, wodurch ein Konflikt mit der direkten oder transitiven Partitionszusammenstellung der Operatoren entsteht.
es: El operador {0} se puede reiniciar, pero {1} no se puede reiniciar, lo que entra en conflicto con la colocación de partición directa o transitiva de los operadores.
ko: {0} 연산자를 재시작할 수 있으나 {1}을(를) 재시작할 수는 없으며, 이는 이들 연산자의 직접 또는 임시 동일 파티션에 배치와 충돌합니다.
pt_br: O operador {0} pode ser reiniciado, mas o {1} não pode ser reiniciado, conflitando com a colocação de partição direta ou transitiva dos operadores.
zh_tw: 可以重新啟動 {0} 運算子，但卻無法重新啟動 {1}，後者與運算子的直接或轉換分割區 colocation 相衝突。

# CDISP0286E
source: The {0} operator can be relocated, but the {1} operator cannot be relocated, which conflicts with the direct or transitive partition colocation of the operators.
de: Der Operator {0} kann verlagert werden, der Operator {1} kann jedoch nicht verlagert werden, wodurch ein Konflikt mit der direkten oder transitiven Partitionszusammenstellung der Operatoren entsteht.
es: El operador {0} se puede reubicar, pero el operador {1} no se puede reubicar, lo cual entra en conflicto con la colocación de partición directa o transitiva de los operadores.
ko: {0} 연산자를 재배치할 수 있으나 {1} 연산자를 재배치할 수는 없으며, 이는 이들 연산자의 직접 또는 임시 동일 파티션에 배치와 충돌합니다.
pt_br: O operador {0} pode ser realocado, mas o operador {1} não pode ser realocado, conflitando com a colocação de partição direta ou transitiva dos operadores.
zh_tw: 可以重新定位 {0} 運算子，但卻無法重新定位 {1} 運算子，後者與運算子的直接或轉換分割區 colocation 相衝突。

# CDISP0287E
source: The {0} operator can be relocated, and must also be able to be restarted.
de: Der Operator {0} kann verlagert werden und muss erneut gestartet werden können.
es: El operador {0} se puede reubicar y también se debe poder reiniciar.
ko: {0} 연산자는 재배치할 수 있으며, 재시작할 수도 있어야 합니다.
pt_br: O operador {0} pode ser realocado e também deve ser capaz de reiniciar.
zh_tw: 可以重新定位 {0} 運算子，也必須能夠重新啟動該運算子。

# CDISP0288E
source: The {0} host exlocation values of the {1} and {2} operators conflicts with the direct or transitive partition colocation of the operators.
de: Die Hostexlokationswerte {0} der Operatoren {1} und {2} stehen in Konflikt mit der direkten oder transitiven Partitionskolokation der Operatoren.
es: Los valores ubicación externa de host {0} de los operadores {1} y {2} entran en conflicto con la ubicación conjunta de partición directa o transitiva de los operadores.
ko: {1} 및 {2} 연산자의 호스트 외부 배치 값 {0}이(가) 이들 연산자의 직접 또는 임시 파티션 동일 배치와 충돌합니다.
pt_br: Os valores de deslocamento de host {0} dos operadores {1} e {2} conflita com a colocação de partição direta ou transitiva dos operadores.
zh_tw: {1} 與 {2} 運算子的 {0} 主機 exlocation 值與運算子的直接或轉換分割區 colocation 相衝突。

# CDISP0289E
source: The specification of partition isolation for the {0} operator conflicts with the specification of direct or transitive partition colocation with the {1} operator.
de: Die Spezifikation der Partitionsisolation für den Operator {0} steht in Konflikt mit der Spezifikation von direkter oder transitiver Partitionszusammenstellung mit dem Operator {1}.
es: La especificación de aislamiento de partición para el operador {0} entra en conflicto con la especificación de la colocación de partición directa o transitiva con el operador {1}.
ko: {0} 연산자에 대한 파티션 격리 지정이 {1} 연산자에 대한 직접 또는 임시 동일 파티션에 배치 지정과 충돌합니다.
pt_br: A especificação do isolamento de partição para o operador {0} conflita com a especificação da colocação de partição direta ou transitiva com o operador {1}.
zh_tw: {0} 運算子的分割區隔離規格與 {1} 運算子的直接或轉換分割區 colocation 規格相衝突。

# CDISP0290E
source: The {0} specification of host exlocation for the {1} and {2} operators conflicts with the direct or transitive specification of host colocation for these operators.
de: Die Spezifikation {0} der Hostexlokation für die Operatoren {1} und {2} steht in Konflikt mit der direkten oder transitiven Spezifikation der Hostkolokation für diese Operatoren.
es: La especificación {0} de la ubicación externa de host para los operadores {1} y {2} entra en conflicto con la especificación directa o transitiva de ubicación conjunta de host para estos operadores.
ko: {1} 및 {2} 연산자에 대한 {0} 호스트 외부 배치 지정이 이들 연산자에 대한 직접 또는 임시 호스트 동일 배치 지정과 충돌합니다.
pt_br: A especificação {0} de deslocamento de host para os operadores {1} e {2} conflita com a especificação direta ou transitiva de colocação de host para estes operadores.
zh_tw: {1} 與 {2} 運算子之主機 exlocation 的 {0} 規格與這些運算子之主機 colocation 的直接或轉換規格相衝突。

# CDISP0291E
source: The host isolation of the {0} operator and the direct or transitive host colocation of this operator with the {2} and {3} operators imply that these three operators must be placed in a single partition. The placement of these three operators in a single partition conflicts with the {1} partition exlocation value of the {4} and {5} operators.
de: Die Hostisolation des Operators {0} und die direkte oder transitive Hostkolokation dieses Operators mit den Operatoren {2} und {3} implizieren, dass diese drei Operatoren auf eine einzelne Partition verteilt werden müssen. Die Verteilung dieser drei Operatoren auf eine einzelne Partition steht in Konflikt mit dem Partitionsexlokationswert {1} der Operatoren {4} und {5}.
es: El aislamiento del host del operador {0} y la colocación de host directa o transitiva de este operador con los operadores {2} y {3} implican que estos tres operadores se deben colocar en una sola partición. La colocación de estos tres operadores en una sola partición entra en conflicto con el valor de ubicación externa de partición {1} de los operadores {4} y {5}.
ko: {0} 연산자의 호스트 격리, 그리고 {2} 및 {3} 연산자와 이 연산자의 직접 또는 임시 동일 호스트에 배치는 이들 세 연산자를 하나의 파티션에 배치해야 함을 내포합니다. 이들 연산자를 하나의 파티션에 배치하는 것은 {4} 및 {5} 연산자의 {1} 파티션 외부 배치 값과 충돌합니다.
pt_br: O isolamento do host do operador {0} e a colocação de host direta ou transitiva deste operador com os operadores {2} e {3} significam que estes três operadores devem ser colocados em uma única partição. O posicionamento destes três operadores em uma única partição conflita com o valor de deslocamento da partição {1} dos operadores {4} e {5}.
zh_tw: {0} 運算子的主機隔離以及此運算子與 {2} 和 {3} 運算子的直接或轉換主機 colocation，默示必須將這三個運算子放置在單個分割區中。這三個運算子在單個分割區中的放置與 {4} 和 {5} 運算子的 {1} 分割區 exlocation 值相衝突。
