Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP9186E
source: The first argument to the {0} function needs to be an rstring literal, but the {1} expression for output port number {2} was found.
de: Das erste Argument für die Funktion {0} muss ein rstring-Literal sein, jedoch wurde der Ausdruck {1} für Ausgabeportnummer {2} gefunden.
es: El primer argumento en la función {0} debe ser un literal rstring, pero se ha encontrado la expresión {1} para el número de puerto de salida {2}.
ko: {0} 함수의 첫 번째 인수는 rstring 리터럴이어야 하지만 출력 포트 번호 {2}에 대한 {1} 표현식을 발견했습니다.
pt_br: O primeiro argumento para a função {0} precisa ser um rstring literal, mas a expressão {1} para o número da porta de saída {2} foi localizada.
zh_tw: {0} 函數的第一個引數需要是 rstring 文字，但卻找到輸出埠號 {2} 的 {1} 表示式。

# CDISP9187E
source: The XPathMap argument must be @* or \@name, but the {0} XPath expression for the {1} attribute was found.
de: Das XPathMap-Argument muss @* oder \@name sein, jedoch wurde der XPath-Ausdruck {0} für das Attribut {1} gefunden.
es: El argumento de XPathMap debe ser @* o \@name, pero se ha encontrado la expresión XPath {0} para el atributo {1}.
ko: XPathMap 인수는 @* 또는 \@name이어야 하지만 {1} 속성에 대한 {0} XPath 표현식을 발견했습니다.
pt_br: O argumento XPathMap deve ser @* ou \@name, mas a expressão XPath {0} para o atributo {1} foi localizada.
zh_tw: XPathMap 引數必須是 @* 或 \@name，但卻找到 {1} 屬性的 {0} XPath 表示式。

# CDISP9188E
source: All the expressions in an XPath tuple must be XPath, XPathList or XPathMap expressions, but the {0} expression was found.
de: Alle Ausdrücke in einem XPath-Tupel müssen XPath-, XPathList- oder XPathMap-Ausdrücke sein, jedoch wurde der Ausdruck {0} gefunden.
es: Todas las expresiones de una tupla XPath deben ser expresiones XPath, XPathList o XPathMap, pero se ha encontrado la expresión {0}.
ko: XPath 튜플에 있는 모든 표현식은 XPath, XPathList 또는 XPathMap 표현식이어야 하지만 {0} 표현식을 발견했습니다.
pt_br: Todas as expressões em uma tupla do XPath devem ser expressões XPath, XPathList ou XPathMap, mas a expressão {0} foi localizada.
zh_tw: XPath 值組中的所有表示式都必須是 XPath、XPathList 或 XPathMap 表示式，但卻找到 {0} 表示式。

# CDISP9189E
source: The second argument to the {0} function is the {1} expression, but a tuple literal for output port number {2} is required.
de: Das zweite Argument für die Funktion {0} ist der Ausdruck {1}, jedoch ist ein Tupelliteral für Ausgabeportnummer {2} erforderlich.
es: El segundo argumento en la función {0} es la expresión {1}, pero es necesario un literal de tupla para el número de puerto de salida {2}.
ko: {0} 함수에 대한 두 번째 인수가 {1} 표현식이지만 출력 포트 번호 {2}에 대한 튜플 리터럴이 필요합니다.
pt_br: O segundo argumento para a função {0} é a expressão {1}, mas um literal de tupla para o número da porta de saída {2} é necessário.
zh_tw: {0} 函數的第二個引數是 {1} 表示式，但需要輸出埠號 {2} 的值組文字。

# CDISP9190E
source: The {0} XPath component in the {1} XPath expression for output port number {2} is not valid.
de: Die XPath-Komponente {0} im XPath-Ausdruck {1} für Ausgabeportnummer {2} ist nicht gültig.
es: El componente XPath {0} en la expresión XPath {1} para el número de puerto de salida {2} no es válido.
ko: 출력 포트 번호 {2}에 대한 {1} XPath 표현식의 {0} XPath 구성요소가 유효하지 않습니다.
pt_br: O componente XPath {0} na expressão XPath {1} para o número da porta de saída {2} não é válido.
zh_tw: 在輸出埠號 {2} 的 {1} XPath 表示式中，{0} XPath 元件無效。

# CDISP9191E
source: The {0} final XPath component in the {1} XPath expression for output port number {2} is not valid.
de: Die letzte XPath-Komponente {0} im XPath-Ausdruck {1} für Ausgabeportnummer {2} ist nicht gültig.
es: El componente XPath final {0} en la expresión XPath {1} para el número de puerto de salida {2} no es válido.
ko: 출력 포트 번호 {2}에 대한 {1} XPath 표현식의 {0} 최종 XPath 구성요소가 유효하지 않습니다.
pt_br: O componente XPath final {0} na expressão XPath {1} para o número da porta de saída {2} não é válido.
zh_tw: 在輸出埠號 {2} 的 {1} XPath 表示式中，{0} 最終 XPath 元件無效。

# CDISP9192E
source: The {0} file parameter of the FileSink operator can reference input attributes only if the closeMode parameter is dynamic.
de: Der Parameter ''file: {0}'' des Operators ''FileSink'' kann nur Eingabeattribute referenzieren, wenn der Parameter ''closeMode'' auf ''dynamic'' gesetzt ist.
es: El parámetro de archivo {0} del operador FileSink puede hacer referencia solo a atributos de entrada, si el parámetro closeMode es dinámico.
ko: FileSink 연산자의 {0} file 매개변수는 closeMode 매개변수가 dynamic인 경우에만 입력 속성을 참조할 수 있습니다.
pt_br: O parâmetro de arquivo {0} do operador FileSink pode referenciar atributos de entrada somente se o parâmetro closeMode for dinâmico.
zh_tw: 僅當 closeMode 參數是動態參數時，FileSink 運算子的 {0} file 參數才可以參照輸入屬性。

# CDISP9193E
source: The readPunctuations option is valid only when the value of the format parameter is bin.
de: Die Option ''readPunctuations'' ist nur gültig, wenn für den Parameter ''format'' der Wert ''bin'' angegeben ist.
es: La opción readPunctuations solo es válida cuando el valor del parámetro de formato es bin.
ko: readPunctuations 옵션은 format 매개변수의 값이 bin인 경우에만 유효합니다.
pt_br: A opção readPunctuations é válida somente quando o valor do parâmetro de formato for bin.
zh_tw: 僅當 format 參數的值是 bin 時，readPunctuations 選項才有效。

# CDISP9194E
source: The {0} and {1} parameters conflict with each other.
de: Die Parameter {0} und {1} stehen in Konflikt.
es: Los parámetros {0} y {1} entran en conflicto entre sí.
ko: {0} 및 {1} 매개변수가 서로 충돌합니다.
pt_br: Os parâmetros {0} e {1} conflitam entre si.
zh_tw: {0} 與 {1} 參數彼此衝突。

# CDISP9195E
source: The types of the delta and the deltaAttribute parameters must be the same.
de: Die Typen der Parameter ''delta'' und ''deltaAttribute'' müssen identisch sein.
es: Los tipos de los parámetros delta y deltaAttribute deben ser el mismo.
ko: delta 및 deltaAttribute 매개변수의 유형은 동일해야 합니다.
pt_br: Os tipos de delta e os parâmetros deltaAttribute devem ser os mesmos.
zh_tw: delta 參數與 deltaAttribute 參數的類型必須相同。

# CDISP9196E
source: The delta and deltaAttribute parameters must both exist.
de: Die Parameter ''delta'' und ''deltaAttribute'' müssen beide vorhanden sein.
es: Deben existir ambos parámetros, delta y deltaAttribute.
ko: delta 및 deltaAttribute 매개변수는 둘 다 존재해야 합니다.
pt_br: Os parâmetros delta e deltaAttribute devem existir.
zh_tw: delta 參數與 deltaAttribute 參數必須都存在。

# CDISP9197E
source: The type of the delta parameter type must be numeric and ordered.
de: Der Typ des Parameters ''delta'' muss ''numeric'' oder ''ordered'' sein.
es: El tipo del parámetro delta debe ser numérico y ordenado.
ko: delta 매개변수의 유형은 숫자이며 순서 지정되는 유형이어야 합니다.
pt_br: O tipo de parâmetro delta deve ser numérico ou ordenado.
zh_tw: delta 參數的類型必須是數值和已排序。

# CDISP9198E
source: The ServerPort custom output function can be used only when the role is server.
de: Die angepasste Ausgabefunktion ''ServerPort'' kann nur verwendet werden, wenn die Rolle ''server'' ist.
es: La función de salida personalizada ServerPort solo se puede utilizar cuando el rol es servidor.
ko: ServerPort 사용자 정의 출력 함수는 역할이 서버인 경우에만 사용할 수 있습니다.
pt_br: A função de saída customizada ServerPort pode ser usada somente quando a função for servidor.
zh_tw: 僅當 role 是 server 時，才可以使用 ServerPort 自訂輸出函數。

# CDISP9199E
source: It is not valid to generate all the output attributes from the output clause of the {0} operator.
de: Es ist nicht gültig, alle Ausgabeattribute über die Klausel ''output'' des Operators {0} zu generieren.
es: No es válido generar todos los atributos de salida a partir de la cláusula de salida del operador {0}.
ko: {0} 연산자의 output 절로부터 모든 출력 속성을 생성하는 것은 유효하지 않습니다.
pt_br: Não é válido gerar todos os atributos de saída a partir da cláusula de saída do operador {0}.
zh_tw: 從 {0} 運算子的 output 子句產生所有輸出屬性是無效作業。

# CDISP9200E
source: The {0} output attribute must not reference an input attribute if the writePunctuations attribute is set to true.
de: Das Ausgabeattribut {0} darf kein Eingabeattribut referenzieren, wenn das Attribut ''writePunctuations'' auf ''true'' gesetzt ist.
es: El atributo de salida {0} no debe hacer referencia a un atributo de entrada si el atributo writePunctuations está establecido en true.
ko: writePunctuations 속성이 true로 설정된 경우 {0} 출력 속성은 입력 속성을 참조하지 않아야 합니다.
pt_br: O atributo de saída {0} não deverá referenciar um atributo de entrada se o atributo writePunctuations estiver configurado como true.
zh_tw: 如果將 writePunctuations 屬性設為 true，則 {0} 輸出屬性不得參照輸入屬性。

# CDISP9201E
source: The {0} input tuple must use only one blob attribute unless the {1} parameter is specified.
de: Das {0}-Eingabetupel darf nur ein Attribut des Typs ''blob'' verwenden, außer der Parameter {1} ist angegeben.
es: La tupla de entrada {0} debe utilizar solo un atributo de blob, a menos que se especifique el parámetro {1}.
ko: {0} 입력 튜플은 {1} 매개변수가 지정되지 않는 한 하나의 blob 속성만 사용해야 합니다.
pt_br: A tupla de entrada {0} deve utilizar somente um atributo blob, a menos que o parâmetro {1} esteja especificado.
zh_tw: 除非指定了 {1} 參數，否則 {0} 輸入值組必須僅使用一個二進位大型物件屬性。

# CDISP9202E
source: The {0} output tuple must use one blob attribute.
de: Das Ausgabetupel {0} muss ein Attribut des Typs ''blob'' verwenden.
es: La tupla de salida {0} debe utilizar un atributo de blob.
ko: {0} 출력 튜플은 하나의 blob 속성을 사용해야 합니다.
pt_br: A tupla de saída {0} deve usar um blob atributo.
zh_tw: {0} 輸出值組必須使用一個二進位大型物件屬性。

# CDISP9203E
source: The {0} argument to the {1} custom output function is not a function call.
de: Das Argument {0} für die angepasste Ausgabefunktion {1} ist kein Funktionsaufruf.
es: El argumento {0} en la función de salida personalizada {1} no es una llamada de función.
ko: {1} 사용자 정의 출력 함수에 대한 {0} 인수가 함수 호출이 아닙니다.
pt_br: O argumento {0} para a função de saída customizada {1} não é uma chamada de função.
zh_tw: {1} 自訂輸出函數的 {0} 引數不是函數呼叫。

# CDISP9204E
source: The {0} argument to the {1} custom output function must not reference an input stream attribute.
de: Das Argument {0} für die angepasste Ausgabefunktion {1} darf kein Eingabedatenstromattribut referenzieren.
es: El argumento {0} en la función de salida personalizada {1} no debe hacer referencia a un atributo de secuencia de entrada.
ko: {1} 사용자 정의 출력 함수에 대한 {0} 인수는 입력 스트림 속성을 참조하지 않아야 합니다.
pt_br: O argumento {0} para a função de saída customizada {1} não deve referenciar um atributo de fluxo de entrada.
zh_tw: {1} 自訂輸出函數的 {0} 引數不得參照輸入串流屬性。

# CDISP9205I
source: usage: {0} -h, --help | --dir <path> --name <name> --tname <toolkitName> --default <defaultDir> <langFile0> .. <langFileN> -h, --help Get (this) usage information --dir <path> Toolkit directory --name <name> Resource bundle name --tname <toolkitName> Toolkit name --default <defaultDir> Default xliff language directory <langFile0> .. <langFileN> xliff language files Builds a resource bundle with the given name from the given xliff files.
de: Syntax: {0} -h, --help | --dir <Pfad> --name <Name> --tname <Toolkitname> --default <Standardverzeichnis> <Sprachdatei0> .. <SprachdateiN> -h, --help (Diese) Syntaxinformationen abrufen --dir <Pfad> Toolkitverzeichnis --name <Name> Name des Ressourcenbundles --tname <Toolkitname> Toolkitname --default <Standardverzeichnis> xliff-Standardsprachverzeichnis <Sprachdatei0> .. <SprachdateiN> xliff-Dateien mit sprachabhängigen Anweisungen Erzeugt ein Ressourcenbundle mit dem angegebenen Namen aus den angegebenen xliff-Dateien.
es: uso: {0} -h, --help | --dir <path> --name <name> --tname <toolkitName> --default <defaultDir> <langFile0> .. <langFileN> -h, --help Obtener (esta) información de uso --dir <path> Directorio del kit de herramientas --name <name> Nombre de paquete de recursos --tname <toolkitName> Nombre de kit de herramientas --default <defaultDir> Directorio de lenguaje xliff predeterminado <langFile0> .. <langFileN> Archivos de lenguaje xliff Crea un paquete de recursos con el nombre dado en los archivos xliff proporcionados.
ko: 사용법: {0} -h, --help | --dir <path> --name <name> --tname <toolkitName> --default <defaultDir> <langFile0> .. <langFileN> -h, --help 사용법 정보를 가져옵니다. --dir <path> 툴킷 디렉토리입니다. --name <name> 자원 번들 이름입니다. --tname <toolkitName> 툴킷 이름입니다. --default <defaultDir> 기본 xliff 언어 디렉토리입니다. <langFile0> .. <langFileN> xliff 언어 파일 지정된 xliff 파일의 지정된 이름을 사용하여 자원 번들을 빌드합니다.
pt_br: uso: {0} -h, --help | --dir <path> --name <name> --tname <toolkitName> --default <defaultDir> <langFile0> .. <langFileN> -h, --help obtém (estas) informações de uso --dir <path> diretório do kit de ferramentas --name <name> nome do pacote configurável de recursos --tname <toolkitName> nome do kit de ferramentas --default <defaultDir> diretório de linguagem xliff padrão <langFile0> .. <langFileN> arquivos de linguagem xliff Constrói um pacote configurável de recursos com o nome fornecido a partir dos arquivos xliff fornecidos.
zh_tw: 用法：{0} -h, --help | --dir <path> --name <name> --tname <toolkitName> --default <defaultDir> <langFile0> .. <langFileN> -h, --help 取得（此）用法資訊 --dir <path> 工具箱目錄 --name <name> 資源軟體組名稱 --tname <toolkitName> 工具箱名稱 --default <defaultDir> 預設 xliff 語言目錄 <langFile0> .. <langFileN> xliff 語言檔案 從給定的 xliff 檔，使用給定的名稱建置資源軟體組。

# CDISP9206E
source: The {0} directory cannot be removed. The return code is {1}.
de: Das Verzeichnis {0} kann nicht entfernt werden. Rückgabecode: {1}.
es: El directorio {0} no se puede eliminar. El código de retorno es {1}.
ko: {0} 디렉토리를 제거할 수 없습니다. 리턴 코드는 {1}입니다.
pt_br: O diretório {0} não pode ser removido. O código de retorno é {1}.
zh_tw: 無法移除 {0} 目錄。回覆碼為 {1}。

# CDISP9207E
source: The {0} file cannot be removed. The return code is: {1}.
de: Die Datei {0} kann nicht entfernt werden. Rückgabecode: {1}.
es: El archivo {0} no se puede eliminar. El código de retorno es {1}.
ko: {0} 파일을 제거할 수 없습니다. 리턴 코드는 {1}입니다.
pt_br: O arquivo {0} não pode ser removido. O código de retorno é: {1}.
zh_tw: 無法移除 {0} 檔。回覆碼為：{1}。

# CDISP9208E
source: When the {0} resource bundle was processing, the default language file in the {1} directory was not found. Ensure that one of the <lang> elements in the info.xml file specifies a default value of true.
de: Während der Verarbeitung des Ressourcenbundles {0} wurde die Standardsprachendatei im Verzeichnis {1} nicht gefunden. Stellen Sie sicher, dass eins der <lang>-Elemente in der Datei ''info.xml'' den Standardwert ''true'' angibt.
es: Cuando se estaba procesando el paquete de recursos {0}, no se encontró el archivo de lenguaje predeterminado {1} en el directorio. Asegúrese de que uno de los elementos <lang> del archivo info.xml especifica un valor predeterminado de true.
ko: {0} 자원 빌드가 처리 중일 때 {1} 디렉토리에서 기본 언어 파일을 찾지 못했습니다. info.xml 파일의 <lang> 요소 중 하나가 기본값을 true로 설정하는지 확인하십시오.
pt_br: Quando o pacote configurável de recursos {0} estava processando, o arquivo de linguagem padrão no diretório {1} não foi localizado. Assegure-se de que um dos elementos <lang> no arquivo info.xml especifique um valor padrão de true.
zh_tw: 處理 {0} 資源軟體組時，找不到 {1} 目錄中的預設語言檔案。請確保 info.xml 檔內的其中一個 <lang> 元素指定了預設值 true。

# CDISP9209E
source: The {0} file was not found.
de: Die Datei {0} wurde nicht gefunden.
es: El archivo {0} no se ha encontrado.
ko: {0} 파일을 찾지 못했습니다.
pt_br: O arquivo {0} não foi localizado.
zh_tw: 找不到 {0} 檔案。

# CDISP9210E
source: The {0} resource bundle was not generated.
de: Das Ressourcenbundle {0} wurde nicht generiert.
es: El paquete de recursos {0} no se ha generado.
ko: {0} 자원 번들이 생성되지 않았습니다.
pt_br: O pacote configurável de recursos {0} não foi gerado.
zh_tw: 未產生 {0} 資源軟體組。

# CDISP9211E
source: The {0} xliff file was not converted.
de: Die xliff-Datei {0} wurde nicht konvertiert.
es: El archivo xliff {0} no se ha convertido.
ko: {0} xliff 파일이 변환되지 않았습니다.
pt_br: O arquivo xliff {0} não foi convertido.
zh_tw: 未轉換 {0} xliff 檔。

# CDISP9212E
source: The command failed to run genrb on the {0} file.
de: Der Befehl konnte genrb für die Datei {0} nicht ausführen.
es: El mandato no ha podido ejecutar genrb en el archivo {0}.
ko: 명령이 {0} 파일에 대해 genrb를 실행하는 데 실패했습니다.
pt_br: O comando falhou ao executar genrb no arquivo {0}.
zh_tw: 指令無法對 {0} 檔案執行 genrb。

# CDISP9213E
source: The {0} format string is not a supported format string.
de: Die Formatzeichenfolge {0} ist keine unterstützte Formatzeichenfolge.
es: La serie de formato {0} no es una serie de formato soportada.
ko: {0} 출력 문자열은 지원되는 출력 문자열이 아닙니다.
pt_br: A sequência de formatação {0} não é uma sequência de formatação suportada.
zh_tw: {0} 格式字串不受支援。

# CDISP9215E
source: The substitution variable indexes in the {0} message are not valid. Indexes must be positive integer values that start at 0 and increase in a linear way.
de: Die Substitutionsvariablenindizes in der Nachricht {0} sind nicht gültig. Indizes müssen positive Integerwerte sein, die mit 0 anfangen und linear zunehmen.
es: Los índices de la variable de sustitución en el mensaje {0} no son válidos. Los índices deben ser valores de entero positivo que empiezan por 0 y aumentan de forma lineal.
ko: {0} 메시지에 있는 대체 변수 인덱스가 유효하지 않습니다. 인덱스는 0부터 시작하며 선형으로 증가하는 양의 정수 값이어야 합니다.
pt_br: Os índices de variável de substituição na mensagem {0} não são válidos. Os índices devem ser valores de número inteiro positivo que iniciam em 0 e aumentam de forma linear.
zh_tw: {0} 訊息中的替代變數索引無效。索引必須是開始於 0 且以線性方式遞增的正整數值。

# CDISP9216I
source: usage: {0} -h, --help | -v, --verifier <verifier> -x, --model <xmlModel> -h, --help Get (this) usage information -v, --verifier <verifier> The verifier to be run -x, --model <xmlModel> The file containing the xml model to be verified This module verifies an Operator Instance XML model.
de: Syntax: {0} -h, --help | -v, --verifier <Prüffunktion> -x, --model <XML-Modell> -h, --help (Diese) Syntaxinformationen abrufen -v, --verifier <Prüffunktion> Die auszuführende Prüffunktion -x, --model <XML-Modell> Die Datei mit dem zu verifizierenden XML-Modell Dieses Modul verifiziert ein Operatorinstanz-XML-Modell.
es: uso: {0} -h, --help | -v, --verifier <verifier> -x, --model <xmlModel> -h, --help Obtener (esta) información de uso -v, --verifier <verifier> El verificador que se utilizará -x, --model <xmlModel> El archivo que contiene el modelo xml que se verificará Este módulo verifica un modelo XML de instancia de operador.
ko: 사용법: {0} -h, --help | -v, --verifier <verifier> -x, --model <xmlModel> -h, --help 사용법 정보를 가져옵니다. -v, --verifier <verifier> 실행할 확인자 -x, --model <xmlModel> 확인할 XML 모델을 포함하는 파일 이 모듈은 연산자 인스턴스 XML 모델을 확인합니다.
pt_br: uso: {0} -h, --help | -v, --verifier <verifier> -x, --model <xmlModel> -h, --help obtém (estas) informações de uso -v, --verifier <verifier> o verificador a ser executado -x, --model <xmlModel> o arquivo que contém o modelo XML a ser verificado Este módulo verifica um modelo XML de Instância do operador.
zh_tw: 用法：{0} -h, --help | -v, --verifier <verifier> -x, --model <xmlModel> -h, --help 取得（此）用法資訊 -v, --verifier <verifier> 要執行的驗證器 -x, --model <xmlModel> 包含要驗證之 XML 模型的檔案 此模組會驗證「運算子實例 XML」模型。

# CDISP9217E
source: A dynamic closeMode parameter must also use the retryFailedSends parameter that is set to true.
de: Ein dynamischer Parameter ''closeMode'' muss auch den Parameter ''retryFailedSends'' verwenden, der auf ''true'' gesetzt ist.
es: Un parámetro closeMode dinámico también debe utilizar el parámetro retryFailedSends que está establecido en true.
ko: dynamic closeMode 매개변수는 true로 설정된 retryFailedSends 매개변수 또한 사용해야 합니다.
pt_br: Um parâmetro closeMode dinâmico também deve usar o parâmetro retryFailedSends que é configurado para true.
zh_tw: 動態 closeMode 參數也必須使用已設為 true 的 retryFailedSends 參數。

# CDISP9218E
source: For a dynamic closeMode parameter, the role parameter must be set to client.
de: Für einen dynamischen Parameter ''closeMode'' muss der Parameter ''role'' auf ''client'' gesetzt werden.
es: Para un parámetro closeMode dinámico, el parámetro de rol debe estar establecido en cliente.
ko: dynamic closeMode 매개변수의 경우, role 매개변수는 client로 설정되어야 합니다.
pt_br: Para um parâmetro closeMode dinâmico, o parâmetro de função deve ser configurado para o cliente.
zh_tw: 對於動態 closeMode 參數，role 參數必須設定為 client。

# CDISP9219E
source: A dynamic closeMode parameter must use the {0} parameter.
de: Ein dynamischer Parameter ''closeMode'' muss den Parameter {0} verwenden.
es: Un parámetro closeMode dinámico debe utilizar el parámetro {0}.
ko: dynamic closeMode 매개변수는 {0} 매개변수를 사용해야 합니다.
pt_br: Um parâmetro closeMode dinâmico deve usar o parâmetro {0}.
zh_tw: 動態 closeMode 參數必須使用 {0} 參數。

# CDISP9220E
source: The {0} parameter can reference input attributes only if the closeMode parameter is dynamic.
de: Der Parameter {0} kann nur Eingabeattribute referenzieren, wenn der Parameter ''closeMode'' auf ''dynamic'' gesetzt ist.
es: El parámetro {0} puede hacer referencia a atributos de entrada solo si el parámetro closeMode es dinámico.
ko: {0} 매개변수는 closeMode 매개변수가 dynamic으로 설정된 경우에만 입력 속성을 참조할 수 있습니다.
pt_br: O parâmetro {0} poderá referenciar atributos de entrada somente se o parâmetro closeMode for dinâmico.
zh_tw: 僅當 closeMode 參數是動態參數時，{0} 參數才可以參照輸入屬性。

# CDISP9221I
source: usage: {0} -h, --help | [-x, --xmlout] <ADL file name> -h, --help Get (this) usage information -x, --xmlout Generate XML output <ADL file name> pathname to ADL file that is produced by the SPL compiler Show the operators contained in each PE binary file.
de: Syntax: {0} -h, --help | [-x, --xmlout] <ADL-Dateiname> -h, --help (Diese) Syntaxinformationen abrufen -x, --xmlout XML-Ausgabe generieren <ADL-Dateiname> Pfadname für ADL-Datei, die vom SPL-Compiler erzeugt wird Zeigt die Operatoren an, die in jeder PE-Binärdatei enthalten sind.
es: uso: {0} -h, --help | [-x, --xmlout] <ADL file name> -h, --help Obtener (esta) información de uso -x, --xmlout Generar salida XML <ADL file name> Nombre de vía de acceso de archivo ADL generado por el compilador SPL Mostrar los operadores incluidos en cada archivo binario PE.
ko: 사용법: {0} -h, --help | [-x, --xmlout] <ADL file name> -h, --help 사용법 정보를 가져옵니다. -x, --xmlout XML 출력을 생성합니다. <ADL file name> SPL 컴파일러에서 생성하는 ADL 파일의 경로 이름입니다. 각 PE 바이너리 파일에 포함된 연산자를 표시합니다.
pt_br: uso: {0} -h, --help | [-x, --xmlout] <ADL file name> -h, --help obtém (estas) informações de uso -x, --xmlout gera a saída XML <ADL file name> nome do caminho para o aquivo ADL que é produzido pelo compilador SPL Mostra os operadores contidos em cada arquivo binário de PE.
zh_tw: 用法：{0} -h, --help | [-x, --xmlout] <ADL file name> -h, --help 取得（此）用法資訊 -x, --xmlout 產生 XML 輸出 <ADL file name> SPL 編譯器所產生之 ADL 檔的路徑名稱 顯示包含在每一個 PE 二進位檔中的運算子。

# CDISP9222E
source: The {0}: {1} ADL file cannot be read.
de: Die ADL-Datei {0}: {1} kann nicht gelesen werden.
es: El archivo ADL {0}: {1} no se puede leer.
ko: {0}: {1} ADL 파일을 읽을 수 없습니다.
pt_br: O arquivo ADL {0}: {1} não pode ser lido.
zh_tw: 無法讀取 {0}：{1} ADL 檔。

# CDISP9223E
source: The copy and patch of the {0} resource file failed.
de: Das Kopieren und Korrigieren der Ressourcendatei {0} ist fehlgeschlagen.
es: La copia y el parche del archivo de recursos {0} han fallado.
ko: {0} 자원 파일의 복사 및 패치가 실패했습니다.
pt_br: A cópia e a correção do arquivo de recursos {0} falharam.
zh_tw: 複製和修補 {0} 資源檔失敗。
