Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLRuntimeMessages_*.xlf
Languages: de, fr

# CDISR5000E
source: The following message cannot be loaded: {0}. The default message will be loaded.
de: Die folgende Nachricht kann nicht geladen werden: {0}. Die Standardnachricht wird geladen.
fr: Impossible de charger le message suivant : {0}. Le message par défaut sera chargé.

# CDISR5001E
source: The string literal is not valid because the following leading byte of the multibyte UTF-8 character is not correct: 0x{0}.
de: Das Zeichenfolgeliteral ist nicht gültig, weil das folgende führende Byte des Mehrbyte-UTF-8-Zeichens nicht korrekt ist: 0x{0}.
fr: Le littéral chaîne n''est pas valide car le premier octet suivant dans le caractère UTF-8 multioctet est incorrect : 0x{0}.

# CDISR5002E
source: The string literal is not valid because the following trailing byte of the multibyte UTF-8 character is not correct: 0x{0}.
de: Das Zeichenfolgeliteral ist nicht gültig, weil das folgende abschließende Byte des Mehrbyte-UTF-8-Zeichens nicht korrektist: 0x{0}.
fr: Le littéral chaîne n''est pas valide car le dernier octet suivant dans le caractère UTF-8 multioctet est incorrect : 0x{0}.

# CDISR5003E
source: The string literal is not valid because the following number of bytes in the multibyte UTF-8 character is incorrect: {0,number,0}.
de: Das Zeichenfolgeliteral ist nicht gültig, weil die folgende Anzahl Byte im Mehrbyte-UTF-8-Zeichens nicht korrekt ist: {0,number,0}.
fr: Le littéral chaîne n''est pas valide car le nombre d''octets suivant dans le caractère UTF-8 multioctet est incorrect : {0,number,0}.

# CDISR5004E
source: The string literal is not valid because the trailing surrogate is missing from the \\u sequence.
de: Das Zeichenfolgeliteral ist nicht gültig, weil der abschließende Ersatz in der Sequenz \\u fehlt.
fr: Le littéral chaîne n''est pas valide car la substitution de fin est manquante dans la séquence \\u.

# CDISR5005E
source: The string literal is not valid because the \\u sequence in the string literal ends with a partial unicode character.
de: Das Zeichenfolgeliteral ist nicht gültig, weil die Sequenz \\u im Zeichenfolgeliteral mit einem partiellen Unicode-Zeichen endet.
fr: Le littéral chaîne n''est pas valide car la séquence \\u qu''il contient se termine par un caractère Unicode partiel.

# CDISR5006E
source: The string literal is not valid because the unicode character of the \\u sequence contains an incorrect character.
de: Das Zeichenfolgeliteral ist nicht gültig, weil das Unicode-Zeichen der Sequenz \\u ein falsches Zeichen enthält.
fr: Le littéral chaîne n''est pas valide car le caractère Unicode de la séquence \\u contient un caractère incorrect.

# CDISR5007E
source: The string literal is not valid because the trailing surrogate in the \\u sequence is not correct.
de: Das Zeichenfolgeliteral ist nicht gültig, weil der abschließende Ersatz in der Sequenz \\u falsch ist.
fr: Le littéral chaîne n''est pas valide car la substitution de fin dans la séquence \\u est incorrecte.

# CDISR5008E
source: The string literal is not valid because the code unit in the \\u sequence does not contain a valid character in the Basic Multilingual Plane.
de: Das Zeichenfolgeliteral ist nicht gültig, weil die Codeeinheit in der Sequenz \\u kein gültiges Zeichen in der mehrsprachigen Basisebene enthält.
fr: Le littéral chaîne n''est pas valide car l''unité de code dans la séquence \\u ne contient pas un caractère valide du plan multilingue de base.

# CDISR5009E
source: The string literal is not valid because it is not enclosed in single quotation marks ('') or double quotation marks (").
de: Das Zeichenfolgeliteral ist nicht gültig, weil es nicht in Hochkommas ('') oder Anführungszeichen (") eingeschlossen ist.
fr: Le littéral chaîne n''est pas valide car il n''est pas placé entre apostrophes ('') ni entre guillemets (").

# CDISR5010E
source: The string literal is not valid because it ends with the following escape character: \\.
de: Das Zeichenfolgeliteral ist nicht gültig, weil es mit dem folgenden Escapezeichen endet: \\.
fr: Le littéral chaîne n''est pas valide car il se termine par le caractère d''échappement suivant : \\.

# CDISR5011E
source: The lower bound of the slice of a string is {0,number,0}. This lower bound is larger than the size of the string, which is {1,number,0}.
de: Die Untergrenze des Slice einer Zeichenfolge ist {0,number,0}. Diese Untergrenze überschreitet die Größe der Zeichenfolge, die {1,number,0} ist.
fr: La limite inférieure de la tranche d''une chaîne est {0,number,0}. Cette limite inférieure est supérieure à la taille de la chaîne, qui est égale à {1,number,0}.

# CDISR5012E
source: A window received an unexpected punctuation.
de: Ein Fenster empfing eine unerwartete Punktuation.
fr: Une fenêtre a reçu un ponctuation inattendue.

# CDISR5013E
source: The window configuration is not valid. A sliding window cannot have a punctuation-based eviction policy.
de: Die Fensterkonfiguration ist ungültig. Ein Sliding Window kann keine punktuationsbasierte Bereinigungsrichtlinie haben.
fr: La configuration de fenêtre n''est pas valide. Une fenêtre dynamique ne peut pas avoir une règle d''expulsion basée sur la ponctuation.

# CDISR5014E
source: The window configuration is not valid. A sliding window cannot have a punctuation-based trigger policy.
de: Die Fensterkonfiguration ist ungültig. Ein Sliding Window kann keine punktuationsbasierte Triggerrichtlinie haben.
fr: La configuration de fenêtre n''est pas valide. Une fenêtre dynamique ne peut pas avoir une règle de déclenchement basée sur la ponctuation.

# CDISR5015E
source: The output port index {0,number,0} is outside the valid range of [0..{1,number,0}).
de: Der Ausgabeportindex {0,number,0} liegt außerhalb des gültigen Bereichs von [0..{1,number,0}).
fr: L''index de port de sortie {0,number,0} se situe en dehors de la plage valide : [0..{1,number,0}).

# CDISR5016E
source: The {0} tuple type does not match the {1} port type at the following port index: {2,number,0}.
de: Der Tupeltyp {0} stimmt nicht mit dem Porttyp {1} im folgenden Portindex überein: {2,number,0}.
fr: Le type de bloc de données {0} ne correspond pas au type de port {1} sur l''index de port suivant : {2,number,0}.

# CDISR5017E
source: A constant tuple cannot be sent to a mutating port at the following index: {0,number,0}.
de: Ein konstantes Tupel kann nicht an einen Mutating-Port im folgenden Index gesendet werden: {0,number,0}.
fr: Un bloc de données de constante ne peut pas être envoyé à un port pouvant être modifié sur l''index suivant : {0,number,0}.

# CDISR5018E
source: A StreamProperty of the {0} type is passed a value of the {1} type.
de: An StreamProperty des Typs {0} wird ein Wert des Typs {1} übergeben.
fr: Une propriété StreamProperty du type {0} reçoit une valeur du type {1}.

# CDISR5019E
source: The standalone program cannot open the following ADL file: {0}. The error is: {1}.
de: Das eigenständige Programm kann die folgende ADL-Datei nicht öffnen: {0}. Fehler: {1}.
fr: Le programme autonome ne peut pas ouvrir le fichier ADL suivant : {0}. Erreur : {1}.

# CDISR5020E
source: The {0} ADL file cannot be loaded. The error is: {1}.
de: Die ADL-Datei {0} kann nicht geladen werden. Fehler: {1}.
fr: Impossible de charger le fichier ADL {0}. Erreur : {1}.

# CDISR5021E
source: The following value for the submission time parameter is missing: {0}.
de: Der folgende Wert für den Übergabezeitparameter fehlt: {0}.
fr: La valeur suivante est manquante pour le paramètre d''heure de soumission : {0}.

# CDISR5022I
source: Additional command line arguments can be specified by using <name>=<string-literal>.
de: Weitere Befehlszeilenargumente können über <Name>=<Zeichenfolgeliteral> angegeben werden.
fr: Des arguments de ligne de commande supplémentaires peuvent être spécifiés à l''aide de <nom>=<littéral-chaîne>.

# CDISR5023E
source: The {0} output file did not open. The error is: {1}.
de: Die Ausgabedatei {0} ist nicht geöffnet. Fehler: {1}.
fr: Le fichier de sortie {0} ne s''est pas ouvert. Erreur : {1}.

# CDISR5024E
source: An error occurred while the XMLParse operator parsed the XML input that is used to generate the following output stream: {0,number,0}. The generation of the tuple was suppressed.
de: Ein Fehler ist aufgetreten, während der Operator ''XMLParse'' die XML-Eingabe geparst hat, mit der der folgende Ausgabedatenstrom generiert wird: {0,number,0}. Die Generierung des Tupels wurde unterdrückt.
fr: Une erreur s''est produite lors de l''analyse syntaxique effectuée par l''opérateur XMLParse sur les données d''entrée XML utilisées pour générer le flux de sortie suivant : {0,number,0}. La génération du bloc de données a été supprimée.

# CDISR5025E
source: The following error occurred during XML parsing: {0}.
de: Der folgende Fehler ist während des XML-Parsings aufgetreten: {0}.
fr: L''erreur suivante s''est produite lors de l''analyse syntaxique XML : {0}.

# CDISR5026E
source: The {0} input file did not open. The error is: {1}.
de: Die Eingabedatei {0} konnte nicht geöffnet werden. Fehler: {1}.
fr: Le fichier d''entrée {0} ne s''est pas ouvert. Erreur : {1}.

# CDISR5027E
source: The delay time for the following tuple number cannot be read: {0,number,0}.
de: Die Verzögerungszeit für die folgende Tupelnummer konnte nicht gelesen werden: {0,number,0}.
fr: Impossible de lire le délai pour le numéro de bloc de données suivant : {0,number,0}.

# CDISR5028E
source: The read of the {0} type failed for the following tuple number: {1,number,0}.
de: Das Lesen des Typs {0} ist für die folgende Tupelnummer fehlgeschlagen: {1,number,0}.
fr: Echec de la lecture du type {0} pour le numéro de bloc de données suivant : {1,number,0}.

# CDISR5029E
source: During the read of tuple number {2,number,0}, {3}, the {0} character was expected, but the {1} character was found.
de: Während des Lesens der Tupelnummer {2,number,0}, {3} wurde das Zeichen {0} erwartet, jedoch das Zeichen {1} gefunden.
fr: Lors de la lecture du numéro de bloc de données {2,number,0}, {3}, le caractère {0} était attendu, or, c''est le caractère {1} qui a été trouvé.

# CDISR5030E
source: An exception occurred during the execution of the {0} operator. The exception is: {1}
de: Während der Ausführung des Operators {0} ist eine Ausnahmebedingung aufgetreten. Ausnahmebedingung: {1}
fr: Une exception s''est produite lors de l''exécution de l''opérateur {0}. Exception : {1}.

# CDISR5031E
source: A TCP server or UDP source operator cannot bind to the following port: {0}. The error is: {1}.
de: Ein TCP-Server- oder UDP-Operator ''Source'' kann nicht an den folgenden Port gebunden werden: {0}. Fehler: {1}.
fr: Un serveur TCP ou un opérateur source UDP ne peut pas être lié au port suivant : {0}. Erreur : {1}.

# CDISR5032E
source: A TCP server or a UDP source operator cannot register the following name: {0}. The error is: {1}.
de: Ein TCP-Server- oder UDP-Operator ''Source'' kann den folgenden Namen nicht registrieren: {0}. Fehler: {1}.
fr: Un serveur TCP ou un opérateur source UDP ne peut pas enregistrer le nom suivant : {0}. Erreur : {1}.

# CDISR5033E
source: An exception occurred during the execution of the {1} operator. Processing element number {0,number,0} is terminating.
de: Während der Ausführung des Operators {1} ist eine Ausnahmebedingung aufgetreten. Verarbeitungselement mit der Nummer {0,number,0} wird beendet.
fr: Une exception s''est produite lors de l''exécution de l''opérateur {1}. L''élément de traitement {0,numéro,0} est en cours d''arrêt.

# CDISR5034E
source: A blob that references external memory must not be modified.
de: Ein großes Binärobjekt, das externen Speicher referenziert, darf nicht modifiziert werden.
fr: Un objet BLOB qui fait référence à une mémoire externe ne doit pas être modifié.

# CDISR5035E
source: A TCP client or a UDP sink operator cannot resolve the following name: {0}.
de: Ein TCP-Client- oder UDP-Operator ''Sink'' kann den folgenden Namen nicht auflösen: {0}.
fr: Un client TCP ou un opérateur récepteur UDP ne peut pas résoudre le nom suivant : {0}.

# CDISR5036E
source: An internal error occurred for payload name {0}.
de: Ein interner Fehler ist für Nutzdatenname {0} aufgetreten.
fr: Une erreur interne s''est produite pour le nom de charge {0}.

# CDISR5037E
source: The value {0} specified for the -k or the kill-after option is not valid. The expected value is a positive floating point number.
de: Der für die Option -k oder kill-after angegebene Wert {0} ist nicht gültig. Der erwartete Wert ist eine positive Gleitkommazahl.
fr: La valeur {0} spécifiée pour l''option -k ou kill-after n''est pas valide. La valeur attendue est un nombre en virgule flottante positif.

# CDISR5038E
source: An internal error occurred at input port number {0,number,0} for operator {1}.
de: Ein interner Fehler ist bei Eingabeportnummer {0,number,0} für Operator {1} aufgetreten.
fr: Une erreur interne s''est produite au niveau du port d''entrée {0,number,0} pour l''opérateur {1}.

# CDISR5039E
source: An internal error occurred at output port number {0,number,0} for operator {1}.
de: Ein interner Fehler ist bei Ausgabeportnummer {0,number,0} für Operator {1} aufgetreten.
fr: Une erreur interne s''est produite au niveau du port de sortie {0,number,0} pour l''opérateur {1}.

# CDISR5040E
source: An internal error occurred at operator {0}.
de: Ein interner Fehler ist bei Operator {0} aufgetreten.
fr: Une erreur interne s''est produite au niveau de l''opérateur {0}.

# CDISR5041T
source: Specify the location of the data directory.
de: Die Position des Datenverzeichnisses angeben.
fr: Indiquer l''emplacement du répertoire de données.

# CDISR5042T
source: Output trace messages to standard error. The default is standard output.
de: Tracenachrichten in Standardfehler ausgeben. Der Standardwert ist die Standardausgabe.
fr: Sortie des messages trace en erreur standard. La valeur par défaut est Sortie standard.

# CDISR5043T
source: Shut down the application after N seconds where N is a positive floating point number.
de: Die Anwendung nach N Sekunden beenden, wobei N eine positive Gleitkommazahl ist.
fr: Arrêter l''application au bout de N secondes, N étant un nombre en virgule flottante positif.

# CDISR5044E
source: The submission time parameter name {0} is ambiguous within the list of required parameters: {1}.
de: Der Übergabezeitparametername {0} ist in der Liste erforderlicher Parameter mehrdeutig: {1}.
fr: Le nom du paramètre d''heure de soumission {0} est ambigu dans la liste de paramètres requis : {1}.

# CDISR5045W
source: Warning: The following submission time name is not referenced: {0}.
de: Warnung: Der folgende Übergabezeitname wird nicht referenziert: {0}.
fr: Avertissement : le nom d''heure de soumission suivant n''est pas référencé : {0}.

# CDISR5046E
source: The {0} character set encoding is not known..
de: Die Zeichensatzcodierung {0} ist nicht bekannt.
fr: Le codage de jeu de caractères {0} n''est pas connu.

# CDISR5047E
source: The call to the submit routine from the constructor of the operator for the following port index is not valid: {0,number,0}.
de: Der Aufruf der Übergaberoutine vom Konstruktor des Operators für den folgenden Portindex ist nicht gültig: {0,number,0}.
fr: L''appel de la routine de soumission à partir du constructeur de l''opérateur pour l''index de port suivant n''est pas valide : {0,numéro,0}.

# CDISR5048E
source: The standalone application cannot load the ADL file.
de: Die eigenständige Anwendung kann die ADL-Datei nicht laden.
fr: L''application autonome ne peut pas charger le fichier ADL.

# CDISR5049W
source: A count-based trigger size of {0,number,0} is specified, but it is not valid. The only valid size is 1.
de: Eine anzahlbasierte Triggergröße von {0,number,0} ist angegeben, jedoch nicht gültig. Die einzige gültige Größe ist 1.
fr: La taille de déclencheur basée sur un comptage {0,number,0} est spécifiée, mais elle n''est pas valide. La seule valeur valide est 1.

# CDISR5050E
source: The operator cannot find the {0} key in the {1} mapping file, and a default key is not specified.
de: Der Operator kann den Schlüssel {0} in der Zuordnungsdatei {1} nicht finden und ein Standardschlüssel ist nicht angegeben.
fr: L''opérateur ne peut pas trouver la clé {0} dans le fichier de mappage {1}, et une clé par défaut n''est pas spécifiée.

# CDISR5051E
source: The {0} operator cannot parse the indices in the following map line: {1}.
de: Der Operator {0} kann die Indizes in der folgenden Mapzeile nicht parsen: {1}.
fr: L''opérateur {0} ne peut pas faire une analyse syntaxique des index dans la ligne de mappe suivante : {1}.

# CDISR5052E
source: The {0} operator cannot extract the key in the following line of the map: {1}.
de: Der Operator {0} kann den Schlüssel in der folgenden Mapzeile nicht extrahieren: {1}.
fr: L''opérateur {0} ne peut pas extraire la clé dans la ligne suivante de la mappe : {1}.

# CDISR5053E
source: Runtime failures occurred in the following operators: {0}.
de: Ausführungszeitfehler in den folgenden Operatoren: {0}.
fr: Des échecs d''exécution se sont produits dans les opérateurs suivants : {0}.

# CDISR5054E
source: The {0} operator has duplicate keys in the following line of the map: {1}.
de: Der Operator {0} hat in der folgenden Mapzeile doppelte Schlüssel: {1}.
fr: L''opérateur {0} comporte des clés en double sur la ligne suivante de la mappe : {1}.

# CDISR5055E
source: The {0} shared library cannot be loaded. The error is: {1}.
de: Die gemeinsam genutzte Bibliothek {0} kann nicht geladen werden. Fehler: {1}.
fr: Impossible de charger la bibliothèque partagée {0}. Erreur : {1}.

# CDISR5056E
source: The {0} entry point cannot be located. The error is: {1}.
de: Der Eingangspunkt {0} kann nicht lokalisiert werden. Fehler: {1}.
fr: Impossible de localiser le point d''entrée {0}. Erreur : {1}.

# CDISR5057E
source: The conversion from the {0} string to a C++ type of {1} did not succeed.
de: Die Konvertierung der Zeichenfolge {0} in den C++-Typ {1} war nicht erfolgreich.
fr: La conversion de la chaîne {0} en un type C++ {1} n''a pas abouti.

# CDISR5058E
source: The {0} hostname or the {1} port cannot be resolved. The error is: {2}.
de: Der Hostname {0} oder der Port {1} kann nicht aufgelöst werden. Fehler: {2}.
fr: Impossible de résoudre le nom d''hôte {0} ou le port {1}. Erreur : {2}.

# CDISR5059E
source: The {0} interface cannot be resolved.
de: Die Schnittstelle {0} kann nicht aufgelöst werden.
fr: Impossible de résoudre l''interface {0}.

# CDISR5061E
source: An internal error occurred.
de: Ein interner Fehler ist aufgetreten.
fr: Une erreur interne s''est produite.

# CDISR5062E
source: In the selectFromList routine, the selector size of {0,number,0} does not match the input size of {1,number,0}.
de: In der selectFromList-Routine stimmt die Selektorgröße von {0,number,0} nicht mit der Eingabegröße von {1,number,0} überein.
fr: Dans la routine selectFromList, la taille de sélecteur {0,number,0} ne correspond pas à la taille d''entrée {1,number,0}.

# CDISR5063E
source: The {0} argument to the slice routine is negative.
de: Das Argument {0} der Sliceroutine ist negativ.
fr: L''argument {0} indiqué pour la routine slice est négatif.

# CDISR5064E
source: The kthelem index value of {0,number,0} is outside the bounds of the indexed list. The bounds are [0..{1,number,0}).
de: Der kthelem-Indexwert von {0,number,0} befindet sich außerhalb der Grenzen der indexierten Liste. Grenzen: [0..{1,number,0}).
fr: La valeur d''index kthelem {0,number,0} est en dehors des limites de la liste indexée. Les limites sont [0..{1,number,0}).

# CDISR5065E
source: The conversion from the {0} type to an rstring did not succeed.
de: Die Konvertierung vom Typ {0} in rstring war nicht erfolgreich.
fr: La conversion du type {0} en type rstring n''a pas abouti.

# CDISR5066E
source: The conversion from the {0} string to the {1} type did not succeed.
de: Die Konvertierung der Zeichenfolge {0} in den Typ {1} war nicht erfolgreich.
fr: La conversion de la chaîne {0} en type {1} n''a pas abouti.

# CDISR5067E
source: The local host name cannot be determined. The error is: {0}.
de: Der Name des lokalen Hosts kann nicht bestimmt werden. Fehler: {0}.
fr: Impossible de déterminer le nom d''hôte local. Erreur : {0}.

# CDISR5068E
source: Literal: getKind() != {0}.
fr: Littéral : getKind() != {0}.

# CDISR5069E
source: The subscript is not valid because it uses the In operator.
de: Der Index ist nicht gültig, weil er den Operator In verwendet.
fr: L''indice n''est pas valide car il utilise l''opérateur In.

# CDISR5070E
source: The {0} clause is a predicate rather than an "And" or an "Or" clause.
de: Die Klausel {0} ist ein Prädikat anstelle einer Klausel "And" oder "Or".
fr: La clause {0} est un prédicat et non pas une clause "And" ou "Or".

# CDISR5071E
source: The {0} clause is an "And" or an "Or" clause.
de: Die Klausel {0} ist eine Klausel "And" oder "Or".
fr: La clause {0} est une clause "And" ou "Or".

# CDISR5072E
source: The removal of the last subclause in the {0} clause is not valid.
de: Die Entfernung der letzten Unterklausel in der Klausel {0} ist nicht gültig.
fr: Le retrait de la dernière sous-clause dans la clause {0} n''est pas valide.

# CDISR5073E
source: It is not valid to remove the following index: {0,number,0}.
de: Es ist nicht gültig, den folgenden Index zu entfernen: {0,number,0}.
fr: Le retrait de l''index suivant n''est pas admis : {0,number,0}.

# CDISR5074E
source: The {0} clause does not have a subscript.
de: Die Klausel {0} hat keinen Index.
fr: La clause {0} ne comporte pas d''indice.

# CDISR5075E
source: The following getSubclause index is not valid: {0,number,0}.
de: Der folgende getSubclause-Index ist nicht gültig: {0,number,0}.
fr: L''index getSubclause suivant n''est pas valide : {0,number,0}.

# CDISR5076T
source: Specify the root directory the standalone application bundle should be executed from.
de: Das Stammverzeichnis angeben, aus dem das Bundle der eigenständigen Anwendung ausgeführt werden soll.
fr: Indiquez le répertoire racine à partir duquel le bundle d''applications autonomes doit être exécuté.

# CDISR5077E
source: An internal error occurred that was caused by an exception. The error is: {0}.
de: Ein interner Fehler ist aufgetreten, der durch eine Ausnahmebedingung verursacht wurde. Fehler: {0}.
fr: Une erreur interne provoquée par une exception s''est produite. Erreur : {0}.

# CDISR5078E
source: An unknown exception occurred during the resource cleanup. The exception was ignored.
de: Während der Ressourcenbereinigung ist eine unbekannte Ausnahmebedingung aufgetreten. Die Ausnahmebedingung wurde ignoriert.
fr: Une exception inconnue s''est produite lors du nettoyage de la ressource. L''exception a été ignorée.

# CDISR5079E
source: An exception occurred during the processing of the processing element. The error is: {0}.
de: Während der Verarbeitung des Verarbeitungselements ist eine unbekannte Ausnahmebedingung aufgetreten. Fehler: {0}.
fr: Une exception s''est produite lors du traitement de l''élément de traitement. Erreur : {0}.

# CDISR5080E
source: An exception occurred during the restoration of the checkpoint. The error is: {0}.
de: Während der Wiederherstellung des Prüfpunkts ist eine Ausnahmebedingung aufgetreten. Fehler: {0}.
fr: Une exception s''est produite lors de la restauration du point de contrôle. Erreur : {0}.

# CDISR5081E
source: An exception occurred during a write to the transport client. The error is: {0}.
de: Beim Schreiben in den Transportclient ist eine Ausnahmebedingung aufgetreten. Fehler: {0}.
fr: Une exception s''est produite lors d''une opération d''écriture sur le client de transport. Erreur : {0}.
