Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0342I
source: Generate nicely formatted code. This option might slow the code generation process.
de: Gut formatierten Code generieren. Diese Option verlangsamt möglicherweise den Codegenerierungsprozess.
es: Genere código formateado correctamente. Esta opción podría ralentizar el proceso de generación de código.
ko: 가독성이 높게 형식화된 코드를 생성합니다. 이 옵션을 사용하면 코드 생성 프로세스가 느려질 수 있습니다.
pt_br: Gerar código bem formatado. Esta opção pode desacelerar o processo de geração de códigos.
zh_tw: 產生正確格式化的程式碼。這個選項可能會降低產生程式碼程序的速度。

# CDISP0344I
source: Print the abstract syntax tree (AST).
de: Abstrakten Syntaxbaum (AST - Abstract Syntax Tree) drucken.
es: Imprima el árbol de sintaxis abstracto (AST).
pt_br: Imprimir a árvore de sintaxe abstrata (AST).
zh_tw: 列印抽象語法樹狀結構 (AST)。

# CDISP0345I
source: Print the compilation unit signature, which includes the namespace, operator names, and function signatures.
de: Kompiliereinheitssignatur einschließlich Namensbereich, Operatornamen und Funktionssignaturen drucken.
es: Imprima la firma de la unidad de compilación, que incluye el espacio de nombres, nombres de operador y firmas de función.
pt_br: Imprimir a assinatura unidade de compilação, que inclui o namespace, o nome do operador e assinaturas de função.
zh_tw: 列印編譯單元簽章，其中包括名稱空間、運算子名稱及函數簽章。

# CDISP0346I
source: Print the source code based on the abstract syntax tree (AST).
de: Quellcode auf der Basis des abstrakten Syntaxbaums drucken.
es: Imprima el código fuente basado en el árbol de sintaxis abstracto (AST).
pt_br: Imprimir o código fonte com base na árvore de sintaxe abstrata (AST).
zh_tw: 根據抽象語法樹狀結構 (AST) 來列印原始碼。

# CDISP0347I
source: Print the token stream.
de: Tokendatenstrom drucken.
es: Imprima la secuencia de señal.
pt_br: Imprimir o fluxo de token.
zh_tw: 列印記號串流。

# CDISP0348I
source: Perform only the syntax checking without the type checking or other semantic analysis.
de: Nur Syntaxprüfung ohne Typüberprüfung oder andere semantische Analyse durchführen.
es: Realice solo la comprobación de sintaxis sin la comprobación de tipo u otros análisis semánticos.
pt_br: Executar somente a verificação de sintaxe sem a verificação de tipo ou outra análise semântica.
zh_tw: 僅執行語法檢查，而不執行類型檢查或其他語意分析。

# CDISP0349E
source: A user error was encountered during the verification of the {0} operator.
de: Während der Verifizierung des Operators {0} ist ein Benutzerfehler aufgetreten.
es: Se ha encontrado un error de usuario durante la verificación del operador {0}.
ko: {0} 연산자의 확인 중에 사용자 오류가 발생했습니다.
pt_br: Um erro do usuário foi encontrado durante a verificação do operador {0}.
zh_tw: 驗證 {0} 運算子期間，發生使用者錯誤。

# CDISP0350I
source: Translate from SPADE to SPL.
de: Von SPADE in SPL übersetzen.
es: Convierta de SPADE a SPL.
ko: SPADE에서 SPL로 변환합니다.
pt_br: Converter de SPADE em SPL.
zh_tw: 從 SPADE 轉換至 SPL。

# CDISP0351I
source: Dump the debugging information.
de: Speicherauszug der Debugging-Information erstellen.
es: Vuelque la información de depuración.
pt_br: Efetuar dump das informações de depuração.
zh_tw: 傾出除錯資訊。

# CDISP0352I
source: Ignore the toolkit timestamp problems.
de: Probleme mit Toolkitzeitmarke ignorieren.
es: Ignore los problemas de indicación de fecha y hora del kit de herramientas.
pt_br: Ignorar os problemas de registro de data e hora do kit de ferramentas.
zh_tw: 忽略工具箱時間戳記問題。

# CDISP0353I
source: Tolerate the missing toolkits.
de: Fehlende Toolkits tolerieren.
es: Tolere los kits de herramientas que faltan.
pt_br: Tolerar os kits de ferramentas ausentes.
zh_tw: 容許遺漏的工具箱。

# CDISP0354E
source: The compiler predicts that the {0} expression has side effects.
de: Der Compiler sagt vorher, dass der Ausdruck {0} Nebeneffekte hat.
es: El compilador predice que la expresión {0} tiene efectos secundarios.
ko: 컴파일러에서 {0} 표현식에 부가작용이 있다고 예측합니다.
pt_br: O compilador prevê que a expressão {0} possui efeitos colaterais.
zh_tw: 編譯器預測 {0} 表示式具有負面影響。

# CDISP0355E
source: The {0} predicate expression cannot be evaluated.
de: Der Prädikatausdruck {0} kann nicht ausgewertet werden.
es: La expresión de predicado {0} no se puede evaluar.
ko: {0} 술어 표현식을 평가할 수 없습니다.
pt_br: A expressão de predicado {0} não pode ser avaliada.
zh_tw: 無法對 {0} 述詞表示式進行求值。

# CDISP0356E
source: ERROR
de: FEHLER
ko: 오류
pt_br: ERRO
zh_tw: 錯誤

# CDISP0357W
source: WARNING
de: WARNUNG
es: AVISO
ko: 경고
pt_br: AVISO
zh_tw: 警告

# CDISP0358E
source: An internal error occurred. The error is: {0}.
de: Ein interner Fehler ist aufgetreten. Fehler: {0}.
es: Se ha producido un error interno. El error es: {0}.
ko: 내부 오류가 발생했습니다. 오류는 {0}입니다.
pt_br: Ocorreu um erro interno. O erro é: {0}.
zh_tw: 發生內部錯誤。錯誤為：{0}。

# CDISP0360E
source: The expression for the {0} parameter contains a reference to the {1} attribute, but the operator model specifies that the expression is attribute free.
de: Der Ausdruck für den Parameter {0} enthält eine Referenz auf das Attribut {1}, das Operatormodell gibt jedoch an, dass der Ausdruck kein Attribut hat.
es: La expresión para el parámetro {0} contiene una referencia al atributo {1}, pero el modelo de operador especifica que la expresión no tiene atributos.
ko: {0} 매개변수의 표현식에 {1} 속성에 대한 참조가 포함되어 있으나 연산자 모델에서 이 표현식이 속성을 포함하지 않도록 지정하고 있습니다.
pt_br: A expressão para o parâmetro {0} contém uma referência ao atributo {1}, mas o modelo do operador especifica que a expressão é livre de atributo.
zh_tw: {0} 參數的表示式包含對 {1} 屬性的參照，但運算子模型卻指定該表示式不含屬性。

# CDISP0361E
source: An output assignment contains a reference to the {0} attribute, but the operator model specifies that the output assignment is attribute free.
de: Eine Zuweisung für ''output'' enthält eine Referenz auf das Attribut {0}, das Operatormodell gibt jedoch an, dass die Zuweisung für ''output'' kein Attribut hat.
es: Una asignación de salida contiene una referencia al atributo {0}, pero el modelo de operador especifica que la asignación de salida no tiene atributos.
ko: 출력 지정에 {0} 속성에 대한 참조가 포함되어 있으나 연산자 모델에서 이 출력 지정이 속성을 포함하지 않도록 지정하고 있습니다.
pt_br: Uma designação de saída contém uma referência ao atributo {0}, mas o modelo do operador especifica que a designação de saída é livre de atributo.
zh_tw: 輸出指派包含對 {0} 屬性的參照，但運算子模型卻指定該輸出指派不含屬性。

# CDISP0362E
source: An output port that corresponds to the {0} identifier cannot be found.
de: Ein Ausgabeport, der der Kennung {0} entspricht, kann nicht gefunden werden.
es: No se puede encontrar un puerto de salida que corresponde al identificador {0}.
ko: {0} ID에 해당하는 출력 포트를 찾을 수 없습니다.
pt_br: Uma porta de saída que corresponde ao identificador {0} não pode ser localizada.
zh_tw: 找不到對應於 {0} ID 的輸出埠。

# CDISP0363E
source: Multiple ports that correspond to the {0} identifier were found. To remove the ambiguity, consider using port aliases.
de: Es wurden mehrere Ports gefunden, die der Kennung {0} entsprechen. Verwenden Sie Portaliasnamen, um die Mehrdeutigkeit zu entfernen.
es: Se han encontrado varios puertos que corresponden al identificador {0}. Para eliminar la ambigüedad, considere el uso de alias de puerto.
ko: {0} ID에 해당하는 여러 포트를 발견했습니다. 모호성을 제거하려는 경우에는 포트 별명 사용을 고려하십시오.
pt_br: Múltiplas portas que correspondem ao identificador {0} foram localizadas. Para remover a ambiguidade, considere usar os aliases da porta.
zh_tw: 找到對應於 {0} ID 的多個埠。如果要明確語義，請考量使用埠別名。

# CDISP0364E
source: A port name is expected.
de: Es wird ein Portname erwartet.
es: Se espera un nombre de puerto.
ko: 기대된 항목은 포트 이름입니다.
pt_br: Um nome da porta é esperado.
zh_tw: 預期一個埠名稱。

# CDISP0365E
source: The {0} name is expected to be a simple identifier in the window clause.
de: Der Name {0} muss eine einfache Kennung in der Klausel ''window'' sein.
es: Se espera que el nombre {0} sea un identificador simple en la cláusula ventana.
ko: {0} 이름은 window 절의 단순 ID로 기대됩니다.
pt_br: O nome {0} deve ser um identificador simples na cláusula de janela.
zh_tw: 預期 {0} 名稱是 window 子句中的簡式 ID。

# CDISP0366E
source: The {0} name is expected to be an intrinsic call in the window clause.
de: Der Name {0} muss ein interner Aufruf in der Klausel ''window'' sein.
es: El nombre {0} se espera que sea una llamada intrínseca en la cláusula ventana.
ko: {0} 이름은 window 절의 내장 호출로 기대됩니다.
pt_br: O nome {0} deve ser uma chamada intrínseca na cláusula de janela.
zh_tw: 預期 {0} 名稱是 window 子句中的本質呼叫。

# CDISP0367E
source: The expression in the window clause is not valid.
de: Der Ausdruck in der Klausel ''window'' ist nicht gültig.
es: La expresión de la cláusula ventana no es válida.
ko: window 절의 표현식이 유효하지 않습니다.
pt_br: A expressão na cláusula de janela não é válida.
zh_tw: window 子句中的表示式無效。

# CDISP0368E
source: The eviction policy that is expected in the tumbling window was not found. Instead, the following number of eviction policies were found: {0,number,0}.
de: Die Bereinigungsrichtlinie, die im Tumbling Window erwartet wird, wurde nicht gefunden. Stattdessen wurde die folgende Anzahl Bereinigungsrichtlinien gefunden: {0,number,0}.
es: La política de desalojo que se espera en la ventana en movimiento no se ha encontrado. En su lugar, se ha encontrado el número de políticas de desalojo siguiente: {0,número,0}.
ko: 텀블링 창에서 기대된 제거 정책을 찾지 못했습니다. 대신 {0,number,0}개의 제거 정책을 발견했습니다.
pt_br: A política de desocupação que é esperada na janela rolante não foi localizada. Em vez disso, o número a seguir de políticas de desocupação foi localizado: {0,number,0}.
zh_tw: 找不到翻轉視窗中預期的收回原則。而是，找到以下數目的收回原則：{0,number,0}。

# CDISP0369E
source: One or two eviction policies are expected in the window, but the following number of eviction policies are found: {0,number,0}.
de: Eine oder zwei Bereinigungsrichtlinien werden im Fenster erwartet, aber die folgende Anzahl Bereinigungsrichtlinien wurde gefunden: {0,number,0}.
es: Se esperan una o dos políticas de desalojo en la ventana, pero se ha encontrado el número de políticas de desalojo siguiente: {0,número,0}.
ko: 창에서 하나 또는 두 개의 제거 정책이 기대되었으나 {0,number,0}개의 제거 정책을 발견했습니다.
pt_br: Uma ou duas políticas de desocupação são esperadas na janela, mas o número de políticas de desocupação a seguir foi localizado: {0,number,0}.
zh_tw: 視窗中預期一個或兩個收回原則，但卻找到以下數目的收回原則：{0,number,0}。

# CDISP0370E
source: The first argument to delta is expected to be an attribute of the {0} input stream.
de: Das erste Argument für ''delta'' muss ein Attribut des Eingabedatenstroms {0} sein.
es: El primer argumento para delta se espera que sea un atributo de la secuencia de entrada {0}.
ko: delta에 대한 첫 번째 인수는 {0} 입력 스트림의 속성으로 기대됩니다.
pt_br: O primeiro argumento para delta deve ser um atributo do fluxo de entrada {0}.
zh_tw: 差異的第一個引數預期為 {0} 輸入串流的一個屬性。

# CDISP0371E
source: A window for the port of the {0} input stream is redundant. The window was already specified.
de: Ein Fenster für den Port des Eingabedatenstroms {0} ist redundant. Das Fenster wurde bereits angegeben.
es: Una ventana para el puerto de la secuencia de entrada {0} es redundante. La ventana ya se ha especificado.
ko: {0} 입력 스트림의 포트에 대한 창이 중복입니다. 이 창이 이미 지정되었습니다.
pt_br: Uma janela para a porta do fluxo de entrada {0} é redundante. A janela já estava especificada.
zh_tw: {0} 輸入串流之埠的一個視窗是冗餘視窗。已經指定該視窗。

# CDISP0372E
source: An operator name is expected, but {0} is not an operator name in this scope.
de: Ein Operatorname wird erwartet, {0} ist in diesem Bereich jedoch kein Operatorname.
es: Se espera un nombre de operador, pero {0} no es un nombre de operador en este ámbito.
ko: 연산자 이름이 기대되었으나 {0}은(는) 이 범위에 포함된 연산자 이름이 아닙니다.
pt_br: Um nome do operador é esperado, mas {0} não é um nome do operador neste escopo.
zh_tw: 預期一個運算子名稱，但 {0} 不是此範圍內的運算子名稱。

# CDISP0373E
source: An actual parameter to a primitive operator must be an expression that denotes a value.
de: Ein tatsächlicher Parameter für einen primitiven Operator muss ein Ausdruck sein, der einen Wert bezeichnet.
es: Un parámetro real en un operador de primitiva debe ser una expresión que denote un valor.
ko: 기본 연산자에 대한 실제 매개변수는 값을 나타내는 표현식이어야 합니다.
pt_br: Um parâmetro real para um operador primitivo deve ser uma expressão que denota um valor.
zh_tw: 初始運算子的實際參數必須是一個用來表示值的表示式。

# CDISP0378E
source: The operand that is modified by the {0} SPL expression operator must be mutable.
de: Der Operand, der vom SPL-Ausdrucksoperator {0} geändert wird, muss veränderbar sein.
es: El operando modificado por el operador de expresión SPL {0} debe ser mutable.
ko: {0} SPL 표현식에 의해 수정되는 피연산자는 변경 가능해야 합니다.
pt_br: O operando que é modificado pelo operador de expressão do SPL {0} deve ser mutável.
zh_tw: {0} SPL 表示式運算子所修改的運算元必須是可變的。

# CDISP0379E
source: The actual parameter that is passed to the {0} mutable formal parameter must be mutable.
de: Der tatsächliche Parameter, der an den veränderbaren formalen Parameter {0} übergeben wird, muss veränderbar sein.
es: El parámetro real que se pasa al parámetro formal mutable {0} debe ser mutable.
ko: {0} 가변 정규 매개변수에 전달되는 실제 매개변수는 변경 가능해야 합니다.
pt_br: O parâmetro real que é transmitido para o parâmetro formal mutável de {0} deve ser mutável.
zh_tw: 傳遞至 {0} 可變格式參數的實際參數必須是可變的。

# CDISP0380E
source: The {0} output assignment expression accesses a port, but the model for the {1} operator does not allow access to that port.
de: Der Ausgabezuweisungsausdruck {0} greift auf einen Port zu, das Modell für den Operator {1} lässt jedoch keinen Zugriff auf diesen Port zu.
es: La expresión de asignación de salida {0} accede a un puerto, pero el modelo para el operador {1} no permite el acceso a dicho puerto.
ko: {0} 출력 지정 표현식에서 포트에 액세스하지만 {1} 연산자의 모델에서 해당 포트에 대한 액세스를 허용하지 않습니다.
pt_br: A expressão de designação de saída {0} acessa uma porta, mas o modelo para o operador {1} não permite acesso a essa porta.
zh_tw: {0} 輸出指派表示式存取了某個埠，但 {1} 運算子的模型不容許存取該埠。

# CDISP0381I
source: At least one possible assignment for the {0} output attribute was found, but it was blocked by a mismatch in the port scope.
de: Mindestens eine mögliche Zuweisung für das Ausgabeattribut {0} wurde gefunden, sie wurde jedoch durch eine Abweichung im Portbereich blockiert.
es: Al menos, se ha encontrado una posible asignación para el atributo de salida {0}, pero fue bloqueada por una discrepancia en el ámbito de puerto.
ko: {0} 출력 속성에 대해 가능한 지정을 하나 이상 발견했지만, 이 지정이 포트 범위에서의 불일치로 인해 차단되었습니다.
pt_br: Pelo menos uma designação possível para o atributo de saída {0} foi localizada, mas foi bloqueada devido a uma incompatibilidade no escopo da porta.
zh_tw: 找到了 {0} 輸出屬性的至少一個可能的指派，但卻因埠範圍內的不符而將其封鎖。

# CDISP0382E
source: The SPL compiler failed to load the {0} function model file using the {1} function model schema. The error is: {2}.
de: Der SPL-Compiler konnte die Funktionsmodelldatei {0} mit dem Funktionsmodellschema {1} nicht laden. Fehler: {2}.
es: El compilador SPL no ha podido cargar el archivo del modelo de función {0} utilizando el esquema de modelo de función {1}. El error es: {2}.
ko: SPL 컴파일러에서 {1} 함수 모델 스키마를 사용하여 {0} 함수 모델을 로드하는 데 실패했습니다. 오류는 {2}입니다.
pt_br: O compilador de SPL falhou ao carregar o arquivo de modelo de função {0} usando o esquema de modelo de função {1}. O erro é: {2}.
zh_tw: SPL 編譯器無法使用 {1} 函數模型綱目來載入 {0} 函數模型檔。錯誤為：{2}。

# CDISP0383E
source: The {0} toolkit requires Streams version {1}, but version {2} of the product is currently installed.
de: Das Toolkit {0} erfordert Streams Version {1}, zurzeit ist jedoch Version {2} des Produkts installiert.
es: El kit de herramientas {0} requiere la versión de Streams {1}, pero actualmente está instalada la versión {2} del producto.
ko: {0} 툴킷은 Streams 버전 {1}을(를) 필요로 하지만 이 제품의 {2} 버전이 현재 설치되어 있습니다.
pt_br: O kit de ferramentas {0} requer o Streams versão {1}, mas a versão {2} do produto está atualmente instalada.
zh_tw: {0} 工具箱需要 Streams {1} 版，但目前安裝了 {2} 版的產品。

# CDISP0384E
source: The {0} toolkit requires version {2} of the {1} toolkit, but version {3} of the required toolkit is currently installed.
de: Das Toolkit {0} erfordert Version {2} des Toolkits {1}, zurzeit ist jedoch Version {3} des erforderlichen Toolkits installiert.
es: El kit de herramientas {0} requiere la versión {2} del kit de herramientas {1}, pero actualmente está instalada la versión {3} del kit de herramientas necesario.
ko: {0} 툴킷은 {1} 툴킷의 {2} 버전을 필요로 하지만 이 필수 툴킷의 {3} 버전이 현재 설치되어 있습니다.
pt_br: O kit de ferramentas {0} requer a versão {2} do kit de ferramentas {1}, mas a versão {3} do kit de ferramentas necessário está atualmente instalada.
zh_tw: {0} 工具箱需要 {2} 版的 {1} 工具箱，但目前安裝了 {3} 版的所需工具箱。

# CDISP0385E
source: The {0} toolkit requires version {2} of the {1} toolkit, but version {2} of the {1} toolkit is not available.
de: Das Toolkit {0} erfordert Version {2} des Toolkits {1}, Version {2} des Toolkits {1} ist jedoch nicht verfügbar.
es: El kit de herramientas {0} requiere la versión {2} del kit de herramientas {1}, pero la versión {2} del kit de herramientas {1} no está disponible.
ko: {0} 툴킷은 {1} 툴킷의 {2} 버전을 필요로 하지만 {1} 툴킷의 {2} 버전이 사용 불가능합니다.
pt_br: O kit de ferramentas {0} requer a versão {2} do kit de ferramentas {1}, mas a versão {2} do kit de ferramentas {1} não está disponível.
zh_tw: {0} 工具箱需要 {2} 版的 {1} 工具箱，但卻無法使用 {2} 版的 {1} 工具箱。

# CDISP0386E
source: Usage: sc [options] -M <main-composite>
de: Syntax: sc [Optionen] -M <Hauptverbundelement>
es: Uso: sc [opciones] -M <main-composite>
ko: 사용법: sc [options] -M <main-composite>
pt_br: Uso: sc [options] -M <main-composite>
zh_tw: 用法：sc [options] -M <main-composite>

# CDISP0388E
source: The {0} symbolic link cannot be created. The error is: {1}.
de: Der symbolische Link {0} kann nicht erstellt werden. Fehler: {1}.
es: El enlace simbólico {0} no se puede crear. El error es: {1}.
ko: {0} 기호 링크를 작성할 수 없습니다. 오류는 {1}입니다.
pt_br: O link simbólico {0} não pode ser criado. O erro é: {1}.
zh_tw: 無法建立 {0} 符號鏈結。錯誤為：{1}。

# CDISP0389E
source: The {0} namespace component is reserved for the SPL compiler. Use a different identifier.
de: Die Namensbereichskomponente {0} ist für den SPL-Compiler reserviert. Verwenden Sie eine andere Kennung.
es: El componente de espacio de nombres {0} está reservado para el compilador SPL. Utilice un identificador diferente.
ko: {0} 네임스페이스 구성요소는 SPL 컴파일러를 위해 예약되어 있습니다. 다른 ID를 사용하십시오.
pt_br: O componente do namespace {0} está reservado para o compilador SPL. Use um identificador diferente.
zh_tw: 已保留 {0} 名稱空間元件供 SPL 編譯器使用。請使用不同的 ID。

# CDISP0390E
source: The {0} operator name conflicts with a C++ keyword.
de: Der Operatorname {0} steht in Konflikt mit einem C++-Schlüsselwort.
es: El nombre de operador {0} entra en conflicto con una palabra clave de C++.
ko: {0} 연산자 이름이 C++ 키워드와 충돌합니다.
pt_br: O nome do operador {0} conflita com uma palavra-chave do C++.
zh_tw: {0} 運算子名稱與某個 C++ 關鍵字相衝突。

# CDISP0391E
source: The {0} attribute name conflicts with a C++ keyword.
de: Der Attributname {0} steht in Konflikt mit einem C++-Schlüsselwort.
es: El nombre de atributo {0} entra en conflicto con una palabra clave de C++.
ko: {0} 속성 이름이 C++ 키워드와 충돌합니다.
pt_br: O nome do atributo {0} conflita com uma palavra-chave do C++.
zh_tw: {0} 屬性名稱與某個 C++ 關鍵字相衝突。

# CDISP0392E
source: The identifier that extends a tuple must itself be a tuple type or a stream that that is used as a tuple type.
de: Die Kennung, die ein Tupel erweitert, muss ein Tupeltyp oder Datenstrom sein, der als Tupeltyp verwendet wird.
es: El identificador que amplía una tupla debe ser el mismo un tipo de tupla o una secuencia que se utiliza como un tipo de tupla.
ko: 튜플을 확장하는 ID는 자신 또한 튜플 유형이거나 튜플 유형으로 사용되는 스트림이어야 합니다.
pt_br: O identificador que estende uma tupla deve ser um tipo de tupla ou um fluxo que seja usado como um tipo de tupla.
zh_tw: 用於延伸值組的 ID，其本身必須是值組類型或用作值組類型的串流。

# CDISP0393E
source: Immutable variables require an explicit initializer.
de: Nicht veränderbare Variablen erfordern einen expliziten Initialisierungsoperator.
es: Las variables inmutables requieren un inicializador explícito.
ko: 불변 변수는 명시 이니셜라이저를 필요로 합니다.
pt_br: As variáveis imutáveis requerem um inicializador explícito.
zh_tw: 不可變的變數需要明確的起始設定程式。

# CDISP0394E
source: The {0} composite operator expects {1,number,0} input ports, but {2,number,0} input ports are found.
de: Der Verbundoperator {0} erwartet {1,number,0} Eingabeports, aber es wurden {2,number,0} Eingabeports gefunden.
es: El operador compuesto {0} espera {1,número,0} puertos de entrada, para se han encontrado {2,número,0} puertos de entrada.
ko: {0} 복합 연산자가 {1,number,0}개의 입력 포트를 기대했으나 {2,number,0}개의 입력 포트를 발견했습니다.
pt_br: O operador composto {0} espera {1,number,0} portas de entrada, mas {2,number,0} portas de entrada foram localizadas.
zh_tw: {0} 複合運算子預期 {1,number,0} 個輸入埠，但卻找到 {2,number,0} 個輸入埠。

# CDISP0395E
source: The {0} composite operator expects {1,number,0} output ports, but {2,number,0} output ports are found.
de: Der Verbundoperator {0} erwartet {1,number,0} Ausgabeports, aber es wurden {2,number,0} Ausgabeports gefunden.
es: El operador compuesto {0} espera {1,número,0} puertos de salida, pero se han encontrado {2,número,0} puertos de salida.
ko: {0} 복합 연산자가 {1,number,0}개의 출력 포트를 기대했으나 {2,number,0}개의 출력 포트를 발견했습니다.
pt_br: O operador composto {0} espera {1,number,0} portas de saída, mas {2,number,0} portas de saída foram localizadas.
zh_tw: {0} 複合運算子預期 {1,number,0} 個輸出埠，但卻找到 {2,number,0} 個輸出埠。

# CDISP0396E
source: All the streams on one port must be of the same type, but the type of the {0} stream is different from the type of the {1} stream.
de: Alle Datenströme für einen Port müssen denselben Typ aufweisen, der Typ des Datenstroms {0} unterscheidet sich jedoch vom Typ des Datenstroms {1}.
es: Todas las secuencias de un puerto deben ser del mismo tipo, pero el tipo de la secuencia {0} es diferente del tipo de la secuencia {1}.
ko: 하나의 포트에 있는 스트림의 유형은 모두 동일해야 하지만 {0} 스트림의 유형이 {1} 스트림의 유형과 다릅니다.
pt_br: Todos os fluxos em uma porta devem ser do mesmo tipo, mas o tipo de fluxo {0} é diferente do tipo do fluxo {1}.
zh_tw: 一個埠上的所有串流都必須是相同的類型，但 {0} 串流的類型與 {1} 串流的類型不同。

# CDISP0397E
source: Return statements are permitted only in functions.
de: return-Anweisungen sind nur in Funktionen zulässig.
es: Las sentencias de retorno están permitidas solo en funciones.
ko: return문은 함수에서만 허용됩니다.
pt_br: As instruções de retorno são permitidas apenas em funções.
zh_tw: 僅在函數中容許使用 return 陳述式。

# CDISP0398E
source: The {0} type of the return value from the {1} function needs to be the {2} type.
de: Der Typ {0} des Rückgabewerts von der Funktion {1} muss der Typ {2} sein.
es: El tipo de valor de retorno {0} de la función {1} debe ser del tipo {2}.
ko: {1} 함수의 리턴 값 {0} 유형은 {2} 유형이어야 합니다.
pt_br: O tipo {0} do valor de retorno da função {1} precisa ser o tipo {2}.
zh_tw: 來自 {1} 函數的回覆值類型 {0} 需要是 {2} 類型。

# CDISP0401I
source: Set the directory for processing element checkpointing.
de: Verzeichnis für das Prüfpunktverfahren von Verarbeitungselementen festlegen.
es: Establezca el directorio para la sincronización por puntos de comprobación de elemento de proceso.
ko: 처리 요소 체크포인트 설정을 위한 디렉토리를 설정합니다.
pt_br: Configurar o diretório para ponto de verificação do elemento de processamento.
zh_tw: 設定用於處理元素檢查點檢查作業的目錄。

# CDISP0402E
source: The leading character of composite formal identifiers must be the dollar sign symbol ($).
de: Das führende Zeichen von formalen Verbundkennungen muss das Dollarzeichen ($) sein.
es: El carácter inicial de los identificadores formales compuestos debe ser el símbolo del signo de dólar ($).
ko: 복합 정규 ID의 선행 문자는 달러 기호($)여야 합니다.
pt_br: O caractere à esquerda dos identificadores formais compostos deve ser o símbolo de cifrão ($).
zh_tw: 複合格式 ID 的前導字元必須是錢幣符號 ($)。

# CDISP0403E
source: The {0} function is missing the following compile time argument: {1}.
de: In der Funktion {0} fehlt das folgende Kompilierzeitargument: {1}.
es: En la función {0} falta el argumento de tiempo de compilación siguiente: {1}.
ko: {0} 함수에서 다음 컴파일 시간 인수가 누락되었습니다: {1}.
pt_br: A função {0} requer o argumento de tempo de compilação a seguir: {1}.
zh_tw: {0} 函數遺漏了下列編譯時期引數：{1}。
