Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0720E
source: The {0} operator cannot use the config clause.
de: Der Operator {0} kann die Klausel ''config'' nicht verwenden.
es: El operador {0} no puede utilizar la cláusula de config.
ko: {0} 연산자는 config 절을 사용할 수 없습니다.
pt_br: O operador {0} não pode usar a cláusula de configuração.
zh_tw: {0} 運算子不能使用 config 子句。

# CDISP0721E
source: The {0} fusion mode option is available only with the --allow-convenience-fusion-options switch.
de: Die Fusionsmodusoption {0} ist nur mit dem Schalter --allow-convenience-fusion-options verfügbar.
es: La opción de la modalidad de fusión {0} solo está disponible con el conmutador --allow-convenience-fusion-options.
ko: {0} 연합 모드 옵션은 --allow-convenience-fusion-options 스위치를 사용해야만 사용할 수 있습니다.
pt_br: A opção do modo de fusão {0} está disponível somente com o comutador --allow-convenience-fusion-options.
zh_tw: {0} 融合模式選項只能與 --allow-convenience-fusion-options 開關搭配才可用。

# CDISP0722I
source: Allow the use of the convenience fusion options that are useful for debugging, but not suitable for general use. These options include: FNONE, FALL, and FRAND with the -p and --part-mode options. These options ignore the placement constraints that might exist in the program.
de: Die Verwendung der Komfortfusionsoptionen zulassen, die für Debugging nützlich sind, sich jedoch nicht für allgemeine Verwendung eignen. Zu diesen Optionen gehören: FNONE, FALL und FRAND mit den Optionen -p und --part-mode. Diese Optionen ignorieren die Verteilungseinschränkungen, die möglicherweise im Programm vorhanden sind.
es: Permita el uso de las opciones de fusión prácticas que son útiles para la depuración, pero que no son aptas para el uso general. Estas opciones incluyen: FNONE, FALL y FRAND con las opciones -p y --part-mode. Estas opciones ignoran las restricciones de ubicación que podrían existir en el programa.
ko: 디버깅에 유용하지만 일반적인 사용에는 적합하지 않은 간편 연합 옵션을 사용할 수 있도록 허용합니다. 이러한 옵션에는 -p 및 --part-mode 옵션이 있는 FNONE, FALL 및 FRAND가 포함됩니다. 이러한 옵션은 프로그램에 있을 수 있는 배치 제한조건을 무시합니다.
pt_br: Permitir o uso das opções de fusão de conveniência que são úteis para depuração, mas que não são adequadas para uso geral. Estas opções incluem: FNONE, FALL e FRAND com as opções -p e --part-mode. Estas opções ignoram as restrições de posicionamento que podem existir no programa.
zh_tw: 容許利用對除錯有用但不適合一般使用的便捷融合選項。這些選項包括：帶 -p 及 --part-mode 選項的 FNONE、FALL 和 FRAND。這些選項會忽略程式中可能存在的放置限制。

# CDISP0723W
source: The {0} operator is not supported in standalone mode.
de: Der Operator {0} wird im eigenständigen Modus nicht unterstützt.
es: El operador {0} no está soportado en la modalidad autónoma.
ko: {0} 연산자는 독립형 모드에서 지원되지 않습니다.
pt_br: O operador {0} não é suportado no modo independente.
zh_tw: {0} 運算子在獨立式模式下不受支援。

# CDISP0724E
source: The {0} value is not valid for the output-side-effects-behavior option. The valid values are: ignore, warn, or error.
de: Der Wert {0} ist für die Option output-side-effects-behavior nicht gültig. Gültige Werte: ignore, warn oder error.
es: El valor {0} no es válido para la opción output-side-effects-behavior. Los valores válidos son: ignore, warn o error.
ko: {0} 값은 output-side-effects-behavior 옵션에 대해 유효하지 않습니다. 유효한 값은 ignore, warn 또는 error입니다.
pt_br: O valor {0} não é válido para a opção de comportamento de efeitos colaterais de saída. Os valores válidos são: ignore, warn ou error.
zh_tw: {0} 值不適用於 output-side-effects-behavior 選項。有效值為：ignore、warn 或 error。

# CDISP0725E
source: The default initializer for the {0} composite formal parameter contains a reference to the {1} composite formal parameter. The composite formal initializers cannot reference other composite formals.
de: Das Standardinitialisierungsoperator für den formalen Verbundparameter {0} enthält eine Referenz auf den formalen Verbundparameter {1}. Die formalen Verbundinitialisierungsoperatoren können keine anderen formalen Verbundparameter referenzieren.
es: El inicializador predeterminado para el parámetro formal compuesto {0} contiene una referencia al parámetro formal compuesto {1}. Los inicializadores formales compuestos no pueden hacer referencia a otros valores formales compuestos.
ko: {0} 복합 정규 매개변수에 대한 기본 이니셜라이저에 {1} 복합 정규 매개변수에 대한 참조가 포함되어 있습니다. 복합 정규 이니셜라이저는 다른 복합 정규를 참조할 수 없습니다.
pt_br: O inicializador padrão para o parâmetro formal composto {0} contém uma referência ao parâmetro formal composto {1}. Os inicializadores formais compostos não podem referenciar outros formais compostos.
zh_tw: {0} 複合格式參數的預設起始設定程式包含對 {1} 複合格式參數的參照。複合格式起始設定程式不能參照其他複合格式。

# CDISP0726E
source: A circular type definition was detected in the {0} type.
de: Eine zirkulär Typdefinition wurde im Typ {0} festgestellt.
es: Se ha detectado una definición de tipo circular en el tipo {0}.
ko: {0} 유형에서 순환 유형 정의를 발견했습니다.
pt_br: Uma definição de tipo circular foi detectada no tipo {0}.
zh_tw: 在 {0} 類型中偵測到循環類型定義。

# CDISP0727W
source: The {0} input path is not a directory.
de: Der Eingabepfad {0} ist kein Verzeichnis.
es: La vía de acceso de entrada {0} no es un directorio.
ko: {0} 입력 경로가 디렉토리가 아닙니다.
pt_br: O caminho de entrada {0} não é um diretório.
zh_tw: {0} 輸入路徑不是目錄。

# CDISP0728E
source: The logic onProcess clause can be used only in a Custom operator that has no input streams.
de: Die Klausel ''logic onProcess'' kann nur in einem benutzerdefinierten Operator verwendet werden, der keine Eingabedatenströme hat.
es: La cláusula onProcess lógica solo se puede utilizar en un operador personalizado que no tiene secuencias de entrada.
ko: logic onProcess 절은 입력 스트림이 없는 Custom 연산자에서만 사용할 수 있습니다.
pt_br: A cláusula onProcess lógica pode ser usada somente em um operador customizado que não possuir fluxos de entrada.
zh_tw: logic onProcess 子句只能在沒有任何輸入串流的「自訂」運算子中使用。

# CDISP0729W
source: A feedback loop was detected on the data path: {0}.
de: Eine Rückkopplungsschleife wurde im Datenpfad festgestellt: {0}.
es: Se ha detectado un bucle de comentarios en la vía de acceso de datos: {0}.
ko: 데이터 경로에서 피드백 루프를 발견했습니다: {0}.
pt_br: Um loop de feedback foi detectado no caminho de dados: {0}.
zh_tw: 在資料路徑上偵測到反饋迴圈：{0}。

# CDISP0730I
source: The SPL files, operators, or native functions are not found in the {0} path. The toolkit.xml file was not created.
de: Die SPL-Dateien, SPL-Operatoren oder nativen SPL-Funktionen werden im Pfad {0} nicht gefunden. Die Datei ''toolkit.xml'' wurde nicht erstellt.
es: Los archivos SPL, operadores o funciones nativas no se han encontrado en la vía de acceso {0}. El archivo toolkit.xml no se ha creado.
ko: SPL 파일, 연산자 또는 원시(native) 함수를 {0} 경로에서 찾을 수 없습니다. toolkit.xml 파일이 작성되지 않았습니다.
pt_br: Os arquivos, operadores ou funções nativas do SPL não foram localizados no caminho {0}. O arquivo toolkit.xml não foi criado.
zh_tw: 在 {0} 路徑中找不到 SPL 檔、運算子或原生函數。未建立 toolkit.xml 檔。

# CDISP0731E
source: The {0} expression for the window eviction policy size must not reference an input stream.
de: Der Ausdruck {0} für die Größe der Fensterbereinigungsrichtlinie darf keinen Eingabedatenstrom referenzieren.
es: La expresión {0} para el tamaño de la política de desalojo de ventana no debe hacer referencia a una secuencia de entrada.
ko: 창 제거 정책 크기에 대한 {0} 표현식은 입력 스트림을 참조하지 않아야 합니다.
pt_br: A expressão {0} para o tamanho de política de desocupação de janela não deve referenciar um fluxo de entrada.
zh_tw: 視窗收回原則大小的 {0} 表示式不得參照輸入串流。

# CDISP0732E
source: The {0} expression for the window trigger policy size must not reference an input stream.
de: Der Ausdruck {0} für die Größe der Fenstertriggerrichtlinie darf keinen Eingabedatenstrom referenzieren.
es: La expresión {0} para el tamaño de la política de activador de ventana no debe hacer referencia a una secuencia de entrada.
ko: 창 트리거 정책 크기에 대한 {0} 표현식은 입력 스트림을 참조하지 않아야 합니다.
pt_br: A expressão {0} para o tamanho da política do acionador de janela não deve referenciar um fluxo de entrada.
zh_tw: 視窗觸發原則大小的 {0} 表示式不得參照輸入串流。

# CDISP0734W
source: The following warning was generated while the compiler was parsing an XML file: {0}.
de: Die folgende Warnung wurde generiert, während der Compiler eine XML-Datei parste: {0}.
es: Se ha generado el aviso siguiente mientra el compilador analizaba un archivo XML: {0}.
ko: 컴파일러가 XML 파일을 구문 분석하는 중에 다음 경고가 생성되었습니다: {0}.
pt_br: O aviso a seguir foi gerado enquanto o compilador analisava um arquivo XML: {0}.
zh_tw: 編譯器在剖析 XML 檔時產生下列警告：{0}。

# CDISP0735E
source: The following error was generated while the compiler was parsing an XML file: {0}.
de: Der folgende Fehler wurde generiert, während der Compiler eine XML-Datei parste: {0}.
es: Se ha generado el error siguiente mientras el compilador analizaba un archivo XML: {0}.
ko: 컴파일러가 XML 파일을 구문 분석하는 중에 다음 오류가 생성되었습니다: {0}.
pt_br: O seguinte erro foi gerado enquanto o compilador analisava um arquivo XML: {0}.
zh_tw: 編譯器在剖析 XML 檔時產生下列錯誤：{0}。

# CDISP0736W
source: The {0} path contains directory names that are not valid names for SPL namespaces. The {1} file is ignored.
de: Der Pfad {0} enthält Verzeichnisnamen, die keine gültigen Namen für SPL-Namensbereiche sind. Die Datei {1} wird ignoriert.
es: La vía de acceso {0} contiene nombres de directorio que no son nombres válidos para espacios de nombres SPL. Se ignora el archivo {1}.
ko: {0} 경로에 SPL 네임스페이스에 대해 유효한 이름이 아닌 디렉토리 이름이 포함되어 있습니다. {1} 파일이 무시됩니다.
pt_br: O caminho {0} contém nomes de diretório que não são nomes válidos para namespaces SPL. O arquivo {1} é ignorado.
zh_tw: {0} 路徑所包含的目錄名稱不是 SPL 名稱空間的有效名稱。將忽略 {1} 檔。

# CDISP0737E
source: An unrecoverable internal compiler error occurred in the spl-make-toolkit command. The signal number is: {0,number,0}. Contact IBM Software Support.
de: Ein nicht behebbarer interner Compilerfehler ist im Befehl ''spl-make-toolkit'' aufgetreten. Signalnummer: {0,number,0}. Wenden Sie sich an den IBM Software Support.
es: Se ha producido un error de compilador interno irrecuperable en el mandato spl-make-toolkit. El número de señal es: {0,número,0}. Póngase en contacto con el servicio de soporte de software de IBM.
ko: spl-make-toolkit 명령에서 복구 불가능한 내부 컴파일러 오류가 발생했습니다. 신호 번호는 {0,number,0}입니다. IBM 소프트웨어 지원 센터에 문의하십시오.
pt_br: Um erro do compilador interno irrecuperável ocorreu no comando spl-make-toolkit. O número do sinal é: {0,number,0}. Entre em contato com o Suporte de Software IBM.
zh_tw: spl-make-toolkit 指令發生無法復原的內部編譯器錯誤。信號號碼是：{0,number,0}。請與「IBM 軟體支援中心」聯絡。

# CDISP0738E
source: For the {0} expression, the value of the window partition eviction policy must not reference an input stream.
de: Für den Ausdruck {0} darf der Wert der Bereinigungsrichtlinie für Fensterpartitionen keinen Eingabedatenstrom referenzieren.
es: Para la expresión {0}, el valor de la política de desalojo de partición de ventana no debe hacer referencia a una secuencia de entrada.
ko: {0} 표현식에서, 창 파티션 제거 정책의 값은 입력 스트림을 참조하지 않아야 합니다.
pt_br: A expressão {0} para o valor da política de desocupação da partição de janela não deve referenciar um fluxo de entrada.
zh_tw: 對於 {0} 表示式，視窗分割區收回原則的值不得參照輸入串流。

# CDISP0739E
source: One partition eviction policy is needed for the window, but the following number of policies found are found: {0,number,0}.
de: Für das Fenster wird eine Partitionsbereinigungsrichtlinie benötigt, es wurde jedoch die folgende Anzahl Richtlinien gefunden: {0,number,0}.
es: Es necesaria una política de desalojo de partición para la ventana, pero se ha encontrado el número de políticas siguiente: {0,número,0}.
ko: 창에 대해 하나의 파티션 제거 정책이 필요하지만 {0,number,0}개의 정책을 발견했습니다.
pt_br: Uma política de desocupação de partição é necessária para a janela, mas o número de políticas localizadas a seguir foi encontrado: {0,number,0}.
zh_tw: 視窗需要一個分割區收回原則，但卻找到下列數目的原則：{0,number,0}。

# CDISP0740E
source: The partition eviction policy for the window is found, but the window is not partitioned.
de: Die Partitionsbereinigungsrichtlinie für das Fenster wurde gefunden, das Fenster ist jedoch nicht partitioniert.
es: Se ha encontrado la política de desalojo de partición para la ventana, pero la ventana no está particionada.
ko: 창에 대한 파티션 제거 정책을 발견했으나 해당 창이 파티션되지 않았습니다.
pt_br: A política de desocupação de partição para a janela foi localizada, mas a janela não está particionada.
zh_tw: 找到視窗的分割區收回原則，但該視窗卻未分割。

# CDISP0741E
source: The map literal element is not valid. All the elements of a map literal must be in the following format: expression : expression
de: Das Mapliteralelement ist nicht gültig. Alle Elemente eines Mapliterals müssen im folgenden Format vorliegen: Ausdruck : Ausdruck
es: El elemento de literal de correlación no es válido. Todos los elementos de un literal de correlación deben tener el formato siguiente: expresión : expresión
ko: 맵 리터럴 요소가 유효하지 않습니다. 모든 맵 리터럴 요소의 형식은 표현식 : 표현식과 같아야 합니다.
pt_br: O elemento de literal de mapa não é válido. Todos os elementos de um literal de mapa devem estar no seguinte formato: expressão: expressão
zh_tw: 對映文字元素無效。對映文字的所有元素都必須採用下列格式：表示式 : 表示式

# CDISP0742I
source: The emitted information is used to build a vcg graph of the internal data structures.
de: Mit den ausgegebenen Informationen wird ein VCG-Diagramm der internen Datenstrukturen erstellt.
es: La información emitida se utiliza para crear un gráfico vcg de las estructuras de datos internos.
pt_br: As informações emitidas são usadas para construir um gráfico vcg das estruturas de dados internas.
zh_tw: 所產生的資訊用於建置內部資料結構的 vcg 圖形。

# CDISP0743E
source: The {0} state variable shadows an attribute of the same name.
de: Die Statusvariable {0} spiegelt ein gleichnamiges Attribut.
es: La variable de estado {0} duplica un atributo del mismo nombre.
ko: {0} 상태 변수가 동일한 이름의 속성을 새도우 처리합니다.
pt_br: A variável de estado {0} simula um atributo do mesmo nome.
zh_tw: {0} 狀態變數會遮蔽相同名稱的屬性。

# CDISP0744I
source: Select the application behavior to be used when a state variable shadows an attribute.
de: Das zu verwendende Anwendungsverhalten auswählen, wenn eine Statusvariable ein Attribut spiegelt.
es: Seleccione el comportamiento de la aplicación que se utilizará cuando una variable de estado duplica un atributo.
ko: 상태 변수가 속성을 새도우 처리하는 경우 사용될 애플리케이션 동작을 선택하십시오.
pt_br: Selecione o comportamento do aplicativo a ser usado quando uma variável de estado simula um atributo.
zh_tw: 選取在狀態變數遮蔽屬性時，應用程式要具有的行為。

# CDISP0745E
source: The {0} value is not valid for the {1} option. The valid values for this option are: old and new.
de: Der Wert {0} ist für die Option {1} nicht gültig. Gültige Werte für diese Option: old und new.
es: El valor {0} no es válido para la opción {1}. Los valores válidos para esta opción son: old y new.
ko: {0} 값이 {1} 옵션에 대해 유효하지 않습니다. 이 옵션에 대해 유효한 값은 old 및 new입니다.
pt_br: O valor {0} não é válido para a opção {1}. Os valores válidos para esta opção são: old e new.
zh_tw: {0} 值不適用於 {1} 選項。這個選項的有效值為：old 和 new。

# CDISP0746E
source: The order of the window clause must be: ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
de: Erforderliche Reihenfolge der Klausel ''window'': ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
es: El orden de la cláusula de ventana debe ser: ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
ko: window 절의 순서는 다음과 같아야 합니다: ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
pt_br: A ordem da cláusula de janela deve ser: ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
zh_tw: window 子句的順序必須是：( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) ['','' ''partitioned'' ['','' partitionEvictionSpec] ]。

# CDISP0747W
source: The order of the window clause must be: ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) | (''timeInterval'', [''intervalDuration(intervalDurationSpec)''] ['','' ''intervalOffset(intervalOffsetSpec)''] ['','' ''creationPeriod(creationPeriodSpec)''] ['','' ''discardAge(discardAgeSpec)'']) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
de: Erforderliche Reihenfolge der Klausel ''window'': ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) | (''timeInterval'', [''intervalDuration(intervalDurationSpec)''] ['','' ''intervalOffset(intervalOffsetSpec)''] ['','' ''creationPeriod(creationPeriodSpec)''] ['','' ''discardAge(discardAgeSpec)'']) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
es: El orden de la cláusula de ventana debe ser: ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) | (''timeInterval'', [''intervalDuration(intervalDurationSpec)''] ['','' ''intervalOffset(intervalOffsetSpec)''] ['','' ''creationPeriod(creationPeriodSpec)''] ['','' ''discardAge(discardAgeSpec)'']) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
ko: window절의 순서는 다음과 같습니다. ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) | (''timeInterval'', [''intervalDuration(intervalDurationSpec)''] ['','' ''intervalOffset(intervalOffsetSpec)''] ['','' ''creationPeriod(creationPeriodSpec)''] ['','' ''discardAge(discardAgeSpec)'']) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
pt_br: A ordem da cláusula de janela deve ser: ( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) | (''timeInterval'', [''intervalDuration(intervalDurationSpec)''] ['','' ''intervalOffset(intervalOffsetSpec)''] ['','' ''creationPeriod(creationPeriodSpec)''] ['','' ''discardAge(discardAgeSpec)'']) ['','' ''partitioned'' ['','' partitionEvictionSpec] ].
zh_tw: window 子句的順序必須是：( ''tumbling'' '','' evictionSpec ) | (''sliding'' '','' evictionSpec ['','' triggerSpec] ) | (''timeInterval'', [''intervalDuration(intervalDurationSpec)''] ['','' ''intervalOffset(intervalOffsetSpec)''] ['','' ''creationPeriod(creationPeriodSpec)''] ['','' ''discardAge(discardAgeSpec)'']) ['','' ''partitioned'' ['','' partitionEvictionSpec] ]。

# CDISP0748E
source: The {0} value is not valid for the for the window-clause-ordering option. The valid values are: any and strict.
de: Der Wert {0} ist für die Option ''window-clause-ordering'' nicht gültig. Gültige Werte: ''any'' und ''strict''.
es: El valor {0} no es válido para la opción window-clause-ordering. Los valores válidos son: any and strict.
ko: {0} 값은 window-clause-ordering 옵션에 대해 유효하지 않습니다. 유효한 값은 any 및 strict입니다.
pt_br: O valor {0} não é válido para a opção de ordenação de cláusula de janela. Os valores válidos são: any e strict.
zh_tw: {0} 值不適用於 window-clause-ordering 選項。有效值為：any 和 strict。

# CDISP0749I
source: Select the behavior that occurs when a window clause is out of order.
de: Das Verhalten auswählen, das auftritt, wenn die Reihenfolge einer Klausel ''window'' falsch ist.
es: Seleccione el comportamiento que se produce cuando una cláusula de ventana está desordenada.
ko: window 절의 순서가 잘못된 경우 발생하는 동작을 선택합니다.
pt_br: Selecione o comportamento que ocorre quando uma cláusula de janela estiver desatualizada.
zh_tw: 選取在 window 子句不正常時所發生的行為。

# CDISP0750E
source: The {0} attribute of the {1} type is found, but the {2} type is expected.
de: Das Attribut {0} des Typs {1} wurde gefunden, jedoch wurde der Typ {2} erwartet.
es: Se ha encontrado el atributo {0} del tipo {1}, pero se espera el tipo {2}.
ko: {1} 유형의 {0} 속성이 발견되었으나 기대된 항목은 {2} 유형입니다.
pt_br: O atributo {0} do tipo {1} foi localizado, mas o tipo {2} é esperado.
zh_tw: 找到 {1} 類型的 {0} 屬性，但卻預期 {2} 類型。

# CDISP0751E
source: The {0} type formal was already defined in the {1} function prototype.
de: Der formale Typparameter {0} wurde bereits im Funktionsprototyp {1} definiert.
es: El valor formal del tipo {0} ya está definido en el prototipo de función {1}.
ko: {0} 유형 정규가 {1} 함수 프로토타입에 이미 정의되어 있습니다.
pt_br: O formal de tipo {0} já estava definido no protótipo de função {1}.
zh_tw: {0} 類型格式已經定義於 {1} 函數原型中。

# CDISP0752E
source: The {0} type formal is declared, but is not used as a type in any function parameter in the {1} function prototype. To enable the compiler to bind the type formals to a concrete type, the type formals must be in the parameter list.
de: Der formale Typparameter {0} ist deklariert, wird jedoch nicht als Typ in einem Funktionsparameter im Funktionsprototyp {1} verwendet. Die formalen Typparameter müssen sich in der Parameterliste befinden, damit der Compiler sie an einen konkreten Typ binden kann.
es: El valor formal de tipo {0} está declarado, pero no se utiliza como tipo en ningún parámetro de función del prototipo de función {1}. Para permitir al compilador enlazar los formales de tipo a un tipo concreto, los formales de tipo deben estar en la lista de parámetros.
ko: {0} 유형 정규가 선언되었으나 {1} 함수 프로토타입의 함수 매개변수에서 유형으로 사용되고 있지 않습니다. 컴파일러가 유형 정규를 구체적 유형에 바인드할 수 있도록 하려면 유형 정규가 매개변수 목록에 있어야 합니다.
pt_br: O formal de tipo {0} foi declarado, mas não é usado como um tipo em nenhum parâmetro de função no protótipo de função {1}. Para ativar o compilador para ligar os formais de tipo a um tipo concreto, os formais de tipo deverão estar lista de parâmetros.
zh_tw: 已宣告 {0} 類型格式，但卻未將其用作 {1} 函數原型中任何函數參數內的類型。如果要容許編譯器將類型格式連結至具體類型，則類型格式必須在參數清單內。

# CDISP0753E
source: The {0} bound formal is already defined in the {1} function prototype.
de: Der formale Grenzparameter {0} ist bereits im Funktionsprototyp {1} definiert.
es: El formal de límite {0} ya está definido en el prototipo de función {1}.
ko: {0} 바운드 정규가 {1} 함수 프로토타입에 이미 정의되어 있습니다.
pt_br: O formal de limite {0} já está definido no protótipo de função {1}.
zh_tw: {0} 範圍格式已經定義於 {1} 函數原型中。

# CDISP0754E
source: The {0} bound formal is declared, but is not used in a type in any function parameter in the {1} function prototype. To enable the compiler to bind the bound formals to a concrete type, the bound formals must appear in the parameter list.
de: Der formale Grenzparameter {0} ist deklariert, wird jedoch nicht in einem Typ in einem Funktionsparameter im Funktionsprototyp {1} verwendet. Die formalen Grenzparameter müssen in der Parameterliste vorkommen, damit der Compiler sie an einen konkreten Typ binden kann.
es: El formal de límite {0} está declarado, pero no se utiliza en un tipo en ningún parámetro de función del prototipo de función {1}. Para permitir al compilador enlazar los formales de límite a un tipo concreto, los formales de límite deben aparecer en la lista de parámetros.
ko: {0} 바운드 정규가 선언되었으나 {1} 함수 프로토타입의 함수 매개변수 유형에서 사용되고 있지 않습니다. 컴파일러가 바운드 정규를 구체적 유형에 바인드할 수 있도록 하려면 바운드 정규가 매개변수 목록에 표시되어야 합니다.
pt_br: O formal de limite {0} foi declarado, mas não é usado em um tipo em nenhum parâmetro de função no protótipo de função {1}. Para permitir que o compilador ligue os formais a um tipo concreto, os formais de limite deverão aparecer na lista de parâmetros.
zh_tw: 已宣告 {0} 範圍格式，但卻未將其用在 {1} 函數原型中任何函數參數內的類型中。如果要容許編譯器將範圍格式連結至具體類型，則範圍格式必須出現在參數清單內。

# CDISP0755W
source: The {0} file was not indexed because it is under a primitive operator directory.
de: Die Datei {0} wurde nicht indexiert, weil sie sich in einem Verzeichnis für primitive Operatoren befindet.
es: El archivo {0} no se ha indexado porque está debajo de un directorio de operador de primitiva.
ko: {0} 파일이 기본 연산자 디렉토리에 있어 인덱스화되지 않았습니다.
pt_br: O arquivo {0} não foi indexado, pois ele está em um diretório de operador primitivo.
zh_tw: 未建立 {0} 檔案的索引，因為該檔案位於初始運算子目錄中。
