Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP9050E
source: The parsing option is valid with the following formats only: csv, txt, and bin.
de: Die Option ''parsing'' ist nur für die folgende Formate gültig: csv, txt und bin.
es: La opción de análisis es válida solo con los formatos siguientes: csv, txt y bin.
ko: parsing 옵션은 csv, txt, 및 bin 형식에 대해서만 유효합니다.
pt_br: A opção de análise sintática é válida somente com os seguintes formatos: csv, txt e bin.
zh_tw: parsing 選項只對下列格式有效：csv、txt 和 bin。

# CDISP9051E
source: The writePunctuations option is valid with the following formats only: csv, txt, and bin.
de: Die Option ''writePunctuations'' ist nur für die folgende Formate gültig: csv, txt und bin.
es: La opción writePunctuations es válida solo con los formatos siguientes: csv, txt y bin.
ko: writePunctuations 옵션은 csv, txt, 및 bin 형식에 대해서만 유효합니다.
pt_br: A opção writePunctuations é válida somente com os seguintes formatos: csv, txt e bin.
zh_tw: writePunctuations 選項只對下列格式有效：csv、txt 和 bin。

# CDISP9052E
source: The line format tuple must use one rstring attribute.
de: Das Zeilenformattupel muss ein rstring-Attribut verwenden.
es: La tupla de formato de línea debe utilizar un atributo rstring.
ko: 행 형식 튜플은 하나의 rstring 속성을 사용해야 합니다.
pt_br: A tupla de formato de linha deve usar um atributo rstring.
zh_tw: 行格式值組必須使用一個 rstring 屬性。

# CDISP9053E
source: The block format tuple must use one blob attribute.
de: Das Blockformattupel muss ein blob-Attribut verwenden.
es: La tupla de formato de bloque debe utilizar un atributo blob.
ko: 블록 형식 튜플은 하나의 blob 속성을 사용해야 합니다.
pt_br: A tupla de formato em bloco deve usar um atributo blob.
zh_tw: 區塊格式值組必須使用一個二進位大型物件屬性。

# CDISP9054E
source: The value of the eolMarker parameter must be one or two characters. The value can use the \\X SPL form for special characters.
de: Der Wert des Parameters ''eolMarker'' muss aus ein oder zwei Zeichen bestehen. Der Wert kann das SPL-Format \\X für Sonderzeichen verwenden.
es: El valor del parámetro eolMarker debe ser de uno o dos caracteres. El valor puede utilizar el formato SPL \\X para caracteres especiales.
ko: eolMarker 매개변수의 값은 한 자 또는 두 자의 문자여야 합니다. 이 값은 특수 문자에 대해 \\X SPL 양식을 사용할 수 있습니다.
pt_br: O valor do parâmetro eolMarker deve ser um ou dois caracteres. O valor pode usar o formato SPL \\X para caracteres especiais.
zh_tw: eolMarker 參數的值必須是一個或兩個字元。該值可以對特殊字元使用 \\X SPL 形式。

# CDISP9055E
source: The address parameter and the name parameter cannot both be specified.
de: Die Parameter ''address'' und ''name'' können nicht zusammen angegeben werden.
es: No se pueden especificar ambos parámetros, el de dirección y el de nombre.
ko: address 매개변수와 name 매개변수는 둘 다 지정할 수 없습니다.
pt_br: O parâmetro de endereço e o parâmetro de nome não podem ser especificados juntos.
zh_tw: 不能同時指定 address 參數和 name 參數。

# CDISP9056E
source: The port parameter and the name parameter cannot both be specified.
de: Die Parameter ''port'' und ''name'' können nicht zusammen angegeben werden.
es: No se pueden especificar ambos parámetros, el de puerto y el de nombre.
ko: port 매개변수와 name 매개변수는 둘 다 지정할 수 없습니다.
pt_br: O parâmetro de porta e o parâmetro de nome não podem ser especificados juntos.
zh_tw: 不能同時指定 port 參數和 name 參數。

# CDISP9057E
source: Either the name parameter or the address and the port parameters can be specified.
de: Der Parameter ''name'' oder die Parameter ''address'' und ''port'' können angegeben werden.
es: Se puede especificar el parámetro de nombre o bien los parámetros de dirección y de puerto.
ko: name 매개변수, 또는 address 및 port 매개변수를 지정할 수 있습니다.
pt_br: O parâmetro de nome ou os parâmetros de endereço e de porta podem ser especificados.
zh_tw: 可以指定 name 參數或者 address 與 port 參數。

# CDISP9059E
source: The address parameter is not valid when the role parameter is set to server.
de: Der Parameter ''address'' ist nicht gültig, wenn der Parameter ''role'' auf ''server'' gesetzt ist.
es: El parámetro de dirección no es válido cuando el parámetro de rol está establecido en servidor.
ko: role 매개변수가 server로 설정된 경우에는 address 매개변수가 유효하지 않습니다.
pt_br: O parâmetro de endereço não é válido quando o parâmetro de função estiver configurado para servidor.
zh_tw: 將 role 參數設為 server 時，address 參數無效。

# CDISP9060E
source: The port expression type must be rstring or uint32. The actual type is {0}.
de: Der Portausdruckstyp muss rstring oder uint32 sein. Der tatsächliche Typ ist {0}.
es: El tipo de expresión de puerto debe ser rstring o uint32. El tipo real es {0}.
ko: port 표현식 유형은 rstring 또는 uint32여야 합니다. 실제 유형은 {0}입니다.
pt_br: O tipo de expressão da porta deve ser rstring ou uint32. O tipo real é {0}.
zh_tw: port 表示式類型必須是 rstring 或 uint32。實際類型是 {0}。

# CDISP9061E
source: The {0} option is unknown to the command.
de: Die Option {0} ist für den Befehl unbekannt.
es: La opción {0} no es conocida en el mandato.
ko: 이 명령에서 {0} 옵션은 알 수 없는 옵션입니다.
pt_br: A opção {0} é desconhecida para o comando.
zh_tw: {0} 選項對指令不明。

# CDISP9062E
source: To use the reconnectionBound parameter, the reconnection policy must be set with a bounded retry.
de: ''reconnectionPolicy'' muss auf ''BoundedRetry'' gesetzt werden, um den Parameter ''reconnectionBound'' verwenden zu können.
es: Para utilizar el parámetro reconnectionBound, la política de reconexión se debe establecer con un reintento limitado.
ko: reconnectionBound 매개변수를 사용하려면 재연결 정책이 유한한 재시도로 설정되어야 합니다.
pt_br: Para usar o parâmetro reconnectionBound, a política de reconexão deve ser configurada com uma nova tentativa limitada.
zh_tw: 如果要使用 reconnectionBound 參數，則必須將重新連線原則設定為具有有限重試次數。

# CDISP9063E
source: If the reconnection policy is set with a bounded retry, the reconnectionBound parameter must be specified.
de: Wenn ''reconnectionPolicy'' auf ''BoundedRetry'' gesetzt ist, muss der Parameter ''reconnectionBound'' angegeben werden.
es: Si la política de reconexión está establecida con un reintento limitado, se debe especificar el parámetro reconnectionBound.
ko: 재연결 정책이 유한한 재시도로 설정된 경우에는 reconnectionBound 매개변수를 지정해야 합니다.
pt_br: Se a política de reconexão for configurada com uma nova tentativa limitada, o parâmetro reconnectionBound deverá ser especificado.
zh_tw: 如果將重新連線原則設定為具有有限重試次數，則必須指定 reconnectionBound 參數。

# CDISP9067E
source: The number of expressions in the {0} parameter list is different from the number of expressions in the {1} parameter list.
de: Die Anzahl der Ausdrücke in der Liste des Parameters {0} unterscheidet sich von der Anzahl der Ausdrücke in der Liste des Parameters {1}.
es: El número de expresiones en la lista de parámetros {0} es diferente del número de expresiones de la lista de parámetros {1}.
ko: {0} 매개변수 목록에 있는 표현식의 수가 {1} 매개변수 목록에 있는 표현식의 수와 다릅니다.
pt_br: O número de expressões na lista de parâmetros {0} é diferente do número de expressões na lista de parâmetros {1}.
zh_tw: {0} 參數清單中的表示式數目與 {1} 參數清單中的表示式數目不同。

# CDISP9068E
source: The actual number of output ports, which is {0}, is not valid. The expected number of output ports for the {2} join algorithm is {1}.
de: Die tatsächliche Anzahl Ausgabeports, die {0} ist, ist nicht gültig. Die erwartete Anzahl Ausgabeports für den Joinalgorithmus {2} ist {1}.
es: El número real de puertos de salida, que es {0}, no es válido. El número previsto de puertos de salida para el algoritmo de unión {2} es {1}.
ko: 실제 출력 포트 수인 {0}개가 유효하지 않습니다. {2} 조인 알고리즘에 대해 기대된 출력 포트 수는 {1}개입니다.
pt_br: O número real de portas de saída, que é {0}, não é válido. O número esperado de portas de saída para o algoritmo de junção {2} é {1}.
zh_tw: 實際的輸出埠數目 {0} 無效。{2} 結合演算法預期的輸出埠數目是 {1}。

# CDISP9069E
source: The schema for the second output port does not match the schema for the left input port.
de: Das Schema für den zweiten Ausgabeport stimmt nicht mit dem Schema für den linken Eingabeport überein.
es: El esquema para el segundo puerto de salida no coincide con el esquema para el puerto de salida izquierdo.
ko: 두 번째 출력 포트의 스키마가 왼쪽 입력 포트의 스키마와 일치하지 않습니다.
pt_br: O esquema para a segunda porta de saída não corresponde ao esquema para a porta de entrada à esquerda.
zh_tw: 第二個輸出埠的綱目與左側輸入埠的綱目不符。

# CDISP9070E
source: The schema for the second or third output port does not match the schema for the right input port.
de: Das Schema für den zweiten oder dritten Ausgabeport stimmt nicht mit dem Schema für den rechten Eingabeport überein.
es: El esquema para el segundo o tercer puerto de salida no coincide con el esquema del puerto de entrada derecho.
ko: 두 번째 또는 세 번째 출력 포트의 스키마가 오른쪽 입력 포트의 스키마와 일치하지 않습니다.
pt_br: O esquema para a segunda ou terceira porta de saída não corresponde ao esquema para a porta de entrada à direita.
zh_tw: 第二個或第三個輸出埠的綱目與右側輸入埠的綱目不符。

# CDISP9071E
source: The following expression type mismatch exists in the equalityLHS and the equalityRHS parameter lists: {0} and {1}.
de: Die folgende Ausdruckstypabweichung ist in den Parameterlisten ''equalityLHS'' und ''equalityRHS'' vorhanden: {0} und {1}.
es: Existe una discrepancia de tipo de expresión siguiente en las listas de parámetros equalityLHS y equalityRHS: {0} y {1}.
ko: equalityLHS 및 equalityRHS 매개변수 목록에 다음 표현식 유형 불일치가 있습니다: {0} 및 {1}.
pt_br: A incompatibilidade de tipo de expressão a seguir existe nas listas de parâmetros equalityLHS e equalityRHS: {0} e {1}.
zh_tw: equalityLHS 與 equalityRHS 參數清單中存在下列不符的表示式類型：{0} 和 {1}。

# CDISP9072E
source: The PartitionBy{0} expression is missing from the parameter list.
de: Der Ausdruck PartitionBy{0} fehlt in der Parameterliste.
es: La expresión PartitionBy{0} falta en la lista de parámetros.
ko: PartitionBy{0} 표현식이 매개변수 목록에서 누락되었습니다.
pt_br: A expressão PartitionBy{0} está ausente na lista de parâmetros.
zh_tw: 參數清單中遺漏了 PartitionBy{0} 表示式。

# CDISP9073E
source: The {0} parameter was already specified for input port number {1}.
de: Der Parameter {0} wurde bereits für die Eingabeportnummer {1} angegeben.
es: El parámetro {0} ya se ha especificado para el número de puerto de entrada {1}.
ko: {0} 매개변수가 입력 포트 번호 {1}에 이미 지정되었습니다.
pt_br: O parâmetro {0} já foi especificado para o número da porta de entrada {1}.
zh_tw: 已經對輸入埠號 {1} 指定了 {0} 參數。

# CDISP9074E
source: The expected number of expressions for the {0} partition is {2}, but the actual number of partitions found is {1}.
de: Die erwartete Anzahl Ausdrücke für die Partition {0} ist {2}, die tatsächliche Anzahl gefundener Partitionen ist jedoch {1}.
es: El número previsto de expresiones para la partición {0} es {2}, pero el número real de particiones encontradas es {1}.
ko: {0} 파티션에 대해 기대된 표현식의 수가 {2}개이나 실제 파티션 수가 {1}개인 것을 발견했습니다.
pt_br: O número esperado de expressões para a partição {0} é {2}, mas o número real de partições localizadas é {1}.
zh_tw: {0} 分割區預期的表示式數目是 {2}，但找到的實際分割區數目是 {1}。

# CDISP9075E
source: The following expression type mismatch exists in the {0} parameter list: {1} and {2}.
de: Die folgende Ausdruckstypabweichung ist in der Parameterliste {0} vorhanden: {1} und {2}.
es: Existe la discrepancia de tipo de expresión siguiente en la lista de parámetros {0}: {1} y {2}.
ko: {0} 매개변수 목록에 다음 표현식 유형 불일치가 있습니다: {1} 및 {2}.
pt_br: A incompatibilidade de tipo de expressão a seguir existe na lista de parâmetros {0}: {1} e {2}.
zh_tw: {0} 參數清單中存在下列不符的表示式類型：{1} 和 {2}。

# CDISP9076E
source: The maximum size of the spl file was reached while the splmm file was processing.
de: Die maximale Größe der spl-Datei wurde während der Verarbeitung der Datei ''splmm'' erreicht.
es: El tamaño máximo del archivo spl se ha alcanzado mientras se estaba procesando el archivo splmm.
ko: splmm 파일이 처리되는 중에 spl 파일의 최대 크기에 도달했습니다.
pt_br: O tamanho máximo do arquivo SPL foi atingido enquanto o arquivo SPLMM estava processando.
zh_tw: 處理 splmm 檔時，已達到 SPL 檔的大小上限。

# CDISP9077E
source: The maximum elapsed time was reached while the splmm file was processing.
de: Die maximal abgelaufene Zeit wurde während der Verarbeitung der Datei ''splmm'' erreicht.
es: Se ha alcanzado el tiempo máximo transcurrido mientras se procesaba el archivo splmm.
ko: splmm 파일이 처리되는 중에 최대 경과 시간에 도달했습니다.
pt_br: O tempo máximo decorrido foi atingido enquanto o arquivo SPLMM estava processando.
zh_tw: 處理 splmm 檔時，已達到經歷時間上限。

# CDISP9078I
source: usage: {0} -h, --help | [-t, --time <time>] [-s, --size <size>] -f, --file <file> [<cmd-line-args>] -h, --help Get (this) usage information -t, --time <time> The timeout value in seconds -s, --size <size> The maximum size of the generated spl file -f, --file <file> The code generator to run <cmd-line-args> An optional set of arguments that are passed to the spl generator Runs an spl code generator with optional timeout and size limit.
de: Syntax: {0} -h, --help | [-t, --time <Zeit>] [-s, --size <Größe>] -f, --file <Datei> [<Befehlszeilenargumente>] -h, --help (Diese) Syntaxinformationen abrufen -t, --time <Zeit> Zeitlimitwert in Sekunden -s, --size <Größe> Maximale Größe der generierten spl-Datei -f, --file <Datei> Auszuführender Codegenerator <Befehlszeilenargumente> Optionale Gruppe von Argumenten, die an den spl-Generator übergeben werden Führt einen spl-Codegenerator mit optionaler Zeitlimit- und Größenbegrenzung aus.
es: uso: {0} -h, --help | [-t, --time <time>] [-s, --size <size>] -f, --file <file> [<cmd-line-args>] -h, --help Obtener (esta) información de uso -t, --time <time> El valor de tiempo de espera en segundos -s, --size <size> El tamaño máximo del archivo spl generado -f, --file <file> El generador de códigos para ejecutar <cmd-line-args> Un conjunto de argumentos opcional que se pasan al generador spl Ejecuta un generador de códigos spl con un límite opcional de tiempo de espera y tamaño.
ko: 사용법: {0} -h, --help | [-t, --time <time>] [-s, --size <size>] -f, --file <file> [<cmd-line-args>] -h, --help 사용법 정보를 가져옵니다. -t, --time <time> 시간종료 값(초)입니다. -s, --size <size> 생성되는 sql 파일의 최대 크기입니다. -f, --file <file> 실행할 코드 생성 프로그램입니다. <cmd-line-args> spl 생성 프로그램에 전달되는 선택적 인수 세트입니다. 선택적 시간종료 및 크기 제한을 사용하여 spl 코드 생성 프로그램을 실행합니다.
pt_br: uso: {0} -h, --help | [-t, --time <time>] [-s, --size <size>] -f, --file <file> [<cmd-line-args>] -h, --help obtém (estas) informações de uso -t, --time <time> o valor de tempo limite em segundos -s, --size <size> o tamanho máximo do arquivo SPL gerado -f, --file <file> o gerador de código a ser executado <cmd-line-args> um conjunto opcional de argumentos que são transmitidos para o operador SPL Executa um gerador de código SPL com um tempo limite e um limite de tamanho opcionais.
zh_tw: 用法：{0} -h, --help | [-t, --time <time>] [-s, --size <size>] -f, --file <file> [<cmd-line-args>] -h, --help 取得（此）用法資訊 -t, --time <time> 逾時值（秒） -s, --size <size> 所產生之 SPL 檔的大小上限 -f, --file <file> 要執行的程式碼產生器 <cmd-line-args> 傳遞至 SPL 產生器的選用引數集 使用選用逾時值和大小限制來執行 SPL 程式碼產生器。

# CDISP9079I
source: usage: {0} -h, --help | [-s, --size <size>] -h, --help Get (this) usage information -s, --size <size> The maximum size of the output A filter that truncates the information read from STDIN based on size.
de: Syntax: {0} -h, --help | [-s, --size <Größe>] -h, --help (Diese) Syntaxinformationen abrufen -s, --size <Größe> Maximale Größe der Ausgabe Ein Filter, der die aus der Standardeingabe gelesenen Informationen auf der Basis der Größe abschneidet.
es: uso: {0} -h, --help | [-s, --size <size>] -h, --help Obtener (esta) información de uso -s, --size <size> El tamaño máximo de la salida Un filtro que trunca la información leída de STDIN basándose en el tamaño.
ko: 사용법: {0} -h, --help | [-s, --size <size>] -h, --help 사용법 정보를 가져옵니다. -s, --size <size> 출력의 최대 크기입니다. 크기에 따라 STDIN에서 읽은 정보를 자르는 필터입니다.
pt_br: uso: {0} -h, --help | [-s, --size <size>] -h, --help obtém (estas) informações de uso -s, --size <size> o tamanho máximo da saída um filtro que trunca as informações lidas a partir do STDIN baseado em tamanho.
zh_tw: 用法：{0} -h, --help | [-s, --size <size>] -h, --help 取得（此）用法資訊 -s, --size <size> 輸出的大小上限 一個過濾器，用於根據大小來截斷從 STDIN 中讀取的資訊。

# CDISP9080E
source: The file parameter is specified for the Split operator, but the key parameter missing.
de: Der Parameter ''file'' ist für den Operator ''Split'' angegeben, der Parameter ''key'' fehlt jedoch.
es: El parámetro de archivo se ha especificado para el operador de división, pero falta el parámetro de clave.
ko: Split 연산자에 대해 file 매개변수가 지정되었으나 key 매개변수가 누락되었습니다.
pt_br: O parâmetro de arquivo está especificado para o operador de divisão, mas o parâmetro de chave está ausente.
zh_tw: 對「分割」運算子指定了 file 參數，但卻遺漏了 key 參數。

# CDISP9081E
source: The key parameter is specified for the Split operator but the file parameter missing.
de: Der Parameter ''key'' ist für den Operator ''Split'' angegeben, der Parameter ''file'' fehlt jedoch.
es: El parámetro de clave se ha especificado para el operador de división, pero falta el parámetro de archivo.
ko: Split 연산자에 대해 key 매개변수가 지정되었으나 file 매개변수가 누락되었습니다.
pt_br: O parâmetro de chave está especificado para o operador de divisão, mas o parâmetro de arquivo está ausente.
zh_tw: 對「分割」運算子指定了 key 參數，但卻遺漏了 file 參數。

# CDISP9082E
source: The file and index parameters for the Split operator are mutually exclusive.
de: Die Parameter ''file'' und ''index'' für den Operator ''Split'' schließen sich gegenseitig aus.
es: Los parámetros de archivo e índice para el operador de división se excluyen mutuamente.
ko: Split 연산자의 file 매개변수와 index 매개변수는 상호 배타적입니다.
pt_br: Os parâmetros de arquivo e de índice para o operador de divisão são mutuamente exclusivos.
zh_tw: 「分割」運算子的 file 參數與 index 參數互斥。

# CDISP9083E
source: The schema at output port number {0,number,0} must match the schema at input port number {1,number,0}.
de: Das Schema an der Ausgabeportnummer {0,number,0} muss mit dem Schema an der Eingabeportnummer {1,number,0} übereinstimmen.
es: El esquema en el número de puerto de salida {0,número,0} debe coincidir con el esquema en el número de puerto de entrada {1,número,0}.
ko: 출력 포트 번호 {0,number,0}의 스키마는 입력 포트 번호 {1,number,0}의 스키마와 일치해야 합니다.
pt_br: O esquema no número da porta de saída {0,number,0} deve corresponder ao esquema no número da porta de entrada {1,number,0}.
zh_tw: 輸出埠號 {0,number,0} 處的綱目必須與輸入埠號 {1,number,0} 處的綱目相符。

# CDISP9084E
source: The type of the {0} index expression must be one of the following types: int32/uint32/int64/uint64/list<int32>/list<uint32>/list<int64>/list<uint64>.
de: Der Typ des Indexausdrucks {0} muss einer der folgenden Typen sein: int32/uint32/int64/uint64/list<int32>/list<uint32>/list<int64>/list<uint64>.
es: El tipo de la expresión de índice {0} debe ser de uno de los tipos siguientes: int32/uint32/int64/uint64/list<int32>/list<uint32>/list<int64>/list<uint64>.
ko: {0} index 표현식의 유형은 다음 유형 중 하나여야 합니다: int32/uint32/int64/uint64/list<int32>/list<uint32>/list<int64>/list<uint64>.
pt_br: O tipo da expressão de índice {0} deve ser um dos seguintes: int32/uint32/int64/uint64/list<int32>/list<uint32>/list<int64>/list<uint64>.
zh_tw: {0} 索引表示式的類型必須是下列其中一種類型：int32/uint32/int64/uint64/list<int32>/list<uint32>/list<int64>/list<uint64>。

# CDISP9085E
source: The Split operator must use either the index or the file parameter.
de: Der Operator ''Split'' muss entweder den Parameter ''index'' oder den Parameter ''file'' verwenden.
es: El operador de división debe utilizar el parámetro de índice o de archivo.
ko: Split 연산자는 index 또는 file 매개변수 중 하나를 사용해야 합니다.
pt_br: O operador de divisão deve usar o parâmetro de índice ou de arquivo.
zh_tw: 「分割」運算子必須使用 index 參數或 file 參數。

# CDISP9086E
source: The {0} file cannot be renamed to be {1}.
de: Die Datei {0} kann nicht in {1} umbenannt werden.
es: El archivo {0} no se puede renombrar a {1}.
ko: {0} 파일은 {1}(으)로 이름을 바꿀 수 없습니다.
pt_br: O arquivo {0} não pode ser renomeado para {1}.
zh_tw: 無法將 {0} 檔重新命名為 {1}。

# CDISP9087E
source: The {0} file cannot be removed.
de: Die Datei {0} kann nicht entfernt werden.
es: El archivo {0} no se puede eliminar.
ko: {0} 파일을 제거할 수 없습니다.
pt_br: O arquivo {0} não pode ser removido.
zh_tw: 無法移除 {0} 檔。

# CDISP9088E
source: An attempt to create a temporary file failed.
de: Ein Versuch, eine temporäre Datei zu erstellen, ist fehlgeschlagen.
es: Ha fallado un intento para crear un archivo temporal.
ko: 임시 파일 작성 시도가 실패했습니다.
pt_br: Uma tentativa de criar um arquivo temporário falhou.
zh_tw: 嘗試建立暫存檔失敗。

# CDISP9089E
source: The {0} value is not valid for the {1} option.
de: Der Wert {0} ist für die Option {1} nicht gültig.
es: El valor {0} no es válido para la opción {1}.
ko: {0} 값이 {1} 옵션에 대해 유효하지 않습니다.
pt_br: O valor {0} não é válido para a opção {1}.
zh_tw: {0} 值不適用於 {1} 選項。

# CDISP9090E
source: Either the name or the port parameter must be specified for the {0} operator.
de: Entweder der Parameter ''name'' oder der Parameter ''port'' muss für den Operator {0} angegeben werden.
es: Se debe especificar el parámetro de nombre o de puerto para el operador {0}.
ko: {0} 연산자는 name 또는 port 매개변수 중 하나를 지정해야 합니다.
pt_br: O parâmetro de nome ou de porta deve ser especificado para o operador {0}.
zh_tw: 必須對 {0} 運算子指定 name 參數或 port 參數。

# CDISP9091E
source: The interface parameter is valid only when the address or the name parameter is specified.
de: Der Parameter ''interface'' ist nur gültig, wenn der Parameter ''address'' oder der Parameter ''name'' angegeben ist.
es: El parámetro de interfaz solo es válido cuando se especifica el parámetro de dirección o de nombre.
ko: interface 매개변수는 address 또는 name 매개변수가 지정된 경우에만 유효합니다.
pt_br: O parâmetro de interface é válido somente quando o parâmetro de endereço ou de nome for especificado.
zh_tw: 僅當指定了 address 參數或 name 參數時，interface 參數才有效。

# CDISP9092E
source: The {0} script cannot run.
de: Das Script {0} kann nicht ausgeführt werden.
es: El script {0} no se puede ejecutar.
ko: {0} 스크립트를 실행할 수 없습니다.
pt_br: O script {0} não pode ser executado.
zh_tw: 無法執行 {0} Script。

# CDISP9093I
source: usage: {0} -h, --help | -o, --outfile <file> -h, --help Get (this) usage information -o, --outfile <file> The file to format. Formats the specified source file using uncrustify.
de: Syntax: {0} -h, --help | -o, --outfile <Datei> -h, --help (Diese) Syntaxinformationen abrufen -o, --outfile <Datei> Die zu formatierende Datei. Formatiert die angegebene Quellendatei mithilfe von uncrustify.
es: uso: {0} -h, --help | -o, --outfile <file> -h, --help Obtener (esta) información de uso -o, --outfile <file> El archivo para formatear. Formatea el archivo de origen especificado utilizando uncrustify.
ko: 사용법: {0} -h, --help | -o, --outfile <file> -h, --help 사용법 정보를 가져옵니다. -o, --outfile <file> 형식화할 파일입니다. uncrustify를 사용하여 지정된 소스 파일을 형식화합니다.
pt_br: uso: {0} -h, --help | -o, --outfile <file> -h, --help obtém (estas) informações de uso -o, --outfile <file> o arquivo para formatar. Formata o arquivo de origem especificado usando uncrustify.
zh_tw: 用法：{0} -h, --help | -o, --outfile <file> -h, --help 取得（此）用法資訊 -o, --outfile <file> 要格式化的檔案。 使用 uncrustify 來格式化指定的原始檔。

# CDISP9094W
source: The {0} code formatter was not found. The compilation will continue without formatting the code.
de: Das Codeformatierungsprogramm {0} wurde nicht gefunden. Die Kompilierung wird fortgesetzt, ohne den Code zu formatieren.
es: El formateador de código {0} no se ha encontrado. La compilación continuará sin formatear el código.
ko: {0} 코드 포맷터를 찾지 못했습니다. 코드를 포맷팅하지 않고 컴파일이 계속됩니다.
pt_br: O formatador de código {0} não foi localizado. A compilação continuará sem formatar o código.
zh_tw: 找不到 {0} 程式碼格式製作程式。編譯將繼續，但不格式化程式碼。

# CDISP9095E
source: The {0} window property value that is specified for the {1} key is unknown.
de: Der Fenstereigenschaftswert {0}, der für den Schlüssel {1} angegeben ist, ist unbekannt.
es: El valor de la propiedad de ventana {0} que se ha especificado para la clave {1} es desconocido.
ko: {1} 키에 대해 지정된 {0} 창 특성 값이 알 수 없는 값입니다.
pt_br: O valor da propriedade de janela {0} que foi especificado para a chave {1} é desconhecido.
zh_tw: 對 {1} 索引鍵指定的 {0} 視窗內容值不明。
