Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0168E
source: The applicationName parameter is missing from a name-based streamId import.
de: Der Parameter applicationName fehlt in einem namensbasierten streamId-Import.
es: Falta el parámetro applicationName en una importación streamId basada en nombre.
ko: 이름 기반 streamId 임포트에서 applicationName 매개변수가 누락되었습니다.
pt_br: O parâmetro applicationName requer uma importação de streamId baseada em nome.
zh_tw: 名稱型 streamId 匯入中遺漏了 applicationName 參數。

# CDISP0169W
source: The compiler ignores an applicationName parameter in an import that is not name-based.
de: Der Compiler ignoriert einen Parameter applicationName in einem Import, der nicht namensbasiert ist.
es: El compilador ignora un parámetro applicationName en una importación que no se basa en el nombre.
ko: 컴파일러가 이름 기반이 아닌 임포트의 applicationName 매개변수를 무시합니다.
pt_br: O compilador ignora um parâmetro applicationName em uma importação que não é baseada em nome.
zh_tw: 編譯器忽略了非名稱型匯入中的 applicationName 參數。

# CDISP0170E
source: The {0} expression in the subscription is not valid.
de: Der Ausdruck {0} in der Subskription ist nicht gültig.
es: La expresión {0} de la suscripción no es válida.
ko: subscription의 {0} 표현식이 유효하지 않습니다.
pt_br: A expressão {0} na assinatura não é válida.
zh_tw: 訂閱中的 {0} 表示式無效。

# CDISP0171E
source: The subscription expression expects a literal, but the following expression is specified instead: {0}.
de: Der Subskriptionsausdruck erwartet ein Literal, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La expresión de la suscripción espera un literal, pero en su lugar se ha especificado la expresión siguiente: {0}.
ko: subscription 표현식에서 리터럴을 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: A expressão de assinatura espera um literal, mas a expressão a seguir foi especificada: {0}.
zh_tw: subscription 表示式預期文字，但卻指定了下列表示式：{0}。

# CDISP0172E
source: The subscription expression expects an identifier, but the following expression is specified instead: {0}.
de: Der Subskriptionsausdruck erwartet eine Kennung, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La expresión de suscripción espera un identificador, pero en su lugar se ha especificado la expresión siguiente: {0}.
ko: subscription 표현식에서 ID를 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: A expressão de assinatura espera um identificador, mas a expressão a seguir foi especificada: {0}.
zh_tw: subscription 表示式預期 ID，但卻指定了下列表示式：{0}。

# CDISP0173E
source: The subscription expression expects a literal of rstring, int64 or float64 type, but the following expression is specified instead: {0}.
de: Der Subskriptionsausdruck erwartet ein Literal des Typs rstring, int64 oder float64, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La expresión de suscripción espera un literal del tipo rstring, int64 o float64, pero en su lugar se especifica la expresión siguiente: {0}.
ko: subscription 표현식에서 rstring, int64 또는 float64 유형의 리터럴을 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: A expressão de assinatura espera um literal do tipo rstring, int64 ou float64, mas a expressão a seguir foi especificada: {0}.
zh_tw: subscription 表示式預期 rstring、int64 或 float64 類型的文字，但卻指定了下列表示式：{0}。

# CDISP0174E
source: The subscription expression expects an integer literal, but the following expression is specified instead: {0}.
de: Der Subskriptionsausdruck erwartet ein ganzzahliges Literal, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La expresión de suscripción espera un literal entero, pero en su lugar se especifica la expresión siguiente: {0}.
ko: subscription 표현식에서 정수 리터럴을 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: A expressão de assinatura espera um número literal inteiro, mas a expressão a seguir foi especificada: {0}.
zh_tw: subscription 表示式預期整數文字，但卻指定了下列表示式：{0}。

# CDISP0175E
source: The export property expression expects a tuple literal, but the following expression is specified instead: {0}.
de: Der Exporteigenschaftsausdruck erwartet ein Tupelliteral, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La expresión de la propiedad de exportación espera un literal de tupla, pero en su lugar se especifica la expresión siguiente: {0}.
ko: 익스포트 특성 표현식에서 튜플 리터럴을 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: A expressão de propriedade de exportação espera um literal de tupla, mas a expressão a seguir foi especificada: {0}.
zh_tw: 匯出內容表示式預期值組文字，但卻指定了下列表示式：{0}。

# CDISP0176E
source: The export property expression expects an identifier, but the following expression is specified instead: {0}.
de: Der Exporteigenschaftsausdruck erwartet eine Kennung, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La expresión de la propiedad de exportación espera un identificador, pero en su lugar se especifica la expresión siguiente: {0}.
ko: 익스포트 특성 표현식에서 ID를 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: A expressão de propriedade de exportação espera um identificador, mas a expressão a seguir foi especificada: {0}.
zh_tw: 匯出內容表示式預期 ID，但卻指定了下列表示式：{0}。

# CDISP0177E
source: The property expression of an export expects a literal of the rstring, int64 or float64 type, or a list literal with these element types, but the following expression is specified instead: {0}.
de: Der Eigenschaftsausdruck eines Exports erwartet ein Literal des Typs rstring, int64 oder float64 oder ein Listenliteral mit diesen Elementtypen, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La expresión de propiedad de una exportación espera un literal del tipo rstring, int64 o float64, o un literal de lista con estos tipos de elemento, pero en su lugar se especifica la expresión siguiente: {0}.
ko: 익스포트의 특성 표현식에서 rstring, int64 또는 float64 유형의 리터럴, 또는 이러한 요소 유형을 포함하는 목록 리터럴을 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: A expressão de propriedade de uma exportação espera um literal do tipo rstring, int64 ou float64 ou um literal de lista com esses tipos de elementos, mas a expressão a seguir foi especificada: {0}.
zh_tw: 匯出的內容表示式預期 rstring、int64 或 float64 類型的文字或者具有這些元素類型的文字清單，但卻指定了下列表示式：{0}。

# CDISP0178E
source: The following stream is exported multiple times: {0}.
de: Der folgende Datenstrom wird mehrmals exportiert: {0}.
es: La secuencia siguiente se ha exportado varias veces: {0}.
ko: 다음 스트림이 여러 번 익스포트되었습니다: {0}.
pt_br: O fluxo a seguir é exportado múltiplas vezes: {0}.
zh_tw: 下列串流已多次匯出：{0}。

# CDISP0179E
source: The export of the following imported stream is not valid: {0}.
de: Der Export des folgenden importierten Datenstroms ist nicht gültig: {0}.
es: La exportación de la secuencia importada siguiente no es válida: {0}.
ko: 다음 임포트된 스트림의 익스포트가 유효하지 않습니다: {0}.
pt_br: A exportação do seguinte fluxo importado não é válida: {0}.
zh_tw: 下列已匯入串流的匯出無效：{0}。

# CDISP0180E
source: An error occurred while the operator model was loading. The error is: {0}
de: Beim Laden des Operatormodells ist ein Fehler aufgetreten. Fehler: {0}
es: Se ha producido un error mientras se cargaba el modelo de operador. El error es: {0}
ko: 연산자 모델이 로드되는 중에 오류가 발생했습니다. 오류는 {0}입니다.
pt_br: Ocorreu um erro enquanto o modelo do operador estava carregando. O erro é: {0}
zh_tw: 載入運算子模型時發生錯誤。錯誤為：{0}

# CDISP0181E
source: The parameter expects a compile time expression of the {0} type, but the following expression is specified instead: {1}.
de: Der Parameter erwartet einen Kompilierzeitausdruck des Typs {0}, aber stattdessen wurde der folgende Ausdruck angegeben: {1}.
es: El parámetro espera una expresión de tiempo de compilación del tipo {0}, pero en su lugar se especifica la expresión siguiente: {1}.
ko: 매개변수에서 {0} 유형의 컴파일 시간 표현식을 기대했으나 대신 다음 표현식이 지정되었습니다: {1}.
pt_br: O parâmetro espera uma expressão de tempo de compilação do tipo {0}, mas a expressão a seguir foi especificada: {1}.
zh_tw: 該參數預期 {0} 類型的編譯時期表示式，但卻指定了下列表示式：{1}。

# CDISP0182E
source: The parameter expects an expression with one of the values in the following list: {0}. The following expression is specified instead: {1}.
de: Der Parameter erwartet einen Ausdruck mit einem der Werte in der folgenden Liste: {0}. Stattdessen wurde der folgende Ausdruck angegeben: {1}.
es: El parámetro espera una expresión con uno de los valores de la lista siguiente: {0}. La expresión siguiente se ha especificado en su lugar: {1}.
ko: 매개변수에서 다음 목록에 있는 값 중 하나를 포함하는 표현식을 기대했습니다: {0}. 대신 다음 표현식이 지정되었습니다: {1}.
pt_br: O parâmetro espera uma expressão com um dos valores na lista a seguir: {0}. A expressão a seguir foi especificada: {1}.
zh_tw: 該參數預期一個具有以下清單內其中一個值的表示式：{0}。但卻指定了下列表示式：{1}。

# CDISP0183E
source: The following host pool expression is not valid: {0}.
de: Der folgende Host-Pool-Ausdruck ist nicht gültig: {0}.
es: La expresión de agrupación de hosts siguientes no es válida: {0}.
ko: 다음 호스트 풀 표현식이 유효하지 않습니다: {0}.
pt_br: A expressão do conjunto de hosts a seguir não é válida: {0}.
zh_tw: 下列主機儲存區表示式無效：{0}。

# CDISP0184E
source: The following placement expression is not valid: {0}.
de: Der folgende Verteilungsausdruck ist nicht gültig: {0}.
es: La expresión de colocación siguiente no es válida: {0}.
ko: 다음 배치 표현식이 유효하지 않습니다: {0}.
pt_br: A expressão de posicionamento a seguir não é válida: {0}.
zh_tw: 下列放置表示式無效：{0}。

# CDISP0185E
source: The config placement expects a string, but the following expression is specified instead: {0}.
de: ''config placement'' erwartet eine Zeichenfolge, aber stattdessen wurde der folgende Ausdruck angegeben: {0}.
es: La colocación de configuración espera una serie, pero en su lugar se ha especificado la expresión siguiente: {0}.
ko: config placement에서 문자열을 기대했으나 대신 다음 표현식이 지정되었습니다: {0}.
pt_br: O posicionamento de configuração espera uma sequência, mas a expressão a seguir foi especificada: {0}.
zh_tw: 配置放置預期字串，但卻指定了下列表示式：{0}。

# CDISP0186E
source: The config clause contains multiple host placements.
de: Die Klausel ''config'' enthält mehrere Hostverteilungen.
es: La cláusula de config contiene varias colocaciones de host.
ko: config 절에 여러 호스트 배치가 포함되어 있습니다.
pt_br: A cláusula de configuração contém múltiplos posicionamentos de host.
zh_tw: config 子句包含多個主機放置。

# CDISP0187E
source: The "Nonexistent" expression mode in the {0} parameter is not valid.
de: Der Ausdrucksmodus "Nonexistent" im Parameter {0} ist nicht gültig.
es: La modalidad de expresión "Nonexistent" en el parámetro {0} no es válida.
ko: {0} 매개변수의 "Nonexistent" 표현식 모드가 유효하지 않습니다.
pt_br: O modo de expressão "Nonexistent" no parâmetro {0} não é válido.
zh_tw: {0} 參數中的 "Nonexistent" 表示式模式無效。

# CDISP0188E
source: An operator with more than one input port cannot specify a punctuation preserving output port without also specifying the window punctuation port.
de: Ein Operator mit mehreren Eingabeports kann keinen Ausgabeport angeben, der Punktuation beibehält, ohne auch den Fensterpunktuationsport anzugeben.
es: Un operador con más de un puerto de entrada no puede especificar una puntuación que conserva el puerto de salida, sin especificar también el puerto de puntuación de ventana.
ko: 둘 이상의 입력 포트가 있는 연산자는 창 구두점 포트를 지정하지 않는 한 구두점 유지 출력 포트를 지정할 수 없습니다.
pt_br: Um operador com mais de uma porta de entrada não pode especificar uma porta de saída que preserva a pontuação sem também especificar a porta de pontuação de janela.
zh_tw: 具有多個輸入埠的運算子如果不同時指定視窗標點符號埠，則無法指定負責保留輸出埠的標點符號。

# CDISP0189E
source: An unknown custom literal type of {0} is specified for the {1} parameter.
de: Der unbekannte angepasste Literaltyp {0} ist für den Parameter {1} angegeben.
es: Se ha especificado un tipo de literal personalizado desconocido de {0} para el parámetro {1}.
ko: 알 수 없는 사용자 정의 리터럴 유형인 {0}이(가) {1} 매개변수에 대해 지정되었습니다.
pt_br: Um tipo literal customizado desconhecido de {0} está especificado para o parâmetro {1}.
zh_tw: 為 {1} 參數指定了不明的自訂文字類型 {0}。

# CDISP0190E
source: An unknown custom output function type of {0} is specified in an output port.
de: Der unbekannte angepasste Ausgabefunktionstyp {0} ist in einem Ausgabeport angegeben.
es: Se ha especificado un tipo de función de salida personalizada de {0} en un puerto de salida.
ko: 알 수 없는 사용자 정의 출력 함수 유형인 {0}이(가) 출력 포트에 지정되었습니다.
pt_br: Um tipo de função de saída customizado desconhecido de {0} está especificado em uma porta de saída.
zh_tw: 在輸出埠中指定了不明的自訂輸出函數類型 {0}。

# CDISP0191E
source: The {0} custom literal type is defined multiple times.
de: Der angepasste Literaltyp {0} ist mehrmals definiert.
es: El tipo de literal personalizado {0} está definido varias veces.
ko: {0} 사용자 정의 리터럴 유형이 여러 번 정의되었습니다.
pt_br: O tipo de literal customizado {0} é definido múltiplas vezes.
zh_tw: {0} 自訂文字類型已定義多次。

# CDISP0192E
source: The {0} custom output function type is defined multiple times.
de: Der angepasste Ausgabefunktionstyp {0} ist mehrmals definiert.
es: El tipo de función de salida personalizada {0} está definido varias veces.
ko: {0} 사용자 정의 출력 함수 유형이 여러 번 정의되었습니다.
pt_br: O tipo de função de saída customizado {0} é definido múltiplas vezes.
zh_tw: {0} 自訂輸出函數類型已定義多次。

# CDISP0193E
source: An optional input port set is followed by a non-optional one.
de: Auf eine optionale Eingabeportgruppe folgt eine nicht optionale Eingabeportgruppe.
es: Un conjunto de puertos de entrada opcional está seguido por uno no opcional.
ko: 선택적 입력 포트 세트 뒤에 비선택적 포트 세트가 있습니다.
pt_br: Um conjunto de portas de entrada opcional é seguido por um não opcional.
zh_tw: 一個選用輸入埠集後跟一個非選用輸入埠集。

# CDISP0194E
source: An optional output port set is followed by a non-optional one.
de: Auf eine optionale Ausgabeportgruppe folgt eine nicht optionale Ausgabeportgruppe.
es: Un conjunto de puertos de salida opcional está seguido por uno no opcional.
ko: 선택적 출력 포트 세트 뒤에 비선택적 포트 세트가 있습니다.
pt_br: Um conjunto de portas de saída opcional é seguido por um não opcional.
zh_tw: 一個選用輸出埠集後跟一個非選用輸出埠集。

# CDISP0195E
source: The output port expression mode cannot be set to CustomLiteral.
de: Der Ausdrucksmodus des Ausgabeports kann nicht auf ''CustomLiteral'' gesetzt werden.
es: La modalidad de expresión del puerto de salida no se puede establecer en CustomLiteral.
ko: 출력 포트 표현식 모드는 CustomLiteral로 설정할 수 없습니다.
pt_br: O modo de expressão de porta de saída não pode ser configurado para CustomLiteral.
zh_tw: 無法將輸出埠表示式模式設為 CustomLiteral。

# CDISP0196E
source: The output port expression mode cannot be set to Constant if auto-assignment is specified.
de: Der Ausdrucksmodus des Ausgabeports kann nicht auf ''Constant'' gesetzt werden, wenn automatische Zuweisung angegeben wird.
es: La modalidad de expresión de puerto de salida no se puede establecer en Constant, si se ha especificado la asignación automática.
ko: 자동 지정이 지정된 경우에는 출력 포트 표현식 모드를 Constant로 설정할 수 없습니다.
pt_br: O modo de expressão de porta de saída não poderá ser configurado para Constante, se a designação automática estiver especificada.
zh_tw: 如果指定了自動指派，則無法將輸出埠表示式模式設為 Constant。

# CDISP0197E
source: The unknown default output function {0} is specified in an output port.
de: Die unbekannte Standardausgabefunktion {0} ist in einem Ausgabeport angegeben.
es: Se ha especificado la función de salida predeterminada desconocida {0} en un puerto de salida.
ko: 알 수 없는 기본 출력 함수 {0}이(가) 출력 포트에 지정되었습니다.
pt_br: A função de saída padrão desconhecida {0} está especificada em uma porta de saída.
zh_tw: 在輸出埠中指定了不明的預設輸出函數 {0}。

# CDISP0198E
source: The following fusion mode option is unknown: {0}.
de: Die folgende Fusionsmodusoption ist unbekannt: {0}.
es: La opción de modalidad de fusión siguiente es desconocida: {0}.
ko: 다음 연합 모드 옵션은 알 수 없는 옵션입니다: {0}.
pt_br: A opção de modo de fusão a seguir é desconhecida: {0}.
zh_tw: 下列融合模式選項不明：{0}。

# CDISP0199E
source: The following transport option is not known: {0}.
de: Die folgende Transportoption ist nicht bekannt: {0}.
es: La opción de transporte siguiente no se conoce: {0}.
ko: 다음 전송 옵션이 알려지지 않았습니다: {0}.
pt_br: A opção de transporte a seguir não é conhecida: {0}.
zh_tw: 下列傳輸選項不明：{0}。

# CDISP0200E
source: The {1} input transport for the {0} operator does not match the {3} output transport for the {2} operator, but they are connected.
de: Der Eingabetransport {1} für den Operator {0} stimmt nicht mit dem Ausgabetransport {3} für den Operator {2} überein, sie sind jedoch verbunden.
es: El transporte de entrada {1} para el operador {0} no coincide con el transporte de salida {3} para el operador {2}, pero están conectados.
ko: {0} 연산자의 {1} 입력 전송이 {2} 연산자의 {3} 출력 전송과 일치하지 않지만 연결되어 있습니다.
pt_br: O transporte de entrada {1} para o operador {0} não corresponde ao transporte de saída {3} para o operador {2}, mas eles estão conectados.
zh_tw: {0} 運算子的 {1} 輸入傳輸與 {2} 運算子的 {3} 輸出傳輸不符，但這兩者卻已連接。

# CDISP0201E
source: The {1} input transport for the {0} operator does not match the {3} output transport for the {2} operator, but they are located in the same partition.
de: Der Eingabetransport {1} für den Operator {0} stimmt nicht mit dem Ausgabetransport {3} für den Operator {2} überein, sie befinden sich jedoch in derselben Partition.
es: El transporte de entrada {1} para el operador {0} no coincide con el transporte de salida {3} para el operador {2}, pero se encuentran en la misma partición.
ko: {0} 연산자의 {1} 입력 전송이 {2} 연산자의 {3} 출력 전송과 일치하지 않지만 서로 같은 파티션에 위치해 있습니다.
pt_br: O transporte de entrada {1} para o operador {0} não corresponde ao transporte de saída {3} para o operador {2}, mas eles estão localizados na mesma partição.
zh_tw: {0} 運算子的 {1} 輸入傳輸與 {2} 運算子的 {3} 輸出傳輸不符，但這兩者卻位於同一分割區中。

# CDISP0202E
source: The {1} output transport for the {0} operator does not match the {3} output transport for the {2} operator, but they are located on the same partition.
de: Der Ausgabetransport {1} für den Operator {0} stimmt nicht mit dem Ausgabetransport {3} für den Operator {2} überein, sie befinden sich jedoch in derselben Partition.
es: El transporte de salida {1} para el operador {0} no coincide con el transporte de salida {3} para el operador {2}, pero se encuentran en la misma partición.
ko: {0} 연산자의 {1} 출력 전송이 {2} 연산자의 {3} 출력 전송과 일치하지 않지만 서로 같은 파티션에 위치해 있습니다.
pt_br: O transporte de saída {1} para o operador {0} não corresponde ao transporte de saída {3} para o operador {2}, mas eles estão localizados na mesma partição.
zh_tw: {0} 運算子的 {1} 輸出傳輸與 {2} 運算子的 {3} 輸出傳輸不符，但這兩者卻位於同一分割區中。

# CDISP0203E
source: The number of input ports in the {0} operator does not match the number that is specified by the operator model.
de: Die Anzahl der Eingabeports im Operator {0} stimmt nicht mit der Anzahl überein, die durch das Operatormodell angegeben wird.
es: El número de puertos de entrada en el operador {0} no coincide con el número especificado por el modelo de operador.
ko: {0} 연산자의 입력 포트 수가 연산자 모델에 의해 지정된 수와 일치하지 않습니다.
pt_br: O número de portas de entrada no operador {0} não corresponde ao número que está especificado pelo modelo do operador.
zh_tw: {0} 運算子中的輸入埠數目與透過運算子模型指定的數目不符。

# CDISP0204E
source: The number of output ports in the {0} operator does not match the number that is specified by the operator model.
de: Die Anzahl der Ausgabeports im Operator {0} stimmt nicht mit der Anzahl überein, die durch das Operatormodell angegeben wird.
es: El número de puertos de salida en el operador {0} no coincide con el número especificado por el modelo de operador.
ko: {0} 연산자의 출력 포트 수가 연산자 모델에 의해 지정된 수와 일치하지 않습니다.
pt_br: O número de portas de saída no operador {0} não corresponde ao número que está especificado pelo modelo do operador.
zh_tw: {0} 運算子中的輸出埠數目與透過運算子模型指定的數目不符。

# CDISP0205E
source: The correct number of attribute assignments, which is specified by the operator model, is not specified for output port number {0,number,0} in the {1} operator.
de: Die richtige Anzahl Attributzuweisungen, die durch das Operatormodell angegeben wird, ist für die Ausgabeportnummer {0,number,0} im Operator {1} nicht angegeben.
es: El número correcto de asignaciones de atributos, que se especifica mediante el modelo de operador, no se ha especificado para el número de puerto de salida {0,número,0} en el operador {1}.
ko: 연산자 모델에 의해 지정되는 올바른 속성 지정 수가 {1} 연산자의 출력 포트 번호 {0,number,0}에 대해 지정되지 않았습니다.
pt_br: O número correto de designações de atributo, que é especificado pelo modelo do operador, não está especificado para o número da porta de saída {0,number,0} no operador {1}.
zh_tw: 未對 {1} 運算子中的輸出埠號 {0,number,0} 指定正確的屬性指派數目（透過運算子模型進行指定）。

# CDISP0206E
source: An assignment cannot be generated for the {0} attribute of output port number {1,number,0} in the {2} operator.
de: Eine Zuweisung kann für das Attribut {0} der Ausgabeportnummer {1,number,0} im Operator {2} nicht generiert werden.
es: No se puede generar una asignación para el atributo {0} del número de puerto de salida {1,número,0} en el operador {2}.
ko: {2} 연산자의 출력 포트 번호 {1,number,0}의 {0} 속성에 대해 지정을 생성할 수 없습니다.
pt_br: Uma designação não pode ser gerada para o atributo {0} de número de porta de saída {1,number,0} no operador {2}.
zh_tw: 無法對 {2} 運算子中輸出埠號 {1,number,0} 的 {0} 屬性產生指派。

# CDISP0207E
source: The {0} parameter is not allowed for the {1} operator.
de: Der Parameter {0} ist für den Operator {1} nicht zulässig.
es: El parámetro {0} no está permitido para el operador {1}.
ko: {0} 매개변수는 {1} 연산자에 대해 허용되지 않습니다.
pt_br: O parâmetro {0} não é permitido para o operador {1}.
zh_tw: {1} 運算子不接受 {0} 參數。

# CDISP0208E
source: The {0} parameter is required by the operator model for the {1} operator, but is not found.
de: Der Parameter {0} wird vom Operatormodell für den Operator {1} benötigt, wurde jedoch nicht gefunden.
es: El parámetro {0} es necesario para el modelo de operador para el operador {1}, pero no se ha encontrado.
ko: {1} 연산자의 연산자 모델에서 {0} 매개변수를 필요로 하지만 이를 찾을 수 없습니다.
pt_br: O parâmetro {0} é necessário pelo modelo do operador para o operador {1}, mas não foi localizado.
zh_tw: {1} 運算子的運算子模型需要 {0} 參數，但卻找不到該參數。

# CDISP0213E
source: The {0} value of the {1} parameter is not an attribute. The operator model for the {2} operator expects a value that is an input attribute.
de: Der Wert {0} des Parameters {1} ist kein Attribut. Das Operatormodell für den Operator {2} erwartet einen Wert, der ein Eingabeattribut ist.
es: El valor {0} del parámetro {1} no es un atributo. El modelo de operador para el operador {2} espera un valor que es un atributo de entrada.
ko: {1} 매개변수의 {0} 값이 속성이 아닙니다. {2} 연산자의 연산자 모델에서는 입력 속성인 값을 기대하고 있습니다.
pt_br: O valor {0} do parâmetro {1} não é um atributo. O modelo do operador para o operador {2} espera um valor que seja um atributo de entrada.
zh_tw: {1} 參數的 {0} 值不是屬性。{2} 運算子的運算子模型所預期的值是一個輸入屬性。

# CDISP0216E
source: The {0} value of the {1} parameter is not a constant expression. The operator model for the {2} operator expects a compile time literal value.
de: Der Wert {0} des Parameters {1} ist kein konstanter Ausdruck. Das Operatormodell für den Operator {2} erwartet einen Kompilierzeitliteralwert.
es: El valor {0} del parámetro {1} no es una expresión constante. El modelo de operador para el operador {2} espera un valor de literal de tiempo de compilación.
ko: {1} 매개변수의 {0} 값이 상수식이 아닙니다. {2} 연산자의 연산자 모델에서는 컴파일 시간 리터럴 값을 기대하고 있습니다.
pt_br: O valor {0} do parâmetro {1} não é uma expressão constante. O modelo do operador para o operador {2} espera um valor literal de tempo de compilação.
zh_tw: {1} 參數的 {0} 值不是常數表示式。{2} 運算子的運算子模型預期一個編譯時期文字值。

# CDISP0217E
source: The {0} assignment is not a constant expression. The operator model for the {1} operator expects a compile time literal value.
de: Die Zuweisung {0} ist kein konstanter Ausdruck. Das Operatormodell für den Operator {1} erwartet einen Kompilierzeitliteralwert.
es: La asignación {0} no es una expresión constante. El modelo de operador para el operador {1} espera un valor de literal de tiempo de compilación.
ko: {0} 지정이 상수식이 아닙니다. {1} 연산자의 연산자 모델에서는 컴파일 시간 리터럴 값을 기대하고 있습니다.
pt_br: A designação de tarefa {0} não é uma expressão de constante. O modelo do operador para o operador {1} espera um valor literal de tempo de compilação.
zh_tw: {0} 指派不是常數表示式。{1} 運算子的運算子模型預期一個編譯時期文字值。
