Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0000E
source: The following message cannot be loaded: {0}. Contact IBM Software Support.
de: Die folgende Nachricht kann nicht geladen werden: {0}. Wenden Sie sich an den IBM Software Support.
es: No se puede cargar el mensaje siguiente: {0}. Póngase en contacto con el servicio de soporte de software de IBM.
ko: 다음 메시지를 로드할 수 없습니다: {0}. IBM 소프트웨어 지원 센터에 문의하십시오.
pt_br: A mensagem a seguir não pode ser carregada: {0}. Entre em contato com o Suporte de Software IBM.
zh_tw: 無法載入下列訊息：{0}。請與「IBM 軟體支援中心」聯絡。

# CDISP0001E
source: The SPL program did not compile.
de: Das SPL-Programm wurde nicht kompiliert.
es: El programa SPL no ha compilado.
ko: SPL 프로그램이 컴파일되지 않았습니다.
pt_br: O programa SPL não compilou.
zh_tw: SPL 程式未編譯。

# CDISP0002E
source: The {0} main composite exists in the following toolkits: {1} and {2}.
de: Das Hauptverbundelement {0} ist in den folgenden Toolkits vorhanden: {1} und {2}.
es: Existe el {0} compuesto principal en los kits de herramientas siguientes: {1} y {2}.
ko: {0} 기본 복합이 다음 툴킷에 존재합니다: {1} 및 {2}.
pt_br: O composto principal {0} existe nos kits de ferramentas a seguir: {1} e {2}.
zh_tw: {0} 主要複合項存在於以下工具箱中：{1} 和 {2}。

# CDISP0003I
source: Run the spl-make-toolkit command on the toolkits that are out of date.
de: Führen Sie den Befehl spl-make-toolkit für veraltete Toolkits aus.
es: Ejecute el mandato spl-make-toolkit en los kits de herramientas que están obsoletos.
ko: 최신 상태가 아닌 툴킷에서 spl-make-toolkit 명령을 실행하십시오.
pt_br: Execute o comando spl-make-toolkit nos kits de ferramentas que estiverem desatualizados.
zh_tw: 對不是最新的工具箱執行 spl-make-toolkit 指令。

# CDISP0004E
source: The following internal compiler error occurred: AST parsing:
de: Der folgende interne Compilerfehler ist aufgetreten: AST-Parsing:
es: Se ha producido el error de compilador interno siguiente: análisis de AST:
pt_br: O erro do compilador interno a seguir ocorreu: análise de AST:
zh_tw: 發生下列內部編譯器錯誤：正在進行 AST 剖析：

# CDISP0005I
source: The toolkit.xml file in the {0} directory is out of date. The compiler will rebuild the toolkit by using the spl-make-toolkit command.
de: Die Datei toolkit.xml im Verzeichnis {0} ist veraltet. Der Compiler erstellt das Toolkit mithilfe des Befehls spl-make-toolkit erneut.
es: El archivo toolkit.xml del directorio {0} está obsoleto. El compilador recreará el kit de herramientas utilizando el mandato spl-make-toolkit.
ko: {0} 디렉토리에 있는 toolkit.xml 파일이 최신 상태가 아닙니다. 컴파일러가 spl-make-toolkit 명령을 사용하여 툴킷을 재빌드합니다.
pt_br: O arquivo toolkit.xml no diretório {0} está desatualizado. O compilador reconstruirá o kit de ferramentas usando o comando spl-make-toolkit.
zh_tw: {0} 目錄中的 toolkit.xml 檔不是最新的。編譯器將使用 spl-make-toolkit 指令來重建工具箱。

# CDISP0006I
source: Control the use of the pthread_yield() function in the SPL runtime. The valid values are yes, no, and auto.
de: Steuerung der Verwendung der Funktion pthread_yield() in der SPL-Laufzeit. Gültige Werte sind ''yes'', ''no'' und ''auto''.
es: Controle el uso de la función pthread_yield() en el tiempo de ejecución de SPL. Los valores válidos son sí, no y auto.
ko: SPL 런타임에서의 pthread_yield() 함수 사용을 제어합니다. 유효한 값은 yes, no 및 auto입니다.
pt_br: Controle o uso da função pthread_yield() no tempo de execução SPL. Os valores válidos são yes, no e auto.
zh_tw: 控制 pthread_yield() 函數在 SPL 執行時期中的使用。有效值為 yes、no 和 auto。

# CDISP0007E
source: The following avoid-runtime-yield option is not known: {0}.
de: Die folgende avoid-runtime-yield-Option ist nicht bekannt: {0}.
es: La opción avoid-runtime-yield siguiente no es conocida: {0}.
ko: 다음 avoid-runtime-yield 옵션이 알려지지 않았습니다: {0}.
pt_br: A opção avoid-runtime-yield a seguir não é conhecida: {0}.
zh_tw: 以下 avoid-runtime-yield 選項不明：{0}。

# CDISP0008E
source: A token is missing in the {0} of the SPL program. The token is {1}. The expected token is {2}.
de: In {0} des SPL-Programms fehlt ein Token. Token: {1}. Erwartetes Token: {2}.
es: Falta una señal en el {0} del programa SPL. La señal es {1}. La señal esperada es {2}.
ko: SPL 프로그램의 {0}에서 토큰이 누락되었습니다. 토큰이 {1}입니다. 기대된 토큰은 {2}입니다.
pt_br: Um token está ausente no {0} do programa SPL. O token é {1}. O token esperado é {2}.
zh_tw: SPL 程式的 {0} 中遺漏了某個記號。記號為 {1}。預期的記號為 {2}。

# CDISP0009E
source: A syntax error exists at the {0} token in {1}. A viable parsing alternative does not exist.
de: Beim Token {0} in {1} ist ein Syntaxfehler vorhanden. Es gibt keine funktionsfähige Parsing-Alternative.
es: Existe un error de sintaxis en la señal {0} en {1}. No existe una alternativa de análisis viable.
ko: {1}의 {0} 토큰에 구문 오류가 존재합니다. 적합한 구문 분석 대체가 존재하지 않습니다.
pt_br: Um erro de sintaxe existe no token {0} em {1}. Uma alternativa viável de análise não existe.
zh_tw: {1} 中的 {0} 記號存在語法錯誤。可用的剖析替代方案不存在。

# CDISP0010E
source: There are multiple connections between operator {0} input port {1,number,0} and operator {2} output port {3,number,0}.
de: Es gibt mehrere Verbindungen zwischen Operator {0} Eingabeport {1,number,0} und Operator {2} Ausgabeport {3,number,0}.
es: Existen varias conexiones entre el puerto de entada del operador {0} {1,número,0} y el puerto de salida del operador {2} {3,número,0}.
ko: 연산자 {0} 입력 포트 {1,number,0}과(와) 연산자 {2} 출력 포트 {3,number,0} 간에 여러 연결이 있습니다.
pt_br: Há múltiplas conexões entre o operador {0} na porta de entrada {1,number,0} e o operador {2} na porta de saída {3,number,0}.
zh_tw: 運算子 {0} 輸入埠 {1,number,0} 與運算子 {2} 輸出埠 {3,number,0} 之間有多個連線。

# CDISP0011E
source: A syntax error exists at the {0} token in {1}.
de: Beim Token {0} in {1} ist ein Syntaxfehler vorhanden.
es: Existe un error de sintaxis en la señal {0} en {1}.
ko: {1}의 {0} 토큰에 구문 오류가 존재합니다.
pt_br: Um erro de sintaxe existe no token {0} em {1}.
zh_tw: {1} 中的 {0} 記號存在語法錯誤。

# CDISP0012E
source: The token in {0} is not correct. The specified token is {1}. The required token is {2}.
de: Das Token in {0} ist nicht richtig. Das angegebene Token ist {1}. Das erforderliche Token ist {2}.
es: La señal en {0} no es correcta. La señal especificada es {1}. La señal necesaria es {2}.
ko: {0}의 토큰이 올바르지 않습니다. 지정된 토큰이 {1}입니다. 필요한 토큰은 {2}입니다.
pt_br: O token em {0} não está correto. O token especificado é {1}. O token necessário é {2}.
zh_tw: {0} 中的記號不正確。指定的記號是 {1}。所需的記號是 {2}。

# CDISP0013I
source: Specify the maximum length of filenames.
de: Maximale Länge von Dateinamen angeben.
es: Especifique la longitud máxima de nombres de archivo.
ko: 파일 이름의 최대 길이를 지정하십시오.
pt_br: Especifique o comprimento máximo dos nomes de arquivos.
zh_tw: 指定檔名的長度上限。

# CDISP0014E
source: An invalid length was specified for the --max-filename-length option.
de: Für die Option --max-filename-length wurde eine ungültige Länge angegeben.
es: Se ha especificado una longitud no válida para la opción --max-filename-length.
ko: --max-filename-length 옵션에 대해 유효하지 않은 길이가 지정되었습니다.
pt_br: Um comprimento inválido foi especificado para a opção --max-filename-length.
zh_tw: 對 --max-filename-length 選項指定的長度無效。

# CDISP0015E
source: The {0} port name is not valid.
de: Der Portname {0} ist nicht gültig.
es: El nombre de puerto {0} no es válido.
ko: {0} 포트 이름이 유효하지 않습니다.
pt_br: O nome da porta {0} não é válido.
zh_tw: {0} 埠名稱無效。

# CDISP0016E
source: An ambiguous call to the {0} procedure resolved to functions in the following namespaces: {1}.
de: Ein mehrdeutiger Aufruf der Prozedur {0} hat Funktionen in den folgenden Namensbereichen aufgelöst: {1}.
es: Una llamada ambigua al procedimiento {0} se ha resuelto en funciones en los espacios de nombres siguientes: {1}.
ko: {0} 프로시저에 대한 앰비규어스한 호출이 다음 네임스페이스의 함수로 분석되었습니다: {1}.
pt_br: Uma chamada ambígua para o procedimento {0} resolvido para as funções nos seguintes namespaces: {1}.
zh_tw: 對 {0} 程序的語意不明呼叫已解析為以下名稱空間中的函數：{1}。

# CDISP0017E
source: An ambiguous identifier named {0} exists in the following namespaces: {1}.
de: Eine mehrdeutige Kennung mit dem Namen {0} ist in den folgenden Namensbereichen vorhanden: {1}.
es: Un identificador ambiguo llamado {0} existe en los espacios de nombres siguientes: {1}.
ko: 다음 네임스페이스에 이름이 {0}인 앰비규어스한 ID가 존재합니다: {1}.
pt_br: Um identificador ambíguo denominado {0} existe nos seguintes namespaces: {1}.
zh_tw: 名為 {0} 且語意不明的 ID 存在於以下名稱空間中：{1}。

# CDISP0018E
source: An ambiguous identifier named {0} exists in the following input ports or operator-specific enumerations: {1}.
de: Eine mehrdeutige Kennung mit dem Namen {0} ist in den folgenden Eingabeports oder operatorspezifischen Aufzählungen vorhanden: {1}.
es: Un identificador ambiguo llamado {0} existe en los puertos de entrada siguientes o enumeraciones específicas de operador: {1}.
ko: 다음 입력 포트 또는 연산자 고유 열거에 이름이 {0}인 앰비규어스한 ID가 존재합니다: {1}.
pt_br: Um identificador ambíguo denominado {0} existe nas seguintes portas de entrada ou enumerações específicas do operador: {1}.
zh_tw: 名為 {0} 且語意不明的 ID 存在於以下輸入埠或運算子專屬列舉中：{1}。

# CDISP0019E
source: The break statement is outside the loop.
de: Die Unterbrechungsanweisung befindet sich außerhalb der Schleife.
es: La sentencia de interrupción está fuera del bucle.
ko: break문이 루프 밖에 있습니다.
pt_br: A instrução de interrupção está fora do loop.
zh_tw: break 陳述式位於迴圈外部。

# CDISP0020E
source: An input port that corresponds to the {0} identifier was not found.
de: Ein Eingabeport, der der Kennung {0} entspricht, wurde nicht gefunden.
es: No se ha encontrado un puerto de entrada que corresponde al identificador {0}.
ko: {0} ID에 해당하는 입력 포트를 찾지 못했습니다.
pt_br: Uma porta de entrada que corresponde ao identificador {0} não foi localizada.
zh_tw: 找不到對應於 {0} ID 的輸入埠。

# CDISP0021E
source: A port that corresponds to the {0} identifier was not found.
de: Ein Port, der der Kennung {0} entspricht, wurde nicht gefunden.
es: No se ha encontrado un puerto que corresponde al identificador {0}.
ko: {0} ID에 해당하는 포트를 찾지 못했습니다.
pt_br: Uma porta que corresponde ao identificador {0} não foi localizada.
zh_tw: 找不到對應於 {0} ID 的埠。

# CDISP0022E
source: The tuple definition is circular.
de: Die Tupeldefinition ist zirkulär.
es: La definición de tupla es circular.
ko: 튜플 정의가 순환입니다.
pt_br: A definição de tupla é circular.
zh_tw: 值組定義是循環的。

# CDISP0023E
source: The continue statement is outside the loop.
de: Die Fortsetzungsanweisung (continue) befindet sich außerhalb der Schleife.
es: La sentencia de continuación está fuera del bucle.
ko: continue문이 루프 밖에 있습니다.
pt_br: A instrução de continuação está fora do loop.
zh_tw: continue 陳述式位於迴圈外部。

# CDISP0024E
source: The use directive is a duplicate.
de: Die Verwendungsanweisung (use) ist ein Duplikat.
es: La directiva de uso es un duplicado.
ko: use 지시문이 중복입니다.
pt_br: A diretiva de uso é uma duplicata.
zh_tw: use 指引重複。

# CDISP0025E
source: The following identifier is a duplicate: {0}.
de: Die folgende Kennung ist ein Duplikat: {0}.
es: El identificador siguiente es un duplicado: {0}.
ko: 다음 ID가 중복입니다: {0}.
pt_br: O identificador a seguir é uma duplicata: {0}.
zh_tw: 以下 ID 重複：{0}。

# CDISP0027E
source: The following string literal is not valid: {0}.
de: Das folgende Zeichenfolgeliteral ist nicht gültig: {0}.
es: El literal de serie siguiente no es válido: {0}.
ko: 다음 문자열 리터럴이 유효하지 않습니다: {0}.
pt_br: A seguinte sequência literal não é válida: {0}.
zh_tw: 以下字串文字無效：{0}。

# CDISP0028E
source: The tuple literal element is not valid. The elements of a tuple literal must be attribute assignments in the following form: attribute = expression.
de: Das Tupelliteralelement ist nicht gültig. Die Elemente eines Tupelliterals müssen Attributzuweisungen im folgenden Format sein: Attribut = Ausdruck.
es: El elemento deliteral de tupla no es válido. Los elementos de un literal de tupla deben ser asignaciones de atributos con el formato siguiente: atributo = expresión.
ko: 튜플 리터럴 요소가 유효하지 않습니다. 튜플 리터럴의 요소는 속성 = 표현식 양식의 속성 지정이어야 합니다.
pt_br: O elemento literal de tupla não é válido. Os elementos de uma tupla literal devem ser designações de atributo no seguinte formato: atributo = expressão.
zh_tw: 值組文字元素無效。值組文字的元素必須是採用下列形式的屬性指派：屬性 = 表示式。

# CDISP0029E
source: The following label is a duplicate: {0}.
de: Der folgende Kennsatz ist ein Duplikat: {0}.
es: La etiqueta siguiente es un duplicado: {0}.
ko: 다음 레이블이 중복입니다: {0}.
pt_br: O rótulo a seguir é uma duplicata: {0}.
zh_tw: 以下標籤重複：{0}。

# CDISP0030E
source: The {0} parameter expects {1,number,0} expressions, but the following number of expressions was specified: {2,number,0}.
de: Der Parameter {0} erwartet {1,number,0} Ausdrücke, es wurde jedoch die folgende Anzahl Ausdrücke angegeben: {2,number,0}.
es: El parámetro {0} espera {1,número,0} expresiones, pero se ha especificado el número siguiente de expresiones: {2,número,0}.
ko: {0} 매개변수에서 {1,number,0}개 표현식을 기대했으나 {2,number,0}개의 표현식이 지정되었습니다.
pt_br: O parâmetro {0} espera {1,number,0} expressões, mas o número de expressões a seguir foi especificado: {2,number,0}.
zh_tw: {0} 參數預期 {1,number,0} 個表示式，但卻指定了以下數目的表示式：{2,number,0}。

# CDISP0031E
source: The {0} function has the same parameter types as another function.
de: Die Funktion {0} hat dieselben Parametertypen wie eine andere Funktion.
es: La función {0} tiene los mismos tipos de parámetro que otra función.
ko: {0} 함수의 매개변수 유형이 다른 함수와 동일합니다.
pt_br: A função {0} possui os mesmos tipos de parâmetro que a outra função.
zh_tw: {0} 函數與另一個函數具有相同的參數類型。

# CDISP0032D
source: The {0} identifier was previously defined at this location.
de: Die Kennung {0} war zuvor an dieser Position definiert.
es: El identificador {0} se ha definido previamente en esta ubicación.
ko: {0} ID가 이전에 이 위치에서 정의되었습니다.
pt_br: O identificador {0} foi definido anteriormente neste local.
zh_tw: {0} ID 先前定義於此位置。

# CDISP0033E
source: There is a problem parsing the XML file {0}.
de: Beim Parsing der XML-Datei {0} gibt es ein Problem.
es: Existe un problema con el análisis del archivo XML {0}.
ko: XML 파일 {0}을(를) 구문 분석하는 중에 문제점이 발생했습니다.
pt_br: Há um problema ao analisar o arquivo XML {0}.
zh_tw: 剖析 XML 檔 {0} 時遇到問題。

# CDISP0034E
source: The history subscript for the following input stream cannot be a slice: {0} [ : ].
de: Der Verlaufsindex für den folgenden Eingabedatenstrom kann kein Slice sein: {0} [ : ].
es: El subscript de historial para la secuencia de entrada siguiente no puede ser una porción: {0} [ : ].
ko: 다음 입력 스트림에 대한 실행기록 서브스크립트는 슬라이스일 수 없습니다: {0} [ : ].
pt_br: O subscrito histórico para o fluxo de entrada a seguir não pode ser uma fatia: {0} [ : ].
zh_tw: 下列輸入串流的歷程下標不能是截塊：{0} [ : ]。

# CDISP0035E
source: A type mismatch was found in the history subscript. An integral type is expected, but the following type is found instead: {0} [ {1} ].
de: Typabweichung im Verlaufsindex gefunden. Ein Integraltyp wird erwartet, aber der folgende Typ wurde gefunden: {0} [ {1} ].
es: Se ha encontrado una discrepancia de tipo en el subscript del historial. Se espera un tipo integral, pero en su lugar se ha encontrado el tipo siguiente: {0} [ {1} ].
ko: 실행기록 서브스크립트에서 유형 불일치를 발견했습니다. 정수형이 기대되었으나 대신 다음 유형을 발견했습니다: {0} [ {1} ].
pt_br: Uma incompatibilidade de tipo foi localizada no subscrito de histórico. Um tipo integral é esperado, mas o tipo a seguir foi localizado: {0} [ {1} ].
zh_tw: 在歷程下標中找到不符的類型。預期整數類型，但卻找到以下類型：{0} [ {1} ]。

# CDISP0036E
source: The expression that is used to subscript a stream history reference must be an integer that is a compile time value, but the following expression was found: {0}.
de: Der Ausdruck, mit dem eine Datenstromverlaufsreferenz indexiert wird, muss ein Integer sein, der ein Kompilierzeitwert ist, aber der folgende Ausdruck wurde gefunden: {0}.
es: La expresión que se utiliza para el subscript de una referencia de historial de secuencia debe ser un entero que es un valor de hora de compilación, pero se ha encontrado la expresión siguiente: {0}.
ko: 스트림 실행기록 참조를 서브스크립트하는 데 사용되는 표현식은 컴파일 시간 값인 정수여야 하지만, 다음 표현식을 발견했습니다: {0}.
pt_br: A expressão que é usada para subscrito de uma referência de histórico de fluxo deve ser um número inteiro que seja um valor de tempo de compilação, mas a expressão a seguir foi localizada: {0}.
zh_tw: 用於對串流歷程參照添加下標的表示式，必須是一個整數（表示編譯時期值），但卻找到以下表示式：{0}。

# CDISP0037E
source: A type mismatch exists in the following subscript index: {0} [{1}].
de: Im folgenden Index liegt eine Typabweichung vor: {0} [{1}].
es: Existe una discrepancia de tipo en el índice de subscript siguiente: {0} [{1}].
ko: 다음 서브스크립트 인덱스에서 유형 불일치가 존재합니다: {0} [{1}].
pt_br: Uma incompatibilidade de tipo existe no índice de subscrito a seguir: {0} [{1}].
zh_tw: 以下下標索引中存在類型不符：{0} [{1}]。

# CDISP0038E
source: A type mismatch exists in the following subscript slice: {0} [{1} : {2}].
de: Im folgenden Index-Slice liegt eine Typabweichung vor: {0} [{1} : {2}].
es: Existe una discrepancia de tipo en la porción de subscript siguiente: {0} [{1} : {2}].
ko: 다음 서브스크립트 슬라이스에서 유형 불일치가 존재합니다: {0} [{1} : {2}].
pt_br: Uma incompatibilidade de tipo existe na fatia de subscrito a seguir: {0} [{1} : {2}].
zh_tw: 以下下標截塊中存在類型不符：{0} [{1} : {2}]。

# CDISP0039E
source: The following list, map, or set is a heterogeneous literal: {0}.
de: Die folgende Liste, Map oder Gruppe ist ein heterogenes Literal: {0}.
es: La lista, el mapa o el conjunto siguiente es un literal heterogéneo: {0}.
ko: 다음 목록, 맵 또는 세트는 이종 리터럴입니다: {0}.
pt_br: A lista, o mapa ou o conjunto a seguir é um literal heterogêneo: {0}.
zh_tw: 以下清單、對映或集是異質文字：{0}。

# CDISP0040E
source: The suffix specifies that the type of this numeric literal must be: {0}{1,number,0}. SPL does not support this type.
de: Das Suffix gibt an, dass der Typ dieses numerischen Literals wie folgt sein muss: {0}{1,number,0}. SPL unterstützt diesen Typ nicht.
es: El sufijo especifica que el tipo de este literal numérico debe ser: {0}{1,número,0}. SPL no admite este tipo.
ko: 접미부에서 이 숫자 리터럴을 다음과 같이 지정합니다: {0}{1,number,0}. SPL은 이 유형을 지원하지 않습니다.
pt_br: O sufixo especifica que o tipo deste literal numérico deve ser: {0}{1,number,0 }. O SPL não suporta este tipo.
zh_tw: 字尾指定此數值文字的類型必須是：{0}{1,number,0}。SPL 不支援這種類型。

# CDISP0041E
source: A type mismatch exists in the following cast: ({0}) {1}.
de: In der folgenden Umsetzung liegt eine Typabweichung vor: ({0}) {1}.
es: Existe una discrepancia de tipo en la conversión de tipo de datos siguiente: ({0}) {1}.
ko: 다음 캐스트에서 유형 불일치가 존재합니다: ({0}) {1}.
pt_br: Uma incompatibilidade de tipo existe na conversão a seguir: ({0}) {1}.
zh_tw: 以下強制轉型中存在類型不符：({0}) {1}。

# CDISP0044E
source: The conditional expression contains a type mismatch. The type of the then-branch, which is {0}, must be the same as the type of the else-branch, which is {1}.
de: Der bedingte Ausdruck enthält eine Typabweichung. Der Typ der then-Verzweigung, der {0} ist, muss dem Typ der else-Verzweigung entsprechen, der {1} ist.
es: La expresión condicional contiene una discrepancia de tipo. El tipo de then-branch, que es {0}, debe ser el mismo que el tipo de else-branch, que es {1}.
ko: 조건식에 유형 불일치가 포함되어 있습니다. then 분기의 유형인 {0}은(는) else 분기의 유형인 {1}과(와) 동일해야 합니다.
pt_br: A expressão condicional contém uma incompatibilidade de tipo. O tipo de then-branch, que é {0}, deve ser do mesmo tipo de else-branch, que é {1}.
zh_tw: 條件式表示式包含類型不符。then-branch 的類型 {0} 必須與 else-branch 的類型 {1} 相同。

# CDISP0045E
source: A type mismatch exists. A boolean is required. The actual type of the condition is: {0}.
de: Es liegt eine Typabweichung vor. Ein boolescher Wert ist erforderlich. Tatsächlicher Typ der Bedingung: {0}.
es: Existe una discrepancia de tipo. Es necesario un booleano. El tipo real de la condición es: {0}.
ko: 유형 불일치가 존재합니다. 부울이 필요합니다. 조건의 실제 유형이 다음과 같습니다: {0}.
pt_br: Uma incompatibilidade de tipo existe. Um booleano é necessário. O tipo real da condição é: {0}.
zh_tw: 存在類型不符。需要一個布林值。條件的實際類型卻是：{0}。

# CDISP0046E
source: A type mismatch exists at the {0} infix operator. The left side type, which is type {1}, is expected to be {2} the right side, which is type {3}.
de: Beim eingebetteten Operator {0} liegt eine Typabweichung vor. Vom Typ der linken Seite, der {1} ist, wird erwartet, dass er {2} der rechten Seite ist, wobei der Typ {3} ist.
es: Existe una discrepancia de tipo en el operador de infix {0}. El tipo del lado izquierdo, que es del tipo {1}, se espera que sea {2} del lado derecho, que es del tipo {3}.
ko: {0} infix 연산자에 유형 불일치가 존재합니다. 왼쪽 유형인 {1} 유형은 오른쪽 유형인 {3} 유형과 {2}해야 합니다.
pt_br: Uma incompatibilidade de tipo existe no operador infix {0}. O tipo de lado esquerdo, que é {1}, deve ser {2} no lado direito, que é do tipo {3}.
zh_tw: {0} 中置運算子處存在類型不符。預期左側類型（類型為 {1}）為 {2} 右側（類型為 {3}）。

# CDISP0047E
source: A type mismatch exists. The {0} expression type cannot be converted to the {1} declaration type in a variable initilizer.
de: Es liegt eine Typabweichung vor. Der Ausdruckstyp {0} kann nicht in den Deklarationstyp {1} in einem Variableninitialisierungsoperator konvertiert werden.
es: Existe una discrepancia de tipo. El tipo de expresión {0} no se puede convertir al tipo de declaración {1} en un inicializador de variable.
ko: 유형 불일치가 존재합니다. {0} 표현식은 변수 초기자에서 {1} 선언 유형으로 변환할 수 없습니다.
pt_br: Uma incompatibilidade de tipo existe. O tipo de expressão {0} não pode ser convertido no tipo de declaração {1} em um inicializador de variável.
zh_tw: 存在類型不符。無法在變數初始化器中將 {0} 表示式類型轉換為 {1} 宣告類型。

# CDISP0048E
source: The {0} operator parameter requires values of the {1} type, but values of the {2} type are specified.
de: Der Operatorparameter {0} erfordert Werte des Typs {1}, es wurden jedoch Werte des Typs {2} angegeben.
es: El parámetro de operador {0} requiere valores del tipo {1}, pero se han especificado los valores del tipo {2}.
ko: {0} 연산자 매개변수가 {1} 유형의 값을 필요로 하지만 {2} 유형의 값이 지정되었습니다.
pt_br: O parâmetro do operador {0} requer valores do tipo {1}, mas valores do tipo {2} foram especificados.
zh_tw: {0} 運算子參數需要 {1} 類型的值，但卻指定了 {2} 類型的值。

# CDISP0049E
source: A type mismatch exists for the {0} unary operator and the {1} expression type.
de: Es liegt eine Typabweichung für den monadischen Operator {0} und den Ausdruckstyp {1} vor.
es: Existe una discrepancia del tipo para el operador unario {0} y el tipo de expresión {1}.
ko: {0} unary 연산자 및 {1} 표현식 유형에 대해 유형 불일치가 존재합니다.
pt_br: Uma incompatibilidade de tipo existe para o operador unário {0} e para o tipo de expressão {1}.
zh_tw: {0} 單元運算子和 {1} 表示式類型存在類型不符。

# CDISP0050E
source: A type name is expected. The specified name is {0} and is not a valid type in this scope.
de: Es wird ein Typname erwartet. Der angegebene Name ist {0} und ist in diesem Bereich kein gültiger Typ.
es: Se espera un nombre de tipo. El nombres especificado es {0} y no es un tipo válido en este ámbito.
ko: 기대된 항목은 유형 이름입니다. 지정된 이름은 {0}이며 이는 이 범위에서 유효한 유형이 아닙니다.
pt_br: Um nome de tipo é esperado. O nome especificado é {0} e não é um tipo válido neste escopo.
zh_tw: 預期一個類型名稱。指定的名稱是 {0}，但不是此範圍內的有效類型。

# CDISP0051E
source: An unknown attribute was specified: {0}.
de: Es wurde ein unbekanntes Attribut angegeben: {0}.
es: Se ha especificado un atributo desconocido: {0}.
ko: 알 수 없는 속성이 지정되었습니다: {0}.
pt_br: Um atributo desconhecido foi especificado: {0}.
zh_tw: 指定的屬性不明：{0}。

# CDISP0052E
source: An unknown function was called: {0}.
de: Eine unbekannte Funktion wurde aufgerufen: {0}.
es: Se ha llamado una función desconocida: {0}.
ko: 알 수 없는 함수가 호출되었습니다: {0}.
pt_br: Uma função desconhecida foi chamada: {0}.
zh_tw: 所呼叫的函數不明：{0}。

# CDISP0053E
source: An unknown identifier was referenced in the SPL program: {0}.
de: Im SPL-Programm wurde eine unbekannte Kennung referenziert: {0}.
es: Se ha hecho referencia a un identificador desconocido en el programa SPL: {0}.
ko: SPL 프로그램에서 알 수 없는 ID가 참조되었습니다: {0}.
pt_br: Um identificador desconhecido foi referenciado no programa SPL: {0}.
zh_tw: 在 SPL 程式中參照的 ID 不明：{0}。
