Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0102E
source: The following default pool size value, which is specified by the -d switch, is not valid: {0,number,0}. The default pool size must be greater than 0.
de: Der folgende Standardpoolgrößenwert, der durch den Schalter -d angegeben wird, ist nicht gültig: {0,number,0}. Die Standardpoolgröße muss größer als 0 sein.
es: El valor del tamaño de la agrupación predeterminada siguiente, que se especifica mediante el conmutador -d, no es válido: {0,número,0}. El tamaño de la agrupación predeterminada debe ser mayor que 0.
ko: -d 스위치에 의해 지정된 다음 기본 풀 크기 값이 유효하지 않습니다: {0,number,0}. 기본 풀 크기는 0보다 커야 합니다.
pt_br: O valor de tamanho do conjunto padrão a seguir, que é especificado pelo comutador -d, não é válido: {0,number,0}. O tamanho do conjunto padrão deve ser maior que 0.
zh_tw: 由 -d 開關指定的以下預設儲存區大小值無效：{0,number,0}。預設儲存區大小必須大於 0。

# CDISP0103E
source: The following pool index for the {1} pool is outside the valid range: {0,number,0}. The valid range is: 0...{2,number,0}.
de: Der folgende Poolindex für den Pool {1} liegt außerhalb des gültigen Bereichs: {0,number,0}. Gültiger Bereich: 0...{2,number,0}.
es: El índice de agrupación siguiente para la agrupación {1} está fuera del rango válido: {0,número,0}. El rango válido es: 0...{2,número,0}.
ko: {1} 풀에 대한 다음 풀 인덱스가 유효 범위를 벗어났습니다: {0,number,0}. 유효 범위는 0...{2,number,0}입니다.
pt_br: O índice do conjunto a seguir para o conjunto {1} está fora do intervalo válido: {0,number,0}. O intervalo válido é: 0...{2,número,0}.
zh_tw: {1} 儲存區的以下儲存區索引已超出有效範圍：{0,number,0}。有效範圍是：0...{2,number,0}。

# CDISP0104E
source: The following file cannot be opened: {0}. The error is: {1}.
de: Die folgende Datei kann nicht geöffnet werden: {0}. Fehler: {1}.
es: El archivo siguiente no se puede abrir: {0}. El error es: {1}.
ko: 다음 파일을 열 수 없습니다: {0}. 오류는 {1}입니다.
pt_br: O arquivo a seguir não pode ser aberto: {0}. O erro é: {1}.
zh_tw: 無法開啟下列檔案：{0}。錯誤為：{1}。

# CDISP0105E
source: The following file cannot be created: {0}. The error is: {1}.
de: Die folgende Datei kann nicht erstellt werden: {0}. Fehler: {1}.
es: El archivo siguiente no se puede crear: {0}. El error es: {1}.
ko: 다음 파일을 작성할 수 없습니다: {0}. 오류는 {1}입니다.
pt_br: O arquivo a seguir não pode ser criado: {0}. O erro é: {1}.
zh_tw: 無法建立下列檔案：{0}。錯誤為：{1}。

# CDISP0106E
source: The following file cannot be removed: {0}. The error is: ''{1}''.
de: Die folgende Datei kann nicht entfernt werden: {0}. Fehler: ''{1}''.
es: El archivo siguiente no se puede eliminar: {0}. El error es: ''{1}''.
ko: 다음 파일을 제거할 수 없습니다: {0}. 오류는 ''{1}''입니다.
pt_br: O arquivo a seguir não pode ser removido: {0}. O erro é: ''{1}''.
zh_tw: 無法移除下列檔案：{0}。錯誤為：''{1}''。

# CDISP0107E
source: The following {0} file cannot be renamed to {1}. The error is: {2}.
de: Die Datei {0} kann nicht in {1} umbenannt werden. Fehler: {2}.
es: El archivo {0} siguiente no se puede renombrar a {1}. El error es: {2}.
ko: 다음 {0} 파일의 이름을 {1}(으)로 바꿀 수 없습니다. 오류는 {2}입니다.
pt_br: O arquivo a seguir {0} não pode ser renomeado para {1}. O erro é: {2}.
zh_tw: 無法將下列 {0} 檔案重新命名為 {1}。錯誤為：{2}。

# CDISP0108E
source: The following directory cannot be created: {0}. The error is: {1}.
de: Das folgende Verzeichnis kann nicht erstellt werden: {0}. Fehler: {1}.
es: El directorio siguiente no se puede crear: {0}. El error es: {1}.
ko: {0} 디렉토리를 작성할 수 없습니다. 오류는 {1}입니다.
pt_br: O diretório a seguir não pode ser criado: {0}. O erro é: {1}.
zh_tw: 無法建立下列目錄：{0}。錯誤為：{1}。

# CDISP0109E
source: The following directory cannot be removed: {0}. The error is: {1}.
de: Das folgende Verzeichnis kann nicht entfernt werden: {0}. Fehler: {1}.
es: El directorio siguiente no se puede eliminar: {0}. El error es: {1}.
ko: 다음 디렉토리를 제거할 수 없습니다: {0}. 오류는 {1}입니다.
pt_br: O diretório a seguir não pode ser removido: {0}. O erro é: {1}.
zh_tw: 無法移除下列目錄：{0}。錯誤為：{1}。

# CDISP0110E
source: The {0} operator, which specifies punctuation for port number {1,number,0}, is connected to multiple streams: {2}.
de: Der Operator {0}, der Punktuation für Portnummer {1,number,0} angibt, ist mit mehreren Datenströmen verbunden: {2}.
es: El operador {0}, que especifica la puntuación para el número de puerto {1,número,0}, está conectado a varias secuencias: {2}.
ko: 포트 번호 {1,number,0}에 대한 구두점을 지정하는 {0} 연산자가 여러 스트림에 연결되어 있습니다: {2}.
pt_br: O operador {0}, que especifica uma pontuação para o número da porta {1,number,0}, está conectado a múltiplos fluxos: {2}.
zh_tw: 用來為埠號 {1,number,0} 指定標點符號的 {0} 運算子，已連接至多個串流：{2}。

# CDISP0111E
source: The {0} operator, which specifies punctuation for port number {1,number,0}, is connected to a stream that has no punctuation.
de: Der Operator {0}, der Punktuation für Portnummer {1,number,0} angibt, ist mit einem Datenstrom verbunden, der keine Punktuation hat.
es: El operador {0}, que especifica la puntuación para el número de puerto {1,número,0}, está conectado a una secuencia que no tiene puntuación.
ko: 포트 번호 {1,number,0}에 대한 구두점을 지정하는 {0} 연산자가 구두점이 없는 스트림에 연결되어 있습니다.
pt_br: O operador {0}, que especifica uma pontuação para o número da porta {1,number,0}, está conectado a um fluxo que não tem pontuação.
zh_tw: 用來為埠號 {1,number,0} 指定標點符號的 {0} 運算子，已連接至沒有任何標點符號的串流。

# CDISP0112E
source: The {0} operator, which specifies punctuation for port {1,number,0}, is connected to a stream that does not preserve the punctuation semantics. A loop was detected.
de: Der Operator {0}, der Punktuation für Port {1,number,0} angibt, ist mit einem Datenstrom verbunden, der die Punktuationssemantik nicht beibehält. Es wurde eine Schleife festgestellt.
es: El operador {0}, que especifica la puntuación para el puerto {1,número,0}, está conectado a una secuencia que no conserva la semántica de la puntuación. Se ha detectado un bucle.
ko: 포트 {1,number,0}에 대한 구두점을 지정하는 {0} 연산자가 구두점 시맨틱을 유지하지 않는 스트림에 연결되어 있습니다. 루프를 발견했습니다.
pt_br: O operador {0}, que especifica uma pontuação para a porta {1,number,0}, está conectado a um fluxo que não preserva a semântica de pontuação. Foi detectado um loop.
zh_tw: 用來為埠 {1,number,0} 指定標點符號的 {0} 運算子，已連接至不保留標點符號語意的串流。偵測到迴圈。

# CDISP0115E
source: The operator profile for {0} failed to load. The error is: {1}.
de: Das Operatorprofil für {0} konnte nicht geladen werden. Fehler: {1}.
es: El perfil de operador para {0} no se ha podido cargar. El error es: {1}.
ko: {0}에 대한 연산자 프로파일을 로드하는 데 실패했습니다. 오류는 {1}입니다.
pt_br: O perfil do operador para {0} falhou ao carregar. O erro é: {1}.
zh_tw: 無法載入 {0} 的運算子設定檔。錯誤為：{1}。

# CDISP0116E
source: The {0} intrinsic function can only be used within a placement config.
de: Die interne Funktion {0} kann nur in ''config placement'' verwendet werden.
es: La función intrínseca {0} solo se puede utilizar dentro de una configuración de colocación.
ko: {0} 내장 함수는 배치 구성 내에서만 사용할 수 있습니다.
pt_br: A função intrínseca {0} pode ser usada somente dentro de uma configuração de posicionamento.
zh_tw: {0} 本質函數只能用在放置配置中。

# CDISP0120W
source: The following path is already in the SPL path list: {0}
de: Der folgende Pfad befindet sich bereits in der SPL-Pfadliste: {0}
es: La vía de acceso siguiente ya está en la lista de vías de acceso SPL: {0}
ko: 다음 경로가 이미 SPL 경로 목록에 포함되어 있습니다: {0}
pt_br: O caminho a seguir já está na lista de caminhos do SPL: {0}
zh_tw: 下列路徑已經位於 SPL 路徑清單內：{0}

# CDISP0121W
source: The following toolkit file is missing: {0}.
de: Die folgende Toolkitdatei fehlt: {0}.
es: Falta el archivo del kit de herramientas siguiente: {0}.
ko: 다음 툴킷 파일이 누락되었습니다: {0}.
pt_br: O arquivo de kit de ferramentas a seguir está ausente: {0}.
zh_tw: 遺漏了下列工具箱檔案：{0}。

# CDISP0122E
source: The following toolkit failed to load: {0}. The error is: {1}.
de: Das Laden des folgenden Toolkits ist fehlgeschlagen: {0}. Fehler: {1}.
es: El kit de herramientas siguiente no se ha podido cargar: {0}. El error es: {1}.
ko: 다음 툴킷을 로드하는 데 실패했습니다: {0}. 오류는 {1}입니다.
pt_br: O kit de ferramentas a seguir falhou ao carregar: {0}. O erro é: {1}.
zh_tw: 無法載入下列工具箱：{0}。錯誤為：{1}。

# CDISP0123E
source: The following toolkit failed to load: {0}. The error is: {1}.
de: Das Laden des folgenden Toolkits ist fehlgeschlagen: {0}. Fehler: {1}.
es: El kit de herramientas siguiente no se ha podido cargar: {0}. El error es: {1}.
ko: 다음 툴킷을 로드하는 데 실패했습니다: {0}. 오류는 {1}입니다.
pt_br: O kit de ferramentas a seguir falhou ao carregar: {0}. O erro é: {1}.
zh_tw: 無法載入下列工具箱：{0}。錯誤為：{1}。

# CDISP0124E
source: The {0} XML file was not found during the lookup in the {1} toolkit.
de: Die XML-Datei {0} wurde während des Lookups im Toolkit {1} nicht gefunden.
es: El archivo XML {0} no se ha encontrado durante la búsqueda en el kit de herramientas {1}.
ko: {1} 툴킷 검색 중에 {0} XML 파일을 찾지 못했습니다.
pt_br: O arquivo XML {0} não foi localizado durante a consulta no kit de ferramentas {1}.
zh_tw: 在查閱 {1} 工具箱期間，找不到 {0} XML 檔。

# CDISP0125E
source: The {0} XML file cannot be created. The error is: {1}.
de: Die XML-Datei {0} kann nicht erstellt werden. Fehler: {1}.
es: El archivo XML {0} no se puede crear. El error es: {1}.
ko: {0} XML 파일을 작성할 수 없습니다. 오류는 {1}입니다.
pt_br: O arquivo XML {0} não pode ser criado. O erro é: {1}.
zh_tw: 無法建立 {0} XML 檔。錯誤為：{1}。

# CDISP0126E
source: The {0} SPL file was not found during the lookup in the {1} toolkit.
de: Die SPL-Datei {0} wurde während des Lookups im Toolkit {1} nicht gefunden.
es: El archivo SPL {0} no se ha encontrado durante la búsqueda en el kit de herramientas {1}.
ko: {1} 툴킷 검색 중에 {0} SPL 파일을 찾지 못했습니다.
pt_br: O arquivo SPL {0} não foi localizado durante a consulta no kit de ferramentas {1}.
zh_tw: 在查閱 {1} 工具箱期間，找不到 {0} SPL 檔。

# CDISP0127E
source: The following toolkit file is out of date: {0}. This file is newer: {1}.
de: Die folgende Toolkitdatei ist veraltet: {0}. Die folgende Datei ist neuer: {1}.
es: El archivo de kit de herramientas siguiente está obsoleto: {0}. Este archivo es más nuevo: {1}.
ko: 다음 툴킷 파일이 최신 상태가 아닙니다: {0}. 다음 파일이 더 최신입니다: {1}.
pt_br: O arquivo de kit de ferramentas a seguir está desatualizado: {0}. Este arquivo é mais recente: {1}.
zh_tw: 下列工具箱檔案不是最新的：{0}。下列檔案較新：{1}。

# CDISP0128E
source: The {0} identifier is duplicated in the following namespace: {1}.
de: Die Kennung {0} wird im folgenden Namensbereich dupliziert: {1}.
es: El identificador {0} está duplicado en el espacio de nombres siguiente: {1}.
ko: {0} ID가 다음 네임스페이스에서 중복되어 있습니다: {1}.
pt_br: O identificador {0} está duplicado no namespace a seguir: {1}.
zh_tw: 在下列名稱空間中，{0} ID 重複：{1}。

# CDISP0129E
source: The {0} identifier is duplicated in the default namespace.
de: Die Kennung {0} wird im Standardnamensbereich dupliziert.
es: El identificador {0} está duplicado en el espacio de nombres predeterminado.
ko: {0} ID가 기본 네임스페이스에서 중복되어 있습니다.
pt_br: O identificador {0} está duplicado no namespace padrão.
zh_tw: 在預設名稱空間中，{0} ID 重複。

# CDISP0130E
source: The {0} identifier is duplicated as the {1} operator and the {2} function.
de: Die Kennung {0} wird als Operator {1} und Funktion {2} dupliziert.
es: El identificador {0} está duplicado como el operador {1} y la función {2}.
ko: {0} ID가 {1} 연산자 및 {2} 함수로서 중복되어 있습니다.
pt_br: O identificador {0} está duplicado como o operador {1} e a função {2}.
zh_tw: {0} ID 與 {1} 運算子及 {2} 函數重複。

# CDISP0131E
source: Errors occurred while the toolkits were loading.
de: Fehler beim Laden der Toolkits.
es: Se han producido errores mientras se cargaban los kits de herramientas.
ko: 툴킷이 로드되는 중에 오류가 발생했습니다.
pt_br: Ocorreram erros enquanto os kits de ferramentas estavam carregando.
zh_tw: 載入工具箱時發生錯誤。

# CDISP0132E
source: The following transport performance file was not found: {0}.
de: Die folgende Transportleistungsdatei wurde nicht gefunden: {0}.
es: El archivo de rendimiento de transporte siguiente no se ha encontrado: {0}.
ko: 다음 전송 성능 파일을 찾지 못했습니다: {0}.
pt_br: O arquivo de desempenho de transporte a seguir não foi localizado: {0}.
zh_tw: 找不到下列傳輸效能檔案：{0}。

# CDISP0136E
source: The following helper file for the code generator is missing: {0}.
de: Die folgende Helper-Datei für den Codegenerator fehlt: {0}.
es: Falta el archivo helper siguiente para el generador de códigos: {0}.
ko: 코드 생성 프로그램에 대한 다음 헬퍼 파일이 누락되었습니다: {0}.
pt_br: O arquivo auxiliar a seguir para o gerador de código está ausente: {0}.
zh_tw: 遺漏了程式碼產生器的下列說明程式檔案：{0}。

# CDISP0137E
source: The following template file for the code generator is missing: {0}.
de: Die folgende Vorlagendatei für den Codegenerator fehlt: {0}.
es: Falta el archivo de plantilla siguiente para el generador de códigos: {0}.
ko: 코드 생성 프로그램에 대한 다음 템플리트 파일이 누락되었습니다: {0}.
pt_br: O arquivo de modelo a seguir para o gerador de código está ausente: {0}.
zh_tw: 遺漏了程式碼產生器的下列範本檔：{0}。

# CDISP0139E
source: The execution of the code generator failed. The error is: {0}.
de: Die Ausführung des Codegenerators ist fehlgeschlagen. Fehler: {0}.
es: Ha fallado la ejecución del generador de códigos. El error es: {0}.
ko: 코드 생성 프로그램의 실행이 실패했습니다. 오류는 {0}입니다.
pt_br: A execução do gerador de código falhou. O erro é: {0}.
zh_tw: 程式碼產生器的執行失敗。錯誤為：{0}。

# CDISP0140E
source: The execution of the following script failed: {0}. The error is: {1}.
de: Die Ausführung des folgenden Scripts ist fehlgeschlagen: {0}. Fehler: {1}.
es: Ha fallado la ejecución del script siguiente: {0}. El error es: {1}.
ko: 다음 스크립트의 실행이 실패했습니다: {0}. 오류는 {1}입니다.
pt_br: A execução do script a seguir falhou: {0}. O erro é: {1}.
zh_tw: 下列 Script 的執行失敗：{0}。錯誤為：{1}。

# CDISP0141E
source: The compilation of the generated code failed.
de: Die Kompilierung des generierten Codes ist fehlgeschlagen.
es: Ha fallado la compilación del código generado.
ko: 생성된 코드의 컴파일이 실패했습니다.
pt_br: A compilação do código gerado falhou.
zh_tw: 所產生程式碼的編譯失敗。

# CDISP0142E
source: During the evaluation of the {1} expression, the following compile time exception occurred: {0}. Ensure that the expression can be evaluated at compile time.
de: Während der Auswertung des Ausdrucks {1} ist die folgende Kompilierzeitausnahmebedingung aufgetreten: {0}. Stellen Sie sicher, dass der Ausdruck bei der Kompilierung ausgewertet werden kann.
es: Durante la evaluación de la expresión {1}, se ha producido la excepción de tiempo de compilación siguiente: {0}. Asegúrese de que la expresión se puede evaluar durante el tiempo de compilación.
ko: {1} 표현식의 평가 중에 다음 컴파일 시간 예외가 발생했습니다: {0}. 해당 표현식을 컴파일 시간에 평가할 수 있는지 확인하십시오.
pt_br: Durante a avaliação da expressão {1}, a exceção de tempo de compilação a seguir ocorreu: {0}. Assegure-se de que a expressão possa ser avaliada no tempo de compilação.
zh_tw: 在 {1} 表示式的求值期間，發生下列編譯時期異常狀況：{0}。請確保可在編譯時期對表示式進行求值。

# CDISP0143E
source: A compile time exception occurred during the evaluation of the following SPL expression: {0}. Check the constraints.
de: Während der Auswertung des folgenden SPL-Ausdrucks ist eine Kompilierzeitausnahmebedingung aufgetreten: {0}. Überprüfen Sie die Einschränkungen.
es: Se ha producido una excepción de tiempo de compilación durante la evaluación de la expresión SPL siguiente: {0}. Compruebe las restricciones.
ko: 다음 SPL 표현식의 평가 중에 컴파일 시간 예외가 발생했습니다: {0}. 제한조건을 확인하십시오.
pt_br: Uma exceção de tempo de compilação ocorreu durante a avaliação da expressão SPL a seguir: {0}. Verifique as restrições.
zh_tw: 在下列 SPL 表示式的求值期間，發生編譯時期異常狀況：{0}。請檢查限制項。

# CDISP0144E
source: The {0} subscript in the {1} expression is not valid.
de: Der Index {0} im Ausdruck {1} ist nicht gültig.
es: El subscript {0} de la expresión {1} no es válida.
ko: {1} 표현식의 {0} 서브스크립트가 유효하지 않습니다.
pt_br: O subscrito {0} na expressão {1} não é válido.
zh_tw: {1} 表示式中的 {0} 下標無效。

# CDISP0146E
source: The {0} operator was not found in the toolkit.
de: Der Operator {0} wurde im Toolkit nicht gefunden.
es: El operador {0} no se ha encontrado en el kit de herramientas.
ko: 툴킷에서 {0} 연산자를 찾지 못했습니다.
pt_br: O operador {0} não foi localizado no kit de ferramentas.
zh_tw: 在工具箱中找不到 {0} 運算子。

# CDISP0147E
source: The following script cannot be run: {0}.
de: Das folgende Script kann nicht ausgeführt werden: {0}.
es: El script siguiente no se puede ejecutar: {0}.
ko: 다음 스크립트를 실행할 수 없습니다: {0}.
pt_br: O script a seguir não pode ser executado: {0}.
zh_tw: 無法執行下列 Script：{0}。

# CDISP0148E
source: The following non-zero return code was received from the {1} script: {0,number,0}.
de: Der folgende Rückgabecode ungleich null wurde vom Script {1} empfangen: {0,number,0}.
es: El código de retorno siguiente distinto a cero se ha recibido del script {1}: {0,número,0}.
ko: 다음 0이 아닌 리턴 코드를 {1} 스크립트로부터 수신했습니다: {0,number,0}.
pt_br: O código de retorno diferente de zero a seguir foi recebido do script {1}: {0,number,0}.
zh_tw: 接收到來自 {1} Script 的下列非零回覆碼：{0,number,0}。

# CDISP0149E
source: The IP address cannot be obtained for the {0} host
de: Die IP-Adresse kann für den Host {0} nicht abgerufen werden.
es: La dirección IP no se puede obtener para el host {0}
ko: {0} 호스트의 IP 주소를 획득할 수 없습니다.
pt_br: O endereço IP não pode ser obtido para o host {0}
zh_tw: 無法取得 {0} 主機的 IP 位址

# CDISP0150E
source: An IP address that resolves to the name of the {0} host cannot be obtained
de: Eine IP-Adresse, die in den Namen des Hosts {0} aufgelöst wird, kann nicht abgerufen werden.
es: No se puede obtener una dirección IP que se resuelve en el nombre del host {0}
ko: {0} 호스트의 이름으로 분석되는 IP 주소를 획득할 수 없습니다.
pt_br: Um endereço IP que resolve para o nome do host {0} não pode ser obtido
zh_tw: 無法取得解析為 {0} 主機名稱的 IP 位址

# CDISP0151E
source: For the {0} host, an IP address that resolves to a hostname other than localhost cannot be obtained.
de: Für den Host {0} kann eine IP-Adresse, die in einen anderen Hostnamen als localhost aufgelöst wird, nicht abgerufen werden.
es: Para el host {0}, no se puede obtener una dirección IP que se resuelve en un nombre de host distinto a localhost.
ko: {0} 호스트에 대해, localhost 외의 호스트 이름으로 분석되는 IP 주소를 획득할 수 없습니다.
pt_br: Para o host {0}, um endereço IP que é resolvido para um nome do host diferente do host local não pode ser obtido.
zh_tw: 對於 {0} 主機，無法取得解析為主機名稱（而不是 localhost）的 IP 位址。

# CDISP0152E
source: A valid canonical name cannot be obtained for the following host: {0}. The error is: {1}.
de: Für den folgenden Host kann kein gültiger kanonischer Name abgerufen werden: {0}. Fehler: {1}.
es: No se puede obtener un nombre canónico válido para el host siguiente: {0}. El error es: {1}.
ko: 다음 호스트에 대해 유효한 정규 이름을 획득할 수 없습니다: {0}. 오류는 {1}입니다.
pt_br: Um nome canônico válido não pode ser obtido para o seguinte host: {0}. O erro é: {1}.
zh_tw: 無法取得下列主機的有效標準名稱：{0}。錯誤為：{1}。

# CDISP0153E
source: A valid canonical name cannot be obtained for the following host. The hostname is {0}. The name of the host pool is: {1}. The error is: {2}.
de: Für den Host kann kein gültiger kanonischer Name abgerufen werden. Hostname: {0}. Name des Host-Pools: {1}. Fehler: {2}.
es: No se puede obtener un nombre canónico válido para el host siguiente. El nombre de host es {0}. El nombre de la agrupación de hosts es: {1}. El error es: {2}.
ko: 다음 호스트에 대해 유효한 정규 이름을 획득할 수 없습니다. 호스트 이름은 {0}입니다. 호스트 풀의 이름은 {1}입니다. 오류는 {2}입니다.
pt_br: Um nome canônico válido não pode ser obtido para o host a seguir. O nome do host é {0}. O nome do conjunto de hosts é: {1}. O erro é: {2}.
zh_tw: 無法取得下列主機的有效標準名稱。主機名稱為 {0}。主機儲存區的名稱為：{1}。錯誤為：{2}。

# CDISP0154E
source: The {0} hostname is duplicated in host pool {1}.
de: Der Hostname {0} ist im Host-Pool {1} dupliziert.
es: El nombre de host {0} está duplicado en la agrupación de hosts {1}.
ko: 호스트 풀 {1}에서 {0} 호스트 이름이 중복되어 있습니다.
pt_br: O nome do host {0} está duplicado no conjunto do host {1}.
zh_tw: {0} 主機名稱在主機儲存區 {1} 中重複。

# CDISP0155E
source: After the host resolution, hostname {0} is duplicated in host pool {1}.
de: Nach der Hostauflösung wird der Hostname {0} im Host-Pool {1} dupliziert.
es: Después de la resolución del host, el nombre de host {0} está duplicado en la agrupación de hosts {1}.
ko: 호스트 분석 결과, 호스트 풀 {1}에서 {0} 호스트 이름이 중복되어 있습니다.
pt_br: Após a resolução do host, o nome do host {0} está duplicado no conjunto de hosts {1}.
zh_tw: 在主機解析之後，主機名稱 {0} 在主機儲存區 {1} 中重複。

# CDISP0159E
source: The following explicit host pool is empty: {0}.
de: Der folgende explizite Host-Pool ist leer: {0}.
es: La agrupación de hosts explícitos siguiente está vacía: {0}.
ko: 다음 명시 호스트 풀이 비어 있습니다: {0}.
pt_br: O conjunto de hosts explícitos a seguir está vazio: {0}.
zh_tw: 下列明確主機儲存區是空的：{0}。

# CDISP0160E
source: The {0} explicit host pool is incomplete. The following number of hosts are missing from the pool: {1,number,0}.
de: Der explizite Host-Pool {0} ist unvollständig. Anzahl der im Pool fehlenden Hosts: {1,number,0}.
es: La agrupación de hosts explícitos {0} está incompleta. Falta el número siguiente de hosts en la agrupación: {1,número,0}.
ko: {0} 명시 호스트 풀이 완전하지 않습니다. 풀에서 {1,number,0}개의 호스트가 누락되어 있습니다.
pt_br: O conjunto de hosts explícitos {0} está incompleto. O seguinte número de hosts está ausente do conjunto: {1,number,0}.
zh_tw: {0} 明確主機儲存區不完整。儲存區中遺漏了以下數目的主機：{1,number,0}。

# CDISP0161E
source: Multiple imported streams with filter expressions on one port is not supported.
de: Mehrere importierte Datenströme mit Filterausdrücken für einen Port werden nicht unterstützt.
es: No están soportadas varias secuencias importadas con expresiones de filtro en un puerto.
ko: 하나의 포트에서 filter 표현식이 있는 여러 임포트된 스트림은 지원되지 않습니다.
pt_br: Múltiplos fluxos importados com expressões de filtro em uma porta não são suportados.
zh_tw: 不支援在一個埠上使用過濾表示式多次匯入串流。

# CDISP0162E
source: The syntax of the applicationName parameter of the Import operator is not valid. The following syntax was found: {0}. The expected syntax is: [<namespaceName>::]<compositeName>
de: Die Syntax des Parameters applicationName des Importoperators ist nicht gültig. Gefundene Syntax: {0}. Erwartete Syntax: [<Namensbereichsname>::]<Verbundname>
es: La sintaxis del parámetro applicationName del operador de importación no es válida. Se ha encontrado la sintaxis siguiente: {0}. La sintaxis prevista es: [<Nombre_espacio_nombres>::]<Nombre_compuesto>
ko: Import 연산자의 applicationName 매개변수의 구문이 유효하지 않습니다. 다음 구문을 발견했습니다: {0}. 기대된 구문은 [<namespaceName>::]<compositeName>입니다.
pt_br: A sintaxe do parâmetro applicationName do operador de Importação não é válida. A sintaxe a seguir foi localizada: {0}. A sintaxe esperada é: [<namespaceName>::]<compositeName>
zh_tw: 「匯入」運算子之 applicationName 參數的語法無效。找到下列語法：{0}。預期的語法為：[<namespaceName>::]<compositeName>

# CDISP0165E
source: The use of multiple subscription-based import streams on one port is not supported.
de: Die Verwendung mehrerer subskriptionsbasierter Importdatenströme für einen Port wird nicht unterstützt.
es: No está soportado el uso de varias secuencias de importación basadas en suscripción en un puerto.
ko: 하나의 포트에서 여러 서브스크립션 기반 임포트 스트림을 사용하는 것은 지원되지 않습니다.
pt_br: O uso de múltiplos fluxos de importação baseados em assinatura em uma porta não é suportado.
zh_tw: 不支援在一個埠上使用多訂閱型匯入串流。

# CDISP0166E
source: The {0} parameter uses a single expression, but an expression list was specified.
de: Der Parameter {0} verwendet einen einzelnen Ausdruck, es wurde jedoch eine Ausdrucksliste angegeben.
es: El parámetro {0} utiliza una expresión única, pero se ha especificado una lista de expresiones.
ko: {0} 매개변수에서는 하나의 표현식을 사용하지만 표현식 목록이 지정되었습니다.
pt_br: O parâmetro {0} utiliza uma expressão única, mas uma lista de expressão foi especificada.
zh_tw: {0} 參數使用單一表示式，但卻指定了一個表示式清單。

# CDISP0167E
source: The {0} parameter uses a string literal, but the following expression was specified: {1}.
de: Der Parameter {0} verwendet ein Zeichenfolgeliteral, aber der folgende Ausdruck wurde angegeben: {1}.
es: El parámetro {0} utiliza un literal de serie, pero se ha especificado la expresión siguiente: {1}.
ko: {0} 매개변수에서는 문자열 리터럴을 사용하지만 다음 표현식이 지정되었습니다: {1}.
pt_br: O parâmetro {0} usa uma sequência literal, mas a expressão a seguir foi especificada: {1}.
zh_tw: {0} 參數使用字串文字，但卻指定了下列表示式：{1}。
