Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0466E
source: The {0} function must be declared to be stateful because it calls the {1} function, which is stateful.
de: Die Funktion {0} muss als ''stateful'' deklariert werden, weil sie die Funktion {1} aufruft, die als ''stateful'' definiert ist.
es: La función {0} se debe declarar para que sea con estado porque llama a la función {1}, que es con estado.
ko: {0} 함수는 stateful인 {1} 함수를 호출하므로 stateful로 선언해야 합니다.
pt_br: A função {0} deve ser declarada como stateful, pois ela chama a função {1}, que é stateful.
zh_tw: 必須將 {0} 函數宣告成有狀態函數，因為它會呼叫 {1} 有狀態函數。

# CDISP0467W
source: The {0} function does not need to be declared stateful because it does not call any stateful functions.
de: Die Funktion {0} braucht nicht als ''stateful'' deklariert zu werden, weil sie keine Funktionen aufruft, die als ''stateful'' definiert sind.
es: La función {0} no es necesario que se declare con estado porque no llama a ninguna función con estado.
ko: {0} 함수는 stateful 함수를 호출하지 않으므로 stateful로 선언할 필요가 없습니다.
pt_br: A função {0} não precisa ser declarada como stateful, pois ela não chama nenhuma função stateful.
zh_tw: 不需要將 {0} 函數宣告成有狀態函數，因為它不呼叫任何有狀態函數。

# CDISP0468E
source: Because the {0} composite operator from the {1} namespace is not public, the composite operator is not visible from the {2} namespace.
de: Da der Verbundoperator {0} vom Namensbereich {1} nicht öffentlich ist, ist der Verbundoperator über den Namensbereich {2} nicht sichtbar.
es: Puesto que el operador compuesto {0} del espacio de nombres {1} no es público, el operador compuesto no es visible desde el espacio de nombres {2}.
ko: {1} 네임스페이스의 {0} 복합 연산자가 public이 아니므로 이 복합 연산자가 {2} 네임스페이스에 표시되지 않습니다.
pt_br: Como o operador composto {0} do namespace {1} não é público, ele não está visível a partir do namespace {2}.
zh_tw: 因為來自 {1} 名稱空間的 {0} 複合運算子不是公用的，所以無法從 {2} 名稱空間查看該複合運算子。

# CDISP0469E
source: Because the {0} function from the {1} namespace is not public, the function is not visible from the {2} namespace.
de: Da die Funktion {0} vom Namensbereich {1} nicht öffentlich ist, ist die Funktion über den Namensbereich {2} nicht sichtbar.
es: Puesto que la función {0} del espacio de nombres {1} no es pública, la función no es visible desde el espacio de nombres {2}.
ko: {1} 네임스페이스의 {0} 함수가 public이 아니므로 이 함수가 {2} 네임스페이스에 표시되지 않습니다.
pt_br: Como a função {0} do namespace {1} não é pública, ela não está visível a partir do namespace {2}.
zh_tw: 因為來自 {1} 名稱空間的 {0} 函數不是公用的，所以無法從 {2} 名稱空間查看該函數。

# CDISP0472E
source: SPL does not support this use of the {0} uninitialized variable.
de: SPL unterstützt diese Verwendung der nicht initialisierten Variablen {0} nicht.
es: SPL no admite este uso de la variable {0} no inicializada.
ko: SPL에서는 {0} 초기화되지 않은 변수 사용을 지원하지 않습니다.
pt_br: O SPL não suporta este uso da variável não inicializada {0}.
zh_tw: SPL 不支援 {0} 未起始設定變數的這種用法。

# CDISP0473E
source: The operator model for the {0} operator prohibits the specification of a logic clause.
de: Das Operatormodell für den Operator {0} untersagt die Spezifikation einer Klausel ''logic''.
es: El modelo de operador para el operador {0} prohíbe la especificación de una cláusula lógica.
ko: {0} 연산자의 연산자 모델에서는 logic 절의 지정을 금지합니다.
pt_br: O modelo do operador para o operador {0} proíbe a especificação de uma cláusula de lógica.
zh_tw: {0} 運算子的運算子模型會禁止 logic 子句的規格。

# CDISP0481W
source: The {0} variable is never read.
de: Die Variable {0} wird nie gelesen.
es: La variable {0} no se lee nunca.
ko: {0} 변수를 읽지 않습니다.
pt_br: A variável {0} nunca é lida.
zh_tw: 永不讀取 {0} 變數。

# CDISP0482E
source: A type mismatch exists between the {1} type of the {0} stream and the {2} type of the port.
de: Der Typ {1} des Datenstroms {0} und der Typ {2} des Ports stimmen nicht überein.
es: Existe una discrepancia de tipo entre el tipo {1} de la secuencia {0} y el tipo {2} del puerto.
ko: {1} 유형의 {0} 스트림과 {2} 유형의 포트 간에 유형 불일치가 있습니다.
pt_br: Uma incompatibilidade de tipo existe entre o tipo {1} do fluxo {0} e o tipo {2} da porta.
zh_tw: {0} 串流的 {1} 類型與埠的 {2} 類型不符。

# CDISP0484E
source: The {0} main composite cannot be located. The composite does not exist.
de: Das Hauptverbundelement {0} kann nicht lokalisiert werden. Das Verbundelement ist nicht vorhanden.
es: El compuesto principal {0} no se puede localizar. El compuesto no existe.
ko: {0} 기본 복합을 찾을 수 없습니다. 이 복합이 존재하지 않습니다.
pt_br: O composto principal {0} não pode ser localizado. O composto não existe.
zh_tw: 找不到 {0} 主要複合項。該複合項不存在。

# CDISP0487I
source: Do not pre-process the mixed-mode files, which are those files with the .splmm extension.
de: Mixed-Mode-Dateien, d. h. Dateien mit der Erweiterung .splmm, nicht vorverarbeiten.
es: No procese previamente los archivos de modalidad mixta, que son estos archivos con la extensión .splmm.
ko: .splmm 확장자를 가진 혼합 모드 파일을 선행 처리하지 마십시오.
pt_br: Não execute pré-processamento dos arquivos de modo misto, que são os arquivos com a extensão .splmm.
zh_tw: 請勿預處理混合模式檔案，這些檔案具有 .splmm 副檔名。

# CDISP0488E
source: Do not do toolkit indexing in the compilation directory.
de: Keine Toolkitindexierung im Kompilierungsverzeichnis.
es: No realice la indexación de kit de herramientas en el directorio de compilación.
ko: 컴파일 디렉토리에서는 툴킷 인덱싱을 수행하지 마십시오.
pt_br: Não execute indexação do kit de ferramentas no diretório de compilação
zh_tw: 請勿在編譯目錄中執行工具箱建立索引作業。

# CDISP0489E
source: The config threadedPort clause is allowed only on the primitive operator instances.
de: Die Klausel ''config threadedPort'' isr nur für Instanzen primitiver Operatoren zulässig.
es: La cláusula threadedPort de config solo está permitida en las instancias de operador de primitiva.
ko: config threadedPort 절은 기본 연산자 인스턴스에서만 허용됩니다.
pt_br: A cláusula de configuração threadedPort é permitida somente nas instâncias primitivas do operador.
zh_tw: 只容許對初始運算子實例使用 config threadedPort 子句。

# CDISP0490E
source: The type bound must be a positive integer constant.
de: Die Typgrenze muss eine positive Integerkonstante sein.
es: El límite del tipo debe ser una constante de entero positivo.
ko: 유형 바운드는 양의 정수 상수여야 합니다.
pt_br: O limite de tipo deve ser uma constante de número inteiro positivo.
zh_tw: 類型範圍必須是正整數常數。

# CDISP0491E
source: The {0} composite parameter cannot be used to define a new name.
de: Der Verbundparameter {0} kann nicht zum Definieren eines neuen Namens verwendet werden.
es: El parámetro compuesto {0} no se puede utilizar para definir un nombre nuevo.
ko: {0} 복합 매개변수는 새 이름을 정의하는 데 사용할 수 없습니다.
pt_br: O parâmetro composto {0} não pode ser usado para definir um novo nome.
zh_tw: 不能使用 {0} 複合參數來定義新名稱。

# CDISP0494E
source: The value of config defaultPoolSize clause must be a positive integer constant.
de: Der Wert der Klausel ''config defaultPoolSize'' muss eine positive Integerkonstante sein.
es: El valor de la cláusula defaultPoolSize de config debe ser una constante de entero positivo.
ko: config defaultPoolSize 절의 값은 양의 정수 상수여야 합니다.
pt_br: O valor da cláusula de configuração defaultPoolSize deve ser uma constante de número inteiro positivo.
zh_tw: config defaultPoolSize 子句的值必須是正整數常數。

# CDISP0495E
source: The config defaultPoolSize clause accepts only one value.
de: Die Klausel ''config defaultPoolSize'' akzeptiert nur einen Wert.
es: La cláusula defaultPoolSize de config solo acepta un valor.
ko: config defaultPoolSize 절은 하나의 값만 허용합니다.
pt_br: A cláusula de configuração defaultPoolSize aceita somente um valor.
zh_tw: config defaultPoolSize 子句只接受一個值。

# CDISP0496E
source: The namespace name is not valid.
de: Der Namensbereichsname ist nicht gültig.
es: El nombre de espacio de nombres no es válido.
ko: 네임스페이스 이름이 유효하지 않습니다.
pt_br: O nome do namespace não é válido.
zh_tw: 名稱空間名稱無效。

# CDISP0498T
source: Creating the standalone application.
de: Eigenständige Anwendung wird erstellt.
es: Creando la aplicación autónoma.
ko: 독립형 애플리케이션을 작성하는 중입니다.
pt_br: Criando o aplicativo independente.
zh_tw: 正在建立獨立式應用程式。

# CDISP0499E
source: Multiple matching functions can be found for the call to the {0} function. The following {1,number,0} candidates are found:
de: Mehrere übereinstimmende Funktionen können für den Aufruf der Funktion {0} gefunden werden. Die folgenden {1,number,0} Kandidaten wurden gefunden:
es: Se pueden encontrar varias funciones coincidentes para la llamada a la función {0}. Se han encontrado los {1,número,0} candidatos siguientes:
ko: {0} 함수 호출에 대해 일치하는 함수를 여러 개 찾을 수 있습니다. 다음 {1,number,0}개 후보를 발견했습니다:
pt_br: Diversas funções correspondentes podem ser localizadas para a chamada para a função {0}. Os {1,number,0} candidatos a seguir foram localizados:
zh_tw: 對於 {0} 函數的呼叫，找到多個相符的函數。找到了以下 {1,number,0} 個候選項：

# CDISP0500E
source: Either the streamId or the properties can be specified on the Export, but both cannot be specified.
de: Der Parameter ''streamId'' oder ''properties'' kann für den Exportoperator angegeben werden, jedoch nicht beide Parameter zusammen.
es: Se puede especificar el streamId o las propiedades en la Exportación, pero no se pueden especificar ambas cosas.
ko: streamId 또는 properties는 둘 중 하나만 Export에 지정할 수 있으며 둘 다는 지정할 수 없습니다.
pt_br: O streamId ou as propriedades podem ser especificadas na exportação, mas ambos não podem ser especificados.
zh_tw: 可以對「匯出」指定 streamId 或內容，但不能同時指定這兩者。

# CDISP0501E
source: Either the streamId or the subscription can be specified on the Import, but both cannot be specified.
de: Der Parameter ''streamId'' oder ''subscription'' kann für den Importoperator angegeben werden, jedoch nicht beide Parameter zusammen.
es: Se puede especificar el streamId o la suscripción en la Importación, pero no se pueden especificar ambas cosas.
ko: streamId 또는 subscription은 둘 중 하나만 Import에 지정할 수 있으며 둘 다는 지정할 수 없습니다.
pt_br: O streamId ou a assinatura pode ser especificada na importação, mas ambos não podem ser especificados.
zh_tw: 可以對「匯入」指定 streamId 或訂閱，但不能同時指定這兩者。

# CDISP0502E
source: The export parameter for the {0} streamdId already exists. The same stream cannot be specified in different export operators.
de: Der Parameter ''export'' für ''{0} streamdId'' ist bereits vorhanden. Derselbe Datenstrom kann nicht in verschiedenen Exportoperatoren angegeben werden.
es: Ya existe el parámetro de exportación para el streamdId {0}. No se puede especificar la misma secuencia en distintos operadores de exportación.
ko: {0} streamId에 대한 Export 매개변수가 이미 존재합니다. 다른 Export 연산자에 동일한 스트림을 지정할 수는 없습니다.
pt_br: O parâmetro de exportação para o streamdId {0} já existe. O mesmo fluxo não pode ser especificado em operadores de exportação diferentes.
zh_tw: {0} streamdId 的匯出參數已經存在。不能在不同的匯出運算子中指定同一串流。

# CDISP0503E
source: The {0} literal is out of bounds for {1} type.
de: Das Literal {0} befindet sich außerhalb des gültigen Bereichs für Typ {1}.
es: El literal {0} está fuera de los límites para el tipo {1}.
ko: {0} 리터럴이 {1} 유형에 대해 경계를 벗어났습니다.
pt_br: O literal {0} está fora dos limites para o tipo {1}.
zh_tw: {0} 文字已超出 {1} 類型的範圍。

# CDISP0504E
source: A matching function cannot be found for the call to the {0} function. The following {1,number,0} candidates are found:
de: Eine übereinstimmende Funktion kann für den Aufruf der Funktion {0} nicht gefunden werden. Die folgenden {1,number,0} Kandidaten wurden gefunden:
es: No se puede encontrar una función coincidente para la llamada a la función {0}. Se han encontrado los {1,número,0} candidatos siguientes:
ko: {0} 함수 호출에서 일치하는 함수를 찾을 수 없습니다. 다음 {1,number,0}개 후보를 발견했습니다:
pt_br: Uma função correspondente não pode ser localizada para a chamada da função {0}. Os {1,number,0} candidatos a seguir foram localizados:
zh_tw: 對於 {0} 函數的呼叫，找不到相符的函數。找到了以下 {1,number,0} 個候選項：

# CDISP0505D
source: This is a possible candidate: {0}.
de: Dies ist ein möglicher Kandidat: {0}.
es: Este es un posible candidato: {0}.
ko: 가능한 후보는 다음과 같습니다: {0}.
pt_br: Este é um possível candidato: {0}.
zh_tw: 以下是可能的候選項：{0}。

# CDISP0506D
source: This is a possible candidate in the {1} namespace: {0}.
de: Dies ist ein möglicher Kandidat im Namensbereich {1}: {0}.
es: Este es un posible candidato en el espacio de nombres {1}: {0}.
ko: {1} 네임스페이스에서 가능한 후보는 다음과 같습니다: {0}.
pt_br: Este é um possível candidato no namespace {1}: {0}.
zh_tw: 以下可能是 {1} 名稱空間中的候選項：{0}。

# CDISP0507E
source: More than one parameter with the {0} name.
de: Mehrere Parameter mit dem Namen {0}.
es: Más de un parámetro con el nombre {0}.
ko: {0} 이름이 있는 매개변수가 둘 이상 있습니다.
pt_br: Mais de um parâmetro com o nome {0}.
zh_tw: 多個參數具有 {0} 名稱。

# CDISP0508E
source: The {1} type of the {0} parameter is not valid.
de: Der Typ {1} des Parameters {0} ist nicht gültig.
es: El tipo {1} del parámetro {0} no es válido.
ko: {0} 매개변수의 {1} 유형은 유효하지 않습니다.
pt_br: O tipo {1} do parâmetro {0} não é válido.
zh_tw: {0} 參數的 {1} 類型無效。

# CDISP0509E
source: A host pool without a specified size cannot be exclusive.
de: Ein Host-Pool ohne angegebene Größe kann nicht exklusiv sein.
es: Una agrupación de hosts sin un tamaño especificado no puede ser exclusiva.
ko: 지정된 크기가 없는 호스트 풀은 독점 풀이 될 수 없습니다.
pt_br: Um conjunto de hosts sem um tamanho especificado não pode ser exclusivo.
zh_tw: 不具有指定大小的主機儲存區不能是互斥的。

# CDISP0510E
source: The code generation for the code generation template failed.
de: Die Codegenerierung für die Codegenerierungsvorlage ist fehlgeschlagen.
es: La generación de código para la plantilla de generación de código ha fallado.
ko: 코드 생성 템플리트의 코드 생성이 실패했습니다.
pt_br: A geração de códigos para o modelo de geração de códigos falhou.
zh_tw: 程式碼產生範本的程式碼產生失敗。

# CDISP0511E
source: The hexadecimal literal of the {0} type is too long and is not supported.
de: Das hexadezimale Literal des Typs {0} ist zu lang und wird nicht unterstützt.
es: El literal hexadecimal del tipo {0} es demasiado largo y no está soportado.
ko: {0} 유형의 16진수 리터럴이 너무 길며 이는 지원되지 않습니다.
pt_br: O literal hexadecimal do tipo {0} é muito longo e não é suportado.
zh_tw: {0} 類型的十六進位文字太長，不受支援。

# CDISP0512E
source: The verification process for the {0} operator verifier failed.
de: Der Verifizierungsprozess für die Operatorprüffunktion {0} ist fehlgeschlagen.
es: El proceso de verificación para el verificador del operador {0} ha fallado.
ko: {0} 연산자 확인자에 대한 확인 프로세스가 실패했습니다.
pt_br: O processo de verificação para o verificador do operador {0} falhou.
zh_tw: {0} 運算子驗證器的驗證程序失敗。

# CDISP0520E
source: A return statement is missing at the end of a function that returns a non-void type.
de: Eine Anweisung ''return'' fehlt am Ende einer Funktion, die einen anderen Typ als ''void'' zurückgibt.
es: Falta una sentencia de retorno al final de una función que devuelve un tipo que no es nulo.
ko: void가 아닌 유형을 리턴하는 함수의 끝에서 return문이 누락되었습니다.
pt_br: Uma instrução de retorno está ausente no término de uma função que retorna um tipo não void.
zh_tw: 某個函數的末尾遺漏了 return 陳述式，該函數傳回了非 void 類型。

# CDISP0521E
source: The {0} variable is written here and read or written elsewhere in the same expression.
de: Die Variable {0} wird hier geschrieben und an anderer Stelle in demselben Ausdruck gelesen oder geschrieben.
es: La variable {0} está escrita aquí y se lee o escribe en cualquier lugar de la misma expresión.
ko: {0} 변수가 여기 쓰였으며 그 후 동일한 표현식의 다른 위치에서 읽히거나 쓰였습니다.
pt_br: A variável {0} é gravada aqui e lida ou gravada em outro lugar na mesma expressão.
zh_tw: 在這裡寫入 {0} 變數，並在同一表示式中的其他位置讀取或寫入該變數。

# CDISP0522E
source: For the {0} main composite, inputs or outputs must not be specified and all the parameters must have defaults.
de: Für das Hauptverbundelement {0} dürfen keine Eingaben oder Ausgaben angegeben werden und alle Parameter müssen Standardwerte aufweisen.
es: Para el compuesto principal {0}, las entradas o salidas no se deben especificar y todos los parámetros deben tener valores predeterminados.
ko: {0} 기본 복합의 경우 입력 또는 출력은 지정되지 않아야 하며 모든 매개변수는 기본값을 가져야 합니다.
pt_br: Para o composto principal {0}, as entradas ou saídas não devem ser especificadas e todos os parâmetros devem ter padrões.
zh_tw: 對於 {0} 主要複合項，不得指定輸入或輸出，並且所有參數都必須具有預設值。

# CDISP0523D
source: This is the aliased read or write of the {0} variable in the same expression.
de: Dies ist der Aliasname für das Lesen oder Schreiben der Variablen {0} in demselben Ausdruck.
es: Esta es la lectura o escritura con alias de la variable {0} en la misma expresión.
ko: 이는 동일한 표현식에 있는 {0} 변수의 별명 지정된 읽기 또는 쓰기입니다.
pt_br: Esta é a leitura ou gravação com alias da variável {0} na mesma expressão.
zh_tw: 這是同一表示式中 {0} 變數的別名讀取或寫入。

# CDISP0524E
source: Multiple calls to the following stateful functions exist in the same expression: {0} and {1}.
de: Ein Ausdruck enthält mehrere Aufrufe der folgenden Funktionen mit Statusüberwachung: {0} und {1}.
es: Existen varias llamadas a las funciones con estado siguiente en la misma expresión: {0} y {1}.
ko: 동일한 표현식에 다음 stateful 함수에 대한 여러 호출이 존재합니다: {0} 및 {1}.
pt_br: Múltiplas chamadas para as funções stateful a seguir existem na mesma expressão: {0} e {1}.
zh_tw: 同一表示式中存在對下列有狀態函數的多重呼叫：{0} 和 {1}。

# CDISP0525W
source: The host isolation of the {0} operator and the direct or transitive host colocation of this operator with the following operators imply that all these operators must be placed in a single partition: {1}
de: Die Hostisolation des Operators {0} und die direkte oder transitive Hostkolokation dieses Operators mit den folgenden Operatoren implizieren, dass alle diese Operatoren auf eine einzelne Partition verteilt werden müssen: {1}
es: El aislamiento de host del operador {0} y la colocación de host directa o transitiva de este operador con los operadores siguientes implican que todos estos operadores se deben colocar en una sola partición: {1}
ko: {0} 연산자의 호스트 격리, 그리고 다음 연산자와 이 연산자의 직접 또는 임시 동일 호스트에 배치는 이들 연산자를 모두 하나의 파티션에 배치해야 함을 내포합니다: {1}
pt_br: O isolamento do host do operador {0} e a colocação de hosts direta ou transitiva deste operador com os seguintes operadores significam que todos esses operadores devem ser colocados em uma partição única: {1}
zh_tw: {0} 運算子的主機隔離以及此運算子與下列運算子的直接或轉換主機 colocation，默示必須將所有這些運算子都放置在單個分割區中：{1}。

# CDISP0526E
source: The assignment of the {0} operator to the {1} exclusive pool conflicts with the direct or transitive host colocation of this operator with the {2} operator, which is not assigned to the {3} pool.
de: Die Zuweisung des Operators {0} zum exklusiven Pool {1} steht im Konflikt mit der direkten oder transitiven Hostkolokation dieses Operators mit dem Operator {2}, der dem Pool {3} nicht zugewiesen ist.
es: La asignación del operador {0} a la agrupación exclusiva {1} entra en conflicto con la colocación de host directa o transitiva de este operador con el operador {2}, que no está asignado a la agrupación {3}.
ko: {1} 독점 풀에 대한 {0} 연산자 지정이 {3} 풀에 지정되지 않은 {2} 연산자와 이 연산자의 직접 또는 임시 동일 호스트에 배치와 충돌합니다.
pt_br: A designação do operador {0} para o conjunto exclusivo {1} conflita com a colocação de host direta ou transitiva deste operador com o operador {2}, que não está designado ao conjunto {3}.
zh_tw: 將 {0} 運算子指派給 {1} 互斥儲存區這一動作與此運算子與 {2} 運算子（未指派給 {3} 儲存區）的直接或轉換主機 colocation 相衝突。

# CDISP0528E
source: Shared host pools are not permitted when the -p option and the FOPT value is specified.
de: Gemeinsam genutzte Host-Pools sind nicht zulässig, wenn die Option -p und der Wert FOPT angegeben werden.
es: Las agrupaciones de hosts compartidas no están permitidas cuando se ha especificado la opción -p y el valor FOPT.
ko: 공유 호스트 풀은 -p 옵션 및 FOPT 값이 지정된 경우 허용되지 않습니다.
pt_br: Conjuntos de hosts compartilhados não são permitidos quando a opção -p e o valor FOPT são especificados.
zh_tw: 當指定了 -p 選項及 FOPT 值時，不容許使用共用主機儲存區。

# CDISP0529E
source: The {0} host pool, for which a size is not specified, cannot be subscripted.
de: Der Host-Pool {0}, für den keine Größe angegeben ist, kann nicht indexiert werden.
es: No se puede suscribir a la agrupación de hosts {0},para la cual no se ha especificado un tamaño.
ko: 크기가 지정되지 않은 {0} 호스트 풀은 서브스크립트할 수 없습니다.
pt_br: O conjunto de hosts {0}, para o qual um tamanho não é especificado, não pode estar em subscrito.
zh_tw: 無法對尚未指定大小的 {0} 主機儲存區添加下標。

# CDISP0530E
source: The {0} operator uses the default pool, but the default pool size according to the -d option was not specified by using -p FOPT option and value.
de: Der Operator {0} verwendet den Standardpool, die durch die Option -d angegebene Standardpoolgröße wurde jedoch nicht über die Option und den Wert -p FOPT angegeben.
es: El operador {0} utiliza la agrupación predeterminada, pero el tamaño de la agrupación predeterminada de acuerdo con la opción -d no se ha especificado utilizando la opción -p y el valor FOPT.
ko: {0} 연산자는 기본 풀을 사용하지만, -d 옵션에 따라 설정되는 기본 풀 크기가 -p FOPT 옵션 및 값을 사용하여 지정되지 않았습니다.
pt_br: O operador {0} usa o conjunto padrão, mas o tamanho do conjunto padrão de acordo com a opção -d não foi especificado usando a opção e o valor -p FOPT.
zh_tw: {0} 運算子使用預設儲存區，但尚未使用 -p FOPT 選項和值指定預設儲存區大小（根據 -d 選項）。

# CDISP0531E
source: Conflicting default values exist in the {0} getSubmissionTimeValue function. The conflicting default values are: {1} and {2}.
de: In der Funktion ''{0} getSubmissionTimeValue'' sind widersprüchliche Standardwerte vorhanden. Widersprüchliche Standardwerte: {1} und {2}.
es: Existen valores predeterminados que están en conflicto en la función getSubmissionTimeValue {0}. Los valores predeterminados en conflicto son: {1} y {2}.
ko: {0} getSubmissionTimeValue 함수에 충돌하는 기본값이 존재합니다. 충돌하는 기본값은 {1}과(와) {2}입니다.
pt_br: Valores padrão conflitantes existem na função getSubmissionTimeValue {0}. Os valores padrão conflitantes são: {1} e {2}.
zh_tw: {0} getSubmissionTimeValue 函數中存在有衝突的預設值。有衝突的預設值為：{1} 和 {2}。

# CDISP0532E
source: The {0} port name is duplicated in the composite operator definition.
de: Der Portname {0} ist in der Definition des Verbundoperators dupliziert.
es: El nombre de puerto {0} está duplicado en la definición de operador compuesto.
ko: 복합 연산자 정의에서 {0} 포트 이름이 중복되어 있습니다.
pt_br: O nome da porta {0} está duplicado na definição de operador composto.
zh_tw: {0} 埠名稱在複合運算子定義中重複。

# CDISP0533E
source: A call to the {0} custom output function is nested in another expression.
de: Ein Aufruf der angepassten Ausgabefunktion {0} ist in einen anderen Ausdruck verschachtelt.
es: Una llamada a la función de salida personalizada {0} está anidada en otra expresión.
ko: {0} 사용자 정의 출력 함수에 대한 호출이 다른 표현식에 중첩되어 있습니다.
pt_br: Uma chamada para a função de saída customizada {0} está aninhada em outra expressão.
zh_tw: 對 {0} 自訂輸出函數的呼叫巢套在另一個表示式中。

# CDISP0534I
source: Force the generation of the toolkit.xml file even if errors are detected.
de: Generierung der Datei ''toolkit.xml'' selbst bei erkannten Fehlern erzwingen.
es: Fuerce la generación del archivo toolkit.xml, aunque se hayan detectado errores.
ko: 오류가 발견되어도 toolkit.xml 파일의 생성을 강제합니다.
pt_br: Force a geração do arquivo toolkit.xml, mesmo se erros forem detectados.
zh_tw: 強制產生 toolkit.xml 檔，即使偵測到錯誤，亦是如此。

# CDISP0535E
source: The specified compiler options work only when an explicit source file is specified by using the -f option.
de: Die angegebenen Compileroptionen funktionieren nur, wenn über die Option -f eine explizite Quellendatei angegeben wird.
es: Las opciones del compilador especificadas solo funcionan cuando se ha especificado un archivo de origen explícito mediante la opción -f.
pt_br: As opções do compilador especificadas funcionam somente quando um arquivo de origem explícito for especificado usando a opção -f.
zh_tw: 僅當使用 -f 選項指定了明確原始檔時，指定的編譯器選項才工作。

# CDISP0536E
source: The following character is not supported: ''{1}''. Its decimal value is {0,number,0}.
de: Das folgende Zeichen wird nicht unterstützt: ''{1}''. Sein Dezimalwert ist {0,number,0}.
es: El carácter siguiente no está soportado: ''{1}''. Su valor decimal es {0,número,0}.
ko: 다음 문자는 지원되지 않습니다: ''{1}''. 해당 10진수 값은 {0,number,0}입니다.
pt_br: O caractere a seguir não é suportado: ''{1}''. Seu valor decimal é {0,number,0}.
zh_tw: 下列字元不受支援：''{1}''。它的十進位值是 {0,number,0}。
