Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP9233T
source: The DITA documents are being removed.
de: Die DITA-Dokumente werden entfernt.
es: Se están eliminando los documentos DITA.
ko: DITA 문서가 제거되는 중입니다.
pt_br: Os documentos DITA estão sendo removidos.
zh_tw: 正在移除 DITA 文件。

# CDISP9234E
source: If you need a separator in the range of \\x80 through \\xff then you must specify the separator parameter using a (u)int8 value of 0x80 through 0xff.
de: Wenn Sie ein Trennzeichen im Bereich von \\x80 bis \\xff benötigen, müssen Sie den Parameter ''separator'' mit einem (u)int8-Wert von 0x80 bis 0xff angeben.
es: Si necesita un separador en el rango de \\x80 a \\xff, debe especificar el parámetro de separador utilizando un valor (u)int8 de 0x80 a 0xff.
ko: \\x80에서 \\xff까지의 범위 내의 구분자가 필요한 경우에는 0x80에서 0xff까지의 (u)int8 값을 사용하여 separator 매개변수를 지정해야 합니다.
pt_br: Se você precisar de um separador no intervalo de \\x80 a \\xff, então, deve-se especificar o parâmetro separador utilizando um valor (u)int8 de 0x80 a 0xff.
zh_tw: 如果在 \\x80 到 \\xff 範圍內需要一個分隔字元，則必須使用 (u)int8 值 0x80 到 0xff 來指定 separator 參數。

# CDISP9235E
source: The tab character is not a supported separator.
de: Das Tabulatorzeichen ist kein unterstütztes Trennzeichen.
es: El carácter de tabulación no es un separador soportado.
ko: 탭 문자는 지원되는 구분자가 아닙니다.
pt_br: O caractere de tabulação não é um operador suportado.
zh_tw: Tab 字元不是受支援的分隔字元。

# CDISP9236E
source: No toolkit.xml file found in the directory or directories: {0}. Document generation cannot occur.
de: Keine Datei ''toolkit.xml'' im Verzeichnis oder in den Verzeichnissen gefunden: {0}. Dokumentgenerierung kann nicht auftreten.
es: No se ha encontrado ningún archivo toolkit.xml en el directorio o directorios: {0}. No se puede producir la generación de documentos.
ko: 디렉토리에서 toolkit.xml 파일을 찾을 수 없습니다: {0}. 문서 생성을 수행할 수 없습니다.
pt_br: Nenhum arquivo toolkit.xml encontrado no diretório ou diretórios: {0}. A geração do documento não pode ocorrer.
zh_tw: 在下列目錄中找不到 toolkit.xml 檔：{0}。無法執行文件產生作業。

# CDISP9237E
source: Job submission to instance {0} failed for the spl-transport-stats test.
de: Jobübergabe an Instanz {0} ist für den Test von spl-transport-stats fehlgeschlagen.
es: El envío de trabajo a la instancia {0} ha fallado para la prueba spl-transport-stats.
ko: 인스턴스 {0}에 대한 작업 제출이 spl-transport-stats 테스트에 대해 실패했습니다.
pt_br: O envio da tarefa para a instância {0} falhou para o teste spl-transport-stats.
zh_tw: 對於 spl-transport-stats 測試，對實例 {0} 的工作提交失敗。

# CDISP9238I
source: A toolkit.xml file was not created. The documentation was not generated.
de: Eine Datei ''toolkit.xml'' wurde nicht erstellt. Die Dokumentation wurde nicht generiert.
es: No se ha creado un archivo toolkit.xml. No se ha generado la documentación.
ko: toolkit.xml 파일이 작성되지 않았습니다. 문서가 생성되지 않았습니다.
pt_br: Um arquivo toolkit.xml não foi criado. A documentação não foi gerada.
zh_tw: 未建立 toolkit.xml 檔。未產生說明文件。

# CDISP9239E
source: The keepAlive parameter is valid only when the role is server.
de: Der Parameter ''keepAlive'' ist nur gültig, wenn ''role'' auf ''server'' gesetzt ist.
es: El parámetro keepAlive solo es válido cuando el rol es servidor.
ko: keepAlive 매개변수는 역할이 서버인 경우에만 유효합니다.
pt_br: O parâmetro keepAlive é válido somente quando a função for servidor.
zh_tw: 僅當 role 為 server 時，keepAlive 參數才有效。

# CDISP9240E
source: The expression {0} cannot contain side effects.
de: Der Ausdruck {0} kann keine Nebeneffekte enthalten.
es: La expresión {0} no puede contener efectos secundarios.
ko: 표현식 {0}은(는) 부가작용을 포함할 수 없습니다.
pt_br: A expressão {0} não pode conter efeitos colaterais.
zh_tw: 表示式 {0} 不能包含負面影響。

# CDISP9241E
source: Creation of the executable file failed. The location code is {0} and the error code is: {1}
de: Erstellung der ausführbaren Datei ist fehlgeschlagen. Positionscode: {0}. Fehlercode: {1}.
es: La creación del archivo ejecutable ha fallado. El código de ubicación es {0} y el código de error es: {1}
ko: 실행 파일 작성이 실패했습니다. 위치 코드는 {0}이며 오류 코드는 {1}입니다.
pt_br: A criação do arquivo executável falhou. O código do local é {0} e o código de erro é: {1}
zh_tw: 建立執行檔失敗。位置碼為 {0}，錯誤碼為：{1}

# CDISP9242E
source: The parameter value is missing a SPL expression tree.
de: Im Parameterwert fehlt ein SPL-Ausdrucksbaum.
es: En el valor de parámetro falta un árbol de expresiones SPL.
ko: 매개변수 값에서 SPL 표현식 트리가 누락되었습니다.
pt_br: O valor de parâmetro requer uma árvore de expressão SPL.
zh_tw: 參數值遺漏了 SPL 表示式樹狀結構。

# CDISP9243E
source: The {0} parameter is not supported in a consistent region.
de: Der Parameter {0} wird in einer konsistenten Region nicht unterstützt.
es: El parámetro {0} no está soportado en una región coherente.
ko: {0} 매개변수는 일관성 있는 영역에서 지원되지 않습니다.
pt_br: O parâmetro {0} não é suportado em uma região consistente.
zh_tw: {0} 參數在一致區域中不受支援。

# CDISP9244E
source: A FileSource operator with an input port cannot be the start of a consistent region.
de: Ein Dateiquellenoperator (FileSource) mit einem Eingabeport kann nicht der Anfang einer konsistenten Region sein.
es: Un operador FileSource con un puerto de entrada no puede ser el inicio de una región coherente.
ko: 입력 포트가 있는 FileSource 연산자는 일관성 있는 영역의 시작이 될 수 없습니다.
pt_br: Um operador FileSource com uma porta de entrada não pode ser o início de uma região consistente.
zh_tw: 具有輸入埠的 FileSource 運算子不能是一致區域的開頭。

# CDISP9245E
source: The {0} operator cannot participate in a consistent region. It must be annotated with the \@autonomous annotation.
de: Der Operator {0} kann nicht an einer konsistenten Region mitwirken. Er muss mit der Annotation \@autonomous versehen werden.
es: El operador {0} no puede participar en una región coherente. Debe anotarse con la anotación \@autonomous.
ko: {0} 연산자는 일관성 있는 영역에 참여할 수 없습니다. 여기에 \@autonomous 어노테이션이 있어야 합니다.
pt_br: O operador {0} não pode participar de uma região consistente. Ele deve ser indicado com a anotação \@autonomous.
zh_tw: {0} 運算子不能參與一致區域。必須使用 \@autonomous 註釋對其進行標註。

# CDISP9246E
source: The writeStateHandlerCallbacks parameter not supported with format {0}.
de: Der Parameter ''writeStateHandlerCallbacks'' wird mit dem {0}-Format nicht unterstützt.
es: El parámetro writeStateHandlerCallbacks no está soportado con el formato {0}.
ko: writeStateHandlerCallbacks 매개변수는 형식 {0}에 대해 지원되지 않습니다.
pt_br: O parâmetro writeStateHandlerCallbacks não é suportado com formato {0}.
zh_tw: writeStateHandlerCallbacks 參數不支援格式 {0}。

# CDISP9247E
source: The truncateOnReset parameter is not supported outside of a consistent region.
de: Der Parameter ''truncateOnReset'' wird außerhalb einer konsistenten Region nicht unterstützt.
es: El parámetro truncateOnReset no está soportado fuera de una región coherente.
ko: truncateOnReset 매개변수는 일관성 있는 영역 외부에서 지원되지 않습니다.
pt_br: O parâmetro truncateOnReset não é suportado fora de uma região consistente.
zh_tw: truncateOnReset 參數在一致區域外部不受支援。

# CDISP9248E
source: The truncateOnReset parameter is not supported when {0} closeMode is set.
de: Der Parameter ''truncateOnReset'' wird bei ''{0} closeMode'' nicht unterstützt.
es: El parámetro truncateOnReset no está soportado cuando está establecido {0} closeMode.
ko: {0} closeMode가 설정된 경우 truncateOnReset 매개변수는 지원되지 않습니다.
pt_br: O parâmetro truncateOnReset não é suportado quando closeMode {0} estiver configurado.
zh_tw: 設定了 {0} closeMode 時，truncateOnReset 參數不受支援。

# CDISP9250E
source: The {0} operator cannot be a start operator of a consistent region.
de: Der Operator {0} kann nicht der Startoperator einer konsistenten Region sein.
es: El operador {0} no puede ser un operador de inicio de una región coherente.
ko: {0} 연산자는 일관성 있는 영역의 시작 연산자가 될 수 없습니다.
pt_br: O operador {0} não pode ser um operador de início de uma região consistente.
zh_tw: {0} 運算子不能是一致區域的起始運算子。

# CDISP9251W
source: A Buffer operator is not in an consistent region.
de: Ein Operator ''Buffer'' befindet sich nicht in einer konsistenten Region.
es: Un operador de almacenamiento intermedio no está en una región coherente.
ko: Buffer 연산자는 일관성 있는 영역에 포함되어 있지 않습니다.
pt_br: Um operador de Buffer não está em uma região consistente.
zh_tw: 「緩衝區」運算子不在一致區域中。

# CDISP9252I
source: This is a placeholder for the spl-app-info utility
de: Dies ist ein Platzhalter für das Dienstprogramm spl-app-info.
es: Este es un marcador para el programa de utilidad spl-app-info
ko: 이는 spl-app-info 유틸리티에 대한 플레이스홀더입니다.
pt_br: Este é um item temporário para o utilitário spl-app-info
zh_tw: 這是 spl-app-info 公用程式的位置保留元

# CDISP9253W
source: The triggerCount parameter must be set when Beacon is in an operator driven consistent region.
de: Der Parameter ''triggerCount'' muss festgelegt werden, wenn Beacon sich in einer operatorgesteuerten konsistenten Region befindet.
es: El parámetro triggerCount debe estar establecido cuando Beacon está en una región coherente controlada por operador.
ko: Beacon이 연산자 구동 일관성 있는 영역인 경우에는 triggerCount 매개변수를 설정해야 합니다.
pt_br: O parâmetro triggerCount deve ser configurado quando o Beacon estiver em uma região consistente acionada por operador.
zh_tw: 當「引標」位於運算子驅動的一致區域中時，必須設定 triggerCount 參數。

# CDISP9254W
source: The triggerCount parameter can be set only when Beacon is in an operator driven consistent region.
de: Der Parameter ''triggerCount'' kann nur festgelegt werden, wenn Beacon sich in einer operatorgesteuerten konsistenten Region befindet.
es: El parámetro triggerCount solo se puede establecer cuando Beacon está en una región coherente controlada por operador.
ko: triggerCount 매개변수는 Beacon이 연산자 구동 일관성 있는 영역인 경우에만 설정할 수 있습니다.
pt_br: O parâmetro triggerCount pode ser configurado somente quando o Beacon estiver em uma região consistente acionada por operador.
zh_tw: 僅當「引標」位於運算子驅動的一致區域中時，才可以設定 triggerCount 參數。

# CDISP9255E
source: DirectoryScan operator with parameter moveToDirectory is not supported in a consistent region with a periodic trigger.
de: Operator DirectoryScan mit dem Parameter ''moveToDirectory'' wird in einer konsistenten Region mit einem periodischen Trigger nicht unterstützt.
es: El operador DirectoryScan con el parámetro moveToDirectory no está soportado en una región coherente con un desencadenante periódico.
ko: 매개변수 moveToDirectory를 포함하는 DirectoryScan 연산자는 주기적 트리거가 있는 일관성 있는 영역에서 지원되지 않습니다.
pt_br: O operador DirectoryScan com o parâmetro moveToDirectory não é suportado em uma região consistente com um acionador periódico.
zh_tw: 在具有定期觸發程式的一致區域中，不支援具有參數 moveToDirectory 的 DirectoryScan 運算子。

# CDISP9256W
source: The --checkpoint-directory and -K options of the sc command are deprecated.
de: Die Optionen --checkpoint-directory und -K des Befehls sc werden nicht weiter unterstützt.
es: Las opciones --checkpoint-directory y -K del mandato sc están en desuso.
ko: sc 명령의 --checkpoint-directory 및 -K 옵션은 더 이상 사용되지 않습니다.
pt_br: As opções --checkpoint-directory e -K do comando sc foram descontinuadas.
zh_tw: sc 指令的 --checkpoint-directory 及 -K 選項已遭到淘汰。

# CDISP9257E
source: The ''block'' format is not supported for a Parse operator in a consistent region.
de: Das Format ''block'' wird für einen Operator Parse in einer konsistenten Region nicht unterstützt.
es: El formato de ''bloque'' no está soportado para un operador de análisis en una región coherente.
ko: ''block'' 형식은 일관성 있는 영역의 Parse 연산자에 대해 지원되지 않습니다.
pt_br: O formato ''bloco'' não é suportado para um operador de análise em uma região consistente.
zh_tw: 在一致區域中，「剖析」運算子不支援 ''block'' 格式。

# CDISP9258E
source: The aggregateEvictedPartitions parameter is valid only with tumbling windows.
de: Der Parameter ''aggregateEvictedPartitions'' ist nur mit Tumbling Windows gültig.
es: El parámetro aggregateEvictedPartitions solo es válido con ventanas en movimiento.
ko: aggregateEvictedPartitions 매개변수는 텀블링 창에 대해서만 유효합니다.
pt_br: O parâmetro aggregateEvictedPartitions é válido somente com janelas rolantes.
zh_tw: aggregateEvictedPartitions 參數僅適用於翻轉視窗。

# CDISP9259E
source: The aggregateEvictedPartitions parameter is valid only with a tumbling window with a partition eviction specification.
de: Der Parameter ''aggregateEvictedPartitions'' ist nur mit einem Tumbling Window mit einer Partitionsbereinigungsspezifikation gültig.
es: El parámetro aggregateEvictedPartitions solo es válido con una ventana en movimiento con una especificación de desalojo de partición.
ko: aggregateEvictedPartitions 매개변수는 파티션 제거 지정이 있는 텀블링 창에 대해서만 유효합니다.
pt_br: O parâmetro aggregateEvictedPartitions é válido somente com uma janela rolante com uma especificação de desocupação de partição.
zh_tw: aggregateEvictedPartitions 參數僅適用於具有分割區收回規格的翻轉視窗。

# CDISP9262E
source: The following attribute name in the tuple literal is not valid: {0}.
de: Der folgende Attributname im Zeichenfolgeliteral ist nicht gültig: {0}.
es: El nombre de atributo siguiente en el literal de tupla no es válido: {0}.
ko: 튜플 리터럴에 포함된 다음 속성 이름이 유효하지 않습니다: {0}.
pt_br: O nome do atributo a seguir no literal de tupla não é válido: {0}.
zh_tw: 值組文字中的下列屬性名稱無效：{0}。

# CDISP9263E
source: The following attribute name in the tuple literal appears more than once: {0}.
de: Der folgende Attributname im Tupelliteral kommt mehrmals vor: {0}.
es: El nombre de atributo siguiente en el literal de tupla aparece más de una vez: {0}.
ko: 튜플 리터럴에 포함된 다음 속성 이름이 1번 이상 표시됩니다: {0}.
pt_br: O nome do atributo a seguir no literal de tupla aparece mais de uma vez: {0}.
zh_tw: 值組文字中的下列屬性名稱出現多次：{0}。

# CDISP9264E
source: The annotation is not valid. The elements of an annotation must be attribute assignments in the following form: attribute = expression.
de: Die Annotation ist nicht gültig. Die Elemente einer Annotation müssen Attributzuweisungen im folgenden Format sein: Attribut = Ausdruck.
es: La anotación no es válida. Los elementos de una anotación deben ser asignaciones de atributos con el formato siguiente: atributo = expresión.
ko: 어노테이션이 유효하지 않습니다. 어노테이션의 요소는 속성 = 표현식 양식의 속성 지정이어야 합니다.
pt_br: A anotação não é válida. Os elementos de uma anotação devem ser designações de atributo no seguinte formato: atributo = expressão.
zh_tw: 註釋無效。註釋的元素必須是採用下列形式的屬性指派：屬性 = 表示式。

# CDISP9265E
source: The {0} operator does not allow both the {1} parameter and the {2} parameter to be set.
de: Für den Operator {0} kann nicht sowohl der Parameter {1} als auch der Parameter {2} festgelegt werden.
es: El operador {0} no permite que estén establecidos ambos parámetros, {1} y {2}.
ko: {0} 연산자는 {1} 매개변수와 {2} 매개변수를 둘 다 설정하는 것을 허용하지 않습니다.
pt_br: O operador {0} não permite que os parâmetros {1} e {2} sejam configurados.
zh_tw: {0} 運算子不容許同時設定 {1} 參數和 {2} 參數。

# CDISP9266E
source: The ''{0}'' character is not a supported separator.
de: Das Zeichen ''{0}'' ist kein unterstütztes Trennzeichen.
es: El carácter ''{0}'' no es un separador soportado.
ko: ''{0}'' 문자는 지원되는 구분자가 아닙니다.
pt_br: O caractere ''{0}'' não é um separador suportado.
zh_tw: ''{0}'' 字元不是受支援的分隔字元。

# CDISP9267I
source: Generating Java template code for {0}.
de: Java-Vorlagencode für {0} wird generiert.
es: Generando código de plantilla de Java para {0}.
ko: {0}의 Java 템플리트 코드를 생성 중입니다.
pt_br: Gerando código modelo de Java para {0}.
zh_tw: 正在產生 {0} 的 Java 範本程式碼。

# CDISP9268E
source: Failed to run generation of Java template code
de: Generieren des Java-Vorlagencodes ist fehlgeschlagen
es: Ha fallado la ejecución de generación de código de plantilla de Java
ko: Java 템플리트 코드의 생성을 실행하는 데 실패함
pt_br: Falha ao executar a geração do cógido de modelo Java
zh_tw: 無法執行 Java 範本程式碼的產生

# CDISP9269E
source: Error generation Java template code.
de: Fehler beim Generieren des Java-Vorlagencodes.
es: Error en la generación de código de plantilla de Java.
ko: Java 템플리트 코드 생성 중 오류가 발생했습니다.
pt_br: Erro ao gerar o código de modelo Java
zh_tw: 產生 Java 範本程式碼時發生錯誤

# CDISP9270E
source: Operator invocation error for Java primitive {0}
de: Fehler beim Aufrufen des Operators für Java-Basiselement {0}
es: Error en la invocación de operador para primitiva de Java {0}
ko: Java 기본 {0}의 연산자 호출 오류
pt_br: Erro de chamada do operador para primitivas em Java {0}
zh_tw: Java 初始 {0} 的運算子呼叫錯誤

# CDISP9271E
source: The ''blockSize'' FileSource parameter must be set when the ''format'' parameter is set to ''block'' and the ''hotFile'' option is set.
de: Der FileSource-Parameter ''blockSize'' muss festgelegt werden, wenn der Parameter ''format'' auf ''block'' gesetzt ist und die Option ''hotFile'' festgelegt wurde.
es: El parámetro de FileSource ''blockSize'' se debe establecer cuando el parámetro ''format'' se establece en ''block'' la opción ''hotFile'' está establecida.
ko: ''format'' 매개변수가 ''block''으로 설정되고 ''hotFile'' 옵션이 설정된 경우 ''blockSize'' FileSource 매개변수를 설정해야 합니다.
pt_br: O parâmetro FileSource ''blockSize'' deve ser configurado quando o parâmetro ''format'' estiver configurado para ''block'' e a opção ''hotFile'' estiver configurada.
zh_tw: 當 ''format'' 參數設為 ''block''，而且已設定 ''hotFile'' 選項時，必須設定 FileSource 參數 ''blockSize''。

# CDISP9272E
source: A tuple was supplied in a call to the ''submit'' function that is not compatible with the type of the specified port.\n\tThe type of the tuple was {0} and the type of the specified port is {1}.
de: In einem Aufruf der Funktion ''submit'' wurde ein Tupel übergeben, das nicht mit dem Typ des angegebenen Ports kompatibel ist.\n\tDer Typ des Tupels war {0} und der Typ des angegebenen Ports ist {1}.
es: Se ha proporcionado una tupla en una llamada a la función ''submit'' que no es compatible con el tipo de puerto especificado.\n\tEl tipo de tupla era {0} y el tipo de puerto especificado es {1}.
ko: 지정된 포트 유형과 호환되지 않는 ''submit'' 함수에 대한 호출에서 튜플이 제공되었습니다.\n\t튜플의 유형은 {0}이며 지정된 포트의 유형은 {1}입니다.
pt_br: Uma tupla foi fornecida em uma chamada para a função ''envio'', que não é compatível com o tipo da porta especificada.\n\tO tipo da tupla era {0} e o tipo da porta especificada é {1}.
zh_tw: 在 ''submit'' 函數的呼叫中提供的值組，與所指定埠的類型不相容。\n\t該值組的類型為 {0}，所指定埠的類型為 {1}。

# CDISP9273E
source: The following host pool could not be found in the main composite: {0}
de: Der folgende Host-Pool wurde im Hauptverbund nicht gefunden: {0}
es: La agrupación de hosts siguiente no se ha podido encontrar en el compuesto principal: {0}
ko: 기본 복합에서 호스트 풀 {0}을(를) 찾을 수 없습니다.
pt_br: O grupo de host a seguir não foi localizado no composto principal: {0}
zh_tw: 在主要複合項中找不到下列主機儲存區：{0}

# CDISP9274E
source: The type of the attribute {0}, whose type is {1} is not compatible with the return type of the output function {2}, whose type is {3}.
de: Der Typ des Attributs {0} ({1}) ist nicht mit dem Rückgabetyp der Ausgabefunktion {2} ({3}) kompatibel.
es: El tipo del atributo {0} cuyo tipo es {1} no es compatible con el tipo de retorno de la función de salida {2} cuyo tipo es {3}.
ko: 유형이 {1}인 {0} 속성의 유형이 유형이 {3}인 출력 함수 {2}의 리턴 유형과 호환되지 않습니다.
pt_br: O tipo do atributo {0}, cujo tipo é {1}, não é compatível com o tipo de retorno da função de saída {2}, cujo tipo é {3}.
zh_tw: 屬性 {0} 的類型 {1} 與輸出函數 {2} 的傳回類型 {3} 不相容。

# CDISP9999E
source: This is a test message - String: {0} - Integer: {1,number,0} - Formatted Integer: {2,number} - Real: {3,number,0.##########} - Formatted Real: {4,number} - Date: {5,date} - Time: {6,time} - DateTime: {7,date} {7,time}.
es: Este es un mensaje de prueba - Serie: {0} - Entero: {1,número,0} - Entero formateado: {2,número} - Real: {3,número,0.##########} - Real formateado: {4,número} - Fecha: {5,fecha} - Hora: {6,hora} - Fecha y hora: {7,fecha} {7,hora}.
pt_br: Esta é uma mensagem de teste - String: {0} - Integer: {1,number,0} - Formatted Integer: {2,number} - Real: {3,number,0.##########} - Formatted Real: {4,number} - Date: {5,date} - Time: {6,time} - DateTime: {7,date} {7,time}.
zh_tw: 這是測試訊息 - 字串：{0} - 整數：{1,number,0} - 格式化整數：{2,number} - 實數：{3,number,0.##########} - 格式化實數：{4,number} - 日期：{5,date} - 時間：{6,time} - 日期時間：{7,date} {7,time}。

# CDISP9999E
source: {0} {1} {2,number,0} {0} {2,number,0} {1}.
es: {0} {1} {2,número,0} {0} {2,número,0} {1}.
