Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0756W
source: The {0} variable is written here and read or written elsewhere in the output clause.
de: Die Variable {0} wird hier geschrieben und an anderer Stelle der Klausel ''output'' gelesen oder geschrieben.
es: La variable {0} está escrita aquí y se lee o escribe en cualquier lugar de la cláusula de salida.
ko: {0} 변수가 여기 쓰였으며 그 후 output 절의 다른 위치에서 읽히거나 쓰였습니다.
pt_br: A variável {0} está escrita aqui e é lida ou gravada em outro lugar na cláusula de saída.
zh_tw: 在這裡寫入 {0} 變數，並在 output 子句中的其他位置讀取或寫入該變數。

# CDISP0757E
source: The {0} variable is written here and read or written elsewhere in the output clause.
de: Die Variable {0} wird hier geschrieben und an anderer Stelle der Klausel ''output'' gelesen oder geschrieben.
es: La variable {0} está escrita aquí y se lee o escribe en cualquier lugar de la cláusula de salida.
ko: {0} 변수가 여기 쓰였으며 그 후 output 절의 다른 위치에서 읽히거나 쓰였습니다.
pt_br: A variável {0} está escrita aqui e é lida ou gravada em outro lugar na cláusula de saída.
zh_tw: 在這裡寫入 {0} 變數，並在 output 子句中的其他位置讀取或寫入該變數。

# CDISP0758I
source: Select the behavior the compiler will use when it encounters side effects in the output clause of an operator invocation.
de: Das Verhalten auswählen, das der Compiler verwendet, wenn er auf Nebeneffekte in der Klausel ''output'' eines Operatoraufrufs trifft.
es: Seleccione el comportamiento que utilizará el compilador cuando encuentre efectos secundarios en la cláusula de salida de una invocación de operador.
ko: 컴파일러가 연산자 호출의 output 절에서 부가작용을 발견하는 경우 사용할 동작을 선택합니다.
pt_br: Selecione o comportamento que o compilador usará quando encontrar efeitos colaterais na cláusula de saída de uma chamada do operador.
zh_tw: 選取在運算子呼叫的 output 子句中遇到負面影響時，編譯器將具有的行為。

# CDISP0759W
source: The {0} toolkit was ignored because the name of the toolkit is the same as the name of the application.
de: Das Toolkit {0} wurde ignoriert, weil der Name des Toolkits mit dem Namen der Anwendung übereinstimmt.
es: El kit de herramientas {0} se ha ignorado porque el nombre del kit de herramientas es el mismo que el de la aplicación.
ko: {0} 툴킷의 이름이 애플리케이션의 이름과 동일하여 이 툴킷이 무시되었습니다.
pt_br: O kit de ferramentas {0} foi ignorado, pois o nome do kit de ferramentas é igual ao nome do aplicativo.
zh_tw: 已忽略 {0} 工具箱，因為該工具箱的名稱與應用程式的名稱相同。

# CDISP0760W
source: The {0} namespace is not defined in the use directive.
de: Der Namensbereich {0} ist in der Verwendungsanweisung nicht definiert.
es: El espacio de nombres {0} no está definido en la directiva de uso.
ko: {0} 네임스페이스가 use 지시문에 정의되어 있지 않습니다.
pt_br: O namespace {0} não está definido na diretiva de uso.
zh_tw: {0} 名稱空間未定義於 use 指引中。

# CDISP0761I
source: Name of the output file.
de: Name der Ausgabedatei.
es: Nombre del archivo de salida.
ko: 출력 파일의 이름입니다.
pt_br: Nome do arquivo de saída.
zh_tw: 輸出檔的名稱。

# CDISP0762I
source: One or more trigger expressions.
de: Mindestens ein Triggerausdruck.
es: Una o varias expresiones de activación.
ko: 하나 이상의 trigger 표현식입니다.
pt_br: Uma ou mais expressões do acionador.
zh_tw: 一個以上的觸發程式表示式。

# CDISP0763I
source: Flatten the attributes, the elements, or neither.
de: Attribute, Elemente oder nichts abflachen.
es: Presente los atributos, los elementos o ninguno.
ko: 속성 또는 요소를 단일 배열로 변환(flatten)하거나 둘 다 변환하지 않습니다.
pt_br: Comprima os atributos, os elementos ou nenhum deles.
zh_tw: 壓縮屬性或元素，或者都不壓縮。

# CDISP0764I
source: Name to use for the attributes map.
de: Für die Attributmap zu verwendender Name.
es: Nombre para utilizar para la correlación de atributos.
ko: 속성 맵에 사용할 이름입니다.
pt_br: Nome a ser usado para o mapa de atributos.
zh_tw: 要用於屬性對映的名稱。

# CDISP0765I
source: Name to be used for the content.
de: Für den Inhalt zu verwendender Name.
es: Nombre para utilizar para el contenido.
ko: 컨텐츠에 사용할 이름입니다.
pt_br: Nome a ser usado para o conteúdo.
zh_tw: 要用於內容的名稱。

# CDISP0766I
source: Specifies whether output clauses need to be generated.
de: Gibt an, ob output-Klauseln generiert werden müssen.
es: Especifica si se deben generar cláusulas de salida.
ko: output 절의 생성 여부를 지정합니다.
pt_br: Especifica se as cláusulas de saída precisam ser geradas.
zh_tw: 指定是否需要產生 output 子句。

# CDISP0767I
source: Specifies if an xsd file needs to be generated, and specifies the name of the file.
de: Gibt an, ob eine XSD-Datei generiert werden muss, und gibt den Namen der Datei an.
es: Especifica si se debe generar un archivo xsd, y especifica el nombre del archivo.
ko: xsd 파일의 생성 여부와 파일의 이름을 지정합니다.
pt_br: Especifica se um arquivo XSD precisa ser gerado e especifica o nome do arquivo.
zh_tw: 指定是否需要產生 XSD 檔案，並指定該檔案的名稱。

# CDISP0768E
source: The input XML file was not specified.
de: Die Eingabe-XML-Datei wurde nicht angegeben.
es: El archivo XML de entrada no se ha especificado.
ko: 입력 XML 파일이 지정되지 않았습니다.
pt_br: O arquivo XML de entrada não foi especificado.
zh_tw: 未指定輸入 XML 檔。

# CDISP0769E
source: At least one trigger expression must be specified.
de: Mindestens ein Triggerausdruck muss angegeben werden.
es: Al menos, se debe especificar una expresión de activación.
ko: 하나 이상의 trigger 표현식을 지정해야 합니다.
pt_br: Pelo menos uma expressão do acionador deve ser especificada.
zh_tw: 必須指定至少一個觸發程式表示式。

# CDISP0770E
source: The value for the {0} option is not valid. The value must be either {1} or {2}.
de: Der Wert für die Option {0} ist nicht gültig. Der Wert muss {1} oder {2} sein.
es: El valor para la opción {0} no es válida. El valor debe ser {1} o {2}.
ko: {0} 옵션의 값이 유효하지 않습니다. 이 값은 {1} 또는 {2}이(가) 되어야 합니다.
pt_br: O valor para a opção {0} não é válido. O valor deve ser {1} ou {2}.
zh_tw: {0} 選項的值無效。該值必須是 {1} 或 {2}。

# CDISP0771E
source: The {0} attribute name that is specified for the {1} option must be a valid SPL attribute name.
de: Der Attributname {0}, der für die Option {1} angegeben ist, muss ein gültiger SPL-Attributname sein.
es: El nombre de atributo {0} que se ha especificado para la opción {1} debe ser un nombre de atributo SPL válido.
ko: {1} 옵션에 대해 지정되는 {0} 속성 값은 유효한 SPL 속성 이름이어야 합니다.
pt_br: O nome do atributo {0} que é especificado para a opção {1} deve ser um nome de atributo SPL válido.
zh_tw: 對 {1} 選項指定的 {0} 屬性名稱必須是有效的 SPL 屬性名稱。

# CDISP0772E
source: The {0} trigger is not valid.
de: Der Trigger {0} ist nicht gültig.
es: El desencadenante {0} no es válido.
ko: {0} 트리거가 유효하지 않습니다.
pt_br: O acionador {0} não é válido.
zh_tw: {0} 觸發程式無效。

# CDISP0773E
source: The {0} XML file does not exist.
de: Die XML-Datei {0} ist nicht vorhanden.
es: El archivo XML {0} no existe.
ko: {0} XML 파일이 존재하지 않습니다.
pt_br: O arquivo XML {0} não existe.
zh_tw: {0} XML 檔不存在。

# CDISP0774W
source: The attributes of the {0} element cannot be flattened because the {1} attribute conflicts with a nested element of the same name.
de: Die Attribute des Elements {0} können nicht abgeflacht werden, weil das Attribut {1} mit einem gleichnamigen verschachtelten Element in Konflikt steht.
es: Los atributos del elemento {0} no se pueden presentar porque el atributo {1} entra en conflicto con un elemento anidado del mismo nombre.
ko: {1} 속성이 이름이 같은 중첩된 요소와 충돌하여 {0} 요소를 단일 배열로 변환(flatten)할 수 없습니다.
pt_br: Os atributos do elemento {0} não podem ser mesclados, pois o atributo {1} conflita com um elemento aninhado com o mesmo nome.
zh_tw: 無法壓縮 {0} 元素的屬性，因為 {1} 屬性與某個具有相同名稱的巢狀元素相衝突。

# CDISP0775E
source: The output file was not specified.
de: Die Ausgabedatei wurde nicht angegeben.
es: No se ha especificado el archivo de salida.
ko: 출력 파일이 지정되지 않았습니다.
pt_br: O arquivo de saída não foi especificado.
zh_tw: 未指定輸出檔。

# CDISP0776E
source: No elements were found under the {0} trigger expression. Ensure that the trigger expression is valid for the given XML.
de: Keine Elemente unter dem Triggerausdruck {0} gefunden. Stellen Sie sicher, dass der Triggerausdruck für das angegebene XML gültig ist.
es: No se han encontrado elementos bajo la expresión de desencadenante {0}. Asegúrese de que la expresión de desencadenante es válida para el XML proporcionado.
ko: {0} trigger 표현식에서 요소를 찾지 못했습니다. 해당 XML에 대해 trigger 표현식이 유효한지 확인하십시오.
pt_br: Nenhum elemento foi localizado na expressão do acionador {0}. Assegure-se de que a expressão do acionador seja válida para o XML fornecido.
zh_tw: 在 {0} 觸發程式表示式下面，找不到任何元素。請確保該觸發程式表示式適用於給定的 XML。

# CDISP0777E
source: An int64 literal value is required in the subscription, but the {0} literal value was found.
de: Ein int64-Literalwert ist in der Subskription erforderlich, jedoch wurde der Literalwert {0} gefunden.
es: Es necesario un valor literal int64 en la suscripción, pero se ha encontrado el valor literal {0}.
ko: 서브스크립션에서 int64 리터럴 값을 필요로 하지만 {0} 리터럴 값을 발견했습니다.
pt_br: Um valor literal int64 é necessário na assinatura, mas o valor literal {0} foi localizado.
zh_tw: 訂閱中需要一個 int64 文字值，但卻找到 {0} 文字值。

# CDISP0778E
source: The {0} literal is not valid for the declared type, which is {1}. The error is: {2}.
de: Das Literal {0} ist für den deklarierten nicht gültig, der {1} ist. Fehler: {2}.
es: El literal {0} no es válido para el tipo declarado, que es {1}. El error es: {2}.
ko: {0} 리터럴은 선언된 유형인 {1}에 대해 유효하지 않습니다. 오류는 {2}입니다.
pt_br: O literal {0} não é válido para o tipo declarado, que é {1}. O erro é: {2}.
zh_tw: {0} 文字不適用於已宣告的類型，即 {1}。錯誤為：{2}。

# CDISP0779E
source: The port number {0} in the call to submit is not a valid output port.
de: Die Portnummer {0} im zu übergebenden Aufruf ist kein gültiger Ausgabeport.
es: El número de puerto {0} en la llamada para enviar no es un puerto de salida válido.
ko: 제출을 위한 호출의 포트 번호 {0}이(가) 유효한 출력 포트가 아닙니다.
pt_br: O número da porta {0} na chamada para envio não é uma porta de saída válida.
zh_tw: 提交呼叫中的埠號 {0} 不是有效的輸出埠。

# CDISP0780E
source: The return statement in the logic of an onTuple, onPunct, or onProcess clause must not use a return value.
de: Die Anweisung ''return'' in der Logik einer Klausel ''onTuple'', ''onPunct'' oder ''onProcess'' darf keinen Rückgabewert verwenden.
es: La sentencia de retorno en la lógica de una cláusula onTuple, onPunct u onProcess no debe utilizar un valor de retorno.
ko: onTuple, onPunct 또는 onProcess 절에 있는 로직의 return문은 리턴 값을 사용하지 않아야 합니다.
pt_br: A instrução de retorno na lógica de uma cláusula onTuple, onPunct ou onProcess não deve usar um valor de retorno.
zh_tw: onTuple、onPunct 或 onProcess 子句邏輯中的 return 陳述式不得使用回覆值。

# CDISP0781W
source: The logLevel config value is different from the tracing config value. The logLevel config value is ignored.
de: Der Wert für ''config logLevel'' unterscheidet sich vom Wert für ''config tracing''. Der Wert für ''config logLevel'' wird ignoriert.
es: El valor de config logLevel es diferente del valor de config de rastreo. Se ignora el valor de config logLevel.
ko: logLevel 구성 값이 추적 구성 값과 다릅니다. logLevel 구성 값이 무시됩니다.
pt_br: O valor de configuração logLevel é diferente do valor de configuração de rastreio. O valor de configuração logLevel é ignorado.
zh_tw: logLevel 配置值與追蹤配置值不同。將忽略 logLevel 配置值。

# CDISP0782I
source: usage: spl-schema-from-xml -h, --help | \\\n\t[--attributesName=<name>] [-c, --outputClause] [--composite=<name>] \\\n\t[-f, --flatten=<attributes | elements | none>] \\\n\t[--ignoreNamespaces] [--mainComposite=<compositeName>] [--namespace=<namespace>] -o, --outfile=<filename> \\\n\t[--textName=<name>] -t, --trigger=<triggerXPath[,...]> [-x, --xsd=<fileName>] <xmlFileName> \\\n\tGenerate artifacts for use with the XMLParse operator.
de: Syntax: spl-schema-from-xml -h, --help | \\\n\t[--attributesName=<Name>] [-c, --outputClause] [--composite=<Name>] \\\n\t[-f, --flatten=<Attribute | Elemente | none>] \\\n\t[--ignoreNamespaces] [--mainComposite=<Verbundname>] [--namespace=<Namensbereich>] -o, --outfile=<Dateiname> \\\n\t[--textName=<Name>] -t, --trigger=<Trigger-XPath[,...]> [-x, --xsd=<Dateiname>] <xmlFileName> \\\n\tArtefakte zur Verwendung mit dem Operator XMLParse generieren.
es: uso: spl-schema-from-xml -h, --help | \\\n\t[--attributesName=<name>] [-c, --outputClause] [--composite=<name>] \\\n\t[-f, --flatten=<attributes | elements | none>] \\\n\t[--ignoreNamespaces] [--mainComposite=<compositeName>] [--namespace=<namespace>] -o, --outfile=<filename> \\\n\t[--textName=<name>] -t, --trigger=<triggerXPath[,...]> [-x, --xsd=<fileName>] <xmlFileName> \\\n\tGenerate artifacts for use with the XMLParse operator.
ko: 사용법: spl-schema-from-xml -h, --help | \\\n\t[--attributesName=<name>] [-c, --outputClause] [--composite=<name>] \\\n\t[-f, --flatten=<attributes | elements | none>] \\\n\t[--ignoreNamespaces] [--mainComposite=<compositeName>] [--namespace=<namespace>] -o, --outfile=<filename> \\\n\t[--textName=<name>] -t, --trigger=<triggerXPath[,...]> [-x, --xsd=<fileName>] <xmlFileName> \\\n\tXMLParse 연산자와 함께 사용할 아티팩트를 생성합니다.
pt_br: uso: spl-schema-from-xml -h, --help | \\\n\t[--attributesName=<name>] [-c, --outputClause] [--composite=<name>] \\\n\t[-f, --flatten=<attributes | elements | none>] \\\n\t[--ignoreNamespaces] [--mainComposite=<compositeName>] [--namespace=<namespace>] -o, --outfile=<filename> \\\n\t[--textName=<name>] -t, --trigger=<triggerXPath[,...]> [-x, --xsd=<fileName>] <xmlFileName> \\\n\tGere artefatos para uso com o operador XMLParse.
zh_tw: 用法：spl-schema-from-xml -h, --help | \\\n\t[--attributesName=<name>] [-c, --outputClause] [--composite=<name>] \\\n\t[-f, --flatten=<attributes | elements | none>] \\\n\t[--ignoreNamespaces] [--mainComposite=<compositeName>] [--namespace=<namespace>] -o, --outfile=<filename> \\\n\t[--textName=<name>] -t, --trigger=<triggerXPath[,...]> [-x, --xsd=<fileName>] <xmlFileName> \\\n\t產生構件以與 XMLParse 運算子搭配使用。

# CDISP0783E
source: The {0} function name conflicts with a C++ keyword.
de: Der Funktionsname {0} steht in Konflikt mit einem C++-Schlüsselwort.
es: El nombre de función {0} entra en conflicto con una palabra clave de C++.
ko: {0} 함수 이름이 C++ 키워드와 충돌합니다.
pt_br: O nome da função {0} conflita com uma palavra-chave C++.
zh_tw: {0} 函數名稱與某個 C++ 關鍵字相衝突。

# CDISP0784I
source: While the XML was processed, the compiler encountered element or attribute names that result in SPL attribute names that are not supported. An underscore character (__) was prepended to the SPL attribute name to make it a supported name.
de: Während der XML-Verarbeitung traf der Compiler auf Element- oder Attributnamen, die zu nicht unterstützten SPL-Attributnamen führen. Ein Unterstreichungszeichen (__) wurde dem SPL-Attributnamen vorangestellt, um ihn zu einem unterstützten Namen zu machen.
es: Mientras se procesaba el XML, el compilador encontró nombres de elemento o atributo que generan nombres de atributo SPL que no están soportados. Se antepone un carácter de subrayado (__) al nombre de atributo SPL para convertirlo en un nombre soportado.
ko: XML이 처리되는 중에 컴파일러에서 지원되지 않는 SPL 속성 이름을 발생시키는 요소 또는 속성 이름을 발견했습니다. 이 SPL 속성 이름을 지원되는 이름으로 변경하기 위해 밑줄 문자(__)가 이 이름 앞에 추가되었습니다.
pt_br: Enquanto o XML era processado, o compilador encontrou nomes de elemento ou de atributo que resultam em nomes de atributos SPL que não são suportados. Um caractere sublinhado (__) foi anexado ao nome do atributo SPL para torná-lo um nome suportado.
zh_tw: 處理 XML 時，編譯器遇到了會產生不受支援之 SPL 屬性名稱的元素或屬性名稱。已將底線字元 (__) 附加到 SPL 屬性名稱的前面，以將其變成受支援的名稱。

# CDISP0785E
source: The {0} identifier is a reserved word, and cannot be used as an argument to the {1} option.
de: Die Kennung {0} ist ein reserviertes Wort und kann nicht als Argument für die Option {1} verwendet werden.
es: El identificador {0} es una palabra reservada y no se puede utilizar como argumento en la opción {1}.
ko: {0} ID는 예약어이며 {1} 옵션에 대한 인수로 사용할 수 없습니다.
pt_br: O identificador {0} é uma palavra reservada e não pode ser usado como um argumento para a opção {1}.
zh_tw: {0} ID 是保留字，不能用作 {1} 選項的引數。

# CDISP0786E
source: The generation of the {0} resource bucket failed.
de: Die Generierung des Ressourcenbuckets {0} ist fehlgeschlagen.
es: La generación del grupo de recursos {0} ha fallado.
ko: {0} 자원 버킷 생성이 실패했습니다.
pt_br: A geração do depósito recurso {0} falhou.
zh_tw: {0} 資源儲存區的產生失敗。

# CDISP0787I
source: SPL types generated from {0}.
de: SPL-Typen aus {0} generiert.
es: Tipos SPL generados a partir de {0}.
ko: {0}(으)로부터 SPL 유형이 생성되었습니다.
pt_br: Tipos de SPL gerados de {0}.
zh_tw: 從 {0} 產生的 SPL 類型。

# CDISP0788I
source: SPL output clause generated from {0}.
de: SPL-Klausel ''output'' aus {0} generiert.
es: Cláusula de salida SPL generada a partir de {0}.
ko: {0}(으)로부터 SPL output 절이 생성되었습니다.
pt_br: Cláusula de saída SPL gerada de {0}.
zh_tw: 從 {0} 產生的 SPL output 子句。

# CDISP0789E
source: The JVM arguments of the {0} Java operator invocation are inconsistent with the other Java operators invocations in the same processing element.
de: Die JVM-Argumente des Java-Operatoraufrufs {0} sind mit den anderen Java-Operatoraufrufen in demselben Verarbeitungselement inkonsistent.
es: Los argumentos de la JVM de la invocación del operador Java {0} no son coherentes con las otras invocaciones de operadores Java en el mismo elemento de proceso.
ko: {0} Java 연산자 호출의 JVM 인수가 동일한 처리 요소에 있는 다른 Java 연산자와 불일치합니다.
pt_br: Os argumentos JVM da chamada do operador Java {0} estão inconsistentes com outras chamadas de operadores Java no mesmo elemento de processamento.
zh_tw: {0} Java 運算子呼叫的 JVM 引數與同一處理元素中的其他 Java 運算子呼叫不一致。

# CDISP0790E
source: The {0} name of {1} is not valid. The name must be a valid SPL identifier.
de: Der Name {0} von {1} ist nicht gültig. Der Name muss eine gültige SPL-Kennung sein.
es: El nombre {0} de {1} no es válido. El nombre debe ser un identificador SPL válido.
ko: {1}의 {0} 이름이 유효하지 않습니다. 이 이름은 유효한 SPL ID여야 합니다.
pt_br: O nome {0} de {1} não é válido. O nome deve ser um identificador SPL válido.
zh_tw: {1} 的 {0} 名稱無效。該名稱必須是有效的 SPL ID。

# CDISP0791I
source: Generate a composite skeleton with the specified name.
de: Verbundgerüst mit dem angegebenen Namen generieren.
es: Genere un esqueleto compuesto con el nombre especificado.
ko: 지정된 이름을 사용하여 복합 윤곽을 생성합니다.
pt_br: Gerar uma estrutura básica composta com o nome especificado.
zh_tw: 使用指定的名稱產生複合架構。

# CDISP0792I
source: Generate a main composite skeleton with the specified name.
de: Hauptverbundgerüst mit dem angegebenen Namen generieren.
es: Genere un esqueleto compuesto principal con el nombre especificado.
ko: 지정된 이름을 사용하여 기본 복합 윤곽을 생성합니다.
pt_br: Gerar uma estrutura básica composta principal com o nome especificado.
zh_tw: 使用指定的名稱產生主要複合架構。

# CDISP0793I
source: Specifies the namespace for the generated skeleton.
de: Gibt den Namensbereich für das generierte Gerüst an.
es: Especifica el espacio de nombres para el esqueleto generado.
ko: 생성된 윤곽의 네임스페이스를 지정합니다.
pt_br: Especifica o namespace para a estrutura básica gerada.
zh_tw: 對產生的架構指定名稱空間。

# CDISP0794W
source: The composite option is not specified. The {0} option is ignored.
de: Die Option ''composite'' wurde nicht angegeben. Die Option {0} wird ignoriert.
es: La opción compuesto no se ha especificado. Se ignora la opción {0}.
ko: 복합 옵션이 지정되지 않았습니다. {0} 옵션이 무시됩니다.
pt_br: A opção composta não é especificada. A opção {0} é ignorada.
zh_tw: 未指定複合選項。將忽略 {0} 選項。

# CDISP0795I
source: Generate the source model by using the spl-make-doc command.
de: Quellenmodell mit dem Befehl ''spl-make-doc'' generieren.
es: Genere el modelo de origen utilizando el mandato spl-make-doc.
ko: spl-make-doc 명령을 사용하여 소스 모델을 생성합니다.
pt_br: Gerar o modelo de origem usando o comando spl-make-doc.
zh_tw: 使用 spl-make-doc 指令來產生原始檔模型。

# CDISP0796E
source: The {0} SPL annotation is not a supported annotation.
de: Die SPL-Annotation {0} ist keine unterstützte Annotation.
es: La anotación SPL {0} no es una anotación soportada.
ko: {0} SPL 어노테이션은 지원되는 어노테이션이 아닙니다.
pt_br: A anotação SPL {0} não é uma anotação suportada.
zh_tw: {0} SPL 註釋不受支援。

# CDISP0797E
source: The {0} SPL annotation does not support a key that is named {1}.
de: Die SPL-Annotation {0} unterstützt keinen Schlüssel mit dem Namen {1}.
es: La anotación SPL {0} no soporta una clave que se llama {1}.
ko: {0} SPL 어노테이션이 이름이 {1}인 키를 지원하지 않습니다.
pt_br: A anotação SPL {0} não suporta uma chave que é denominada {1}.
zh_tw: {0} SPL 註釋不支援名為 {1} 的索引鍵。

# CDISP0798E
source: The {0} annotation key is used multiple times in the definition of the {1} SPL annotation.
de: Der Annotationsschlüssel {0} wird in der Definition der SPL-Annotation {1} mehrmals verwendet.
es: La clave de anotación {0} se utiliza varias veces en la definición de la anotación SPL {1}.
ko: {0} 어노테이션 키가 {1} SPL 어노테이션의 정의에서 여러 번 사용되었습니다.
pt_br: A chave de anotação {0} é usada múltiplas vezes na definição da anotação SPL {1}.
zh_tw: 在 {1} SPL 註釋的定義中，使用了 {0} 註釋索引鍵多次。

# CDISP0799E
source: The definition of the {0} SPL annotation is missing the following required key: {1}.
de: In der Definition der SPL-Annotation {0} fehlt der folgende erforderliche Schlüssel: {1}.
es: En la definición de la anotación SPL {0} falta la clave necesaria siguiente: {1}.
ko: {0} SPL 어노테이션의 정의에서 다음 필수 키가 누락되었습니다: {1}.
pt_br: A definição da anotação SPL {0} requer a chave obrigatória a seguir: {1}.
zh_tw: {0} SPL 註釋的定義遺漏了下列必要索引鍵：{1}。

# CDISP0800E
source: The compiler expects an operator or enumeration name. The {0} identifier is not an operator or enumeration in this scope.
de: Der Compiler erwartet einen Operator- oder Aufzählungsnamen. Die Kennung {0} ist in diesem Bereich kein Operator oder keine Aufzählung.
es: El compilador espera un nombre de operador o enumeración. El identificador {0} no es un operador o una enumeración en este ámbito.
ko: 컴파일러에서 연산자 또는 열거 이름을 기대했습니다. {0} ID는 이 범위에 속한 연산자 또는 열거가 아닙니다.
pt_br: O compilador espera um nome do operador ou de enumeração. O identificador {0} não é um operador ou uma enumeração neste escopo.
zh_tw: 編譯器預期一個運算子或列舉名稱。{0} ID 不是此範圍內的運算子或列舉。

# CDISP0801E
source: The {0} formal parameter cannot be used in this context because the type of the formal parameter is not attribute.
de: Der formale Parameter {0} kann in diesem Kontext nicht verwendet werden, weil der Typ des formalen Parameters nicht ''attribute'' ist.
es: El parámetro formal {0} no se puede utilizar en este contexto porque el tipo del parámetro formal no es atributo.
ko: {0} 정규 매개변수의 유형이 속성이 아니므로 이 컨텍스트에서는 이 정규 매개변수를 사용할 수 없습니다.
pt_br: O parâmetro formal {0} não pode ser usado neste contexto, pois o tipo de parâmetro formal não é um atributo.
zh_tw: 不能將 {0} 格式參數用在此環境定義中，因為該格式參數的類型不是屬性。

# CDISP0802E
source: No set of toolkits could be selected that would satisfy all dependencies.
de: Es konnte keine Gruppe von Toolkits ausgewählt werden, die alle Abhängigkeiten erfüllen.
es: No se ha podido seleccionar ningún conjunto de kits de herramientas que satisfaga todas las dependencias.
ko: 모든 종속성을 만족시키는 툴킷 세트를 선택하지 못했습니다.
pt_br: Nenhum conjunto de kits de ferramentas pode ser selecionado que satisfaria todas as dependências.
zh_tw: 無法選取將滿足所有相依關係的工具箱集。

# CDISP0803D
source: The {0} toolkit version {1} cannot be loaded because the dependencies of the toolkit are not satisfied by the {2} toolkit version {3}.
de: Das Toolkit {0} Version {1} kann nicht geladen werden, weil die Abhängigkeiten des Toolkits durch das Toolkit {2} Version {3} nicht erfüllt werden.
es: La versión del kit de herramientas {0} {1} no se puede cargar porque las dependencias del kit de herramientas no se cumplen con la versión kit de herramientas {2} {3}.
ko: {2} 툴킷 버전 {3}에서 툴킷의 종속성을 만족시키지 못해 {0} 툴킷 버전 {1}을(를) 로드할 수 없습니다.
pt_br: O kit de ferramentas {0} versão {1} não pode ser carregado, pois as dependências do kit de ferramentas não são atendidas pelo kit de ferramentas {2} versão {3}.
zh_tw: 無法載入 {0} 工具箱 {1} 版，因為 {2} 工具箱 {3} 版未滿足工具箱的相依關係。
