Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0054E
source: The {0} parameter is unknown and was not defined for the {1} operator.
de: Der Parameter {0} ist unbekannt und war für den Operator {1} nicht definiert.
es: El parámetro {0} es desconocido y no se ha definido para el operador {1}.
ko: {0} 매개변수는 알 수 없는 매개변수이며 {1} 연산자에 대해 정의되지 않았습니다.
pt_br: O parâmetro {0} é desconhecido e não foi definido para o operador {1}.
zh_tw: {0} 參數不明，並且未對 {1} 運算子進行定義。

# CDISP0056E
source: This version of the product does not support the translation of SPADE code. To translate SPADE code, use the SPADE to SPL migration tools that are available in Version 2.x of the product.
de: Diese Version des Produkts unterstützt nicht die Übersetzung von SPADE-Code. Verwenden Sie die Tools für die Migration von SPADE auf SPL, die in Version 2.x des Produkts verfügbar sind, um SPADE-Code zu übersetzen.
es: Esta versión del producto no admite la conversión del código SPADE. Para convertir código SPADE, utilices las herramientas de migración de SPADE a SPL que están disponibles en la versión 2.x del producto.
ko: 이 제품 버전은 SPADE 코드의 변환을 지원하지 않습니다. SPADE 코드를 변환하려면 제품의 버전 2.x에서 사용 가능한 SPADE 대 SPL 마이그레이션 도구를 사용하십시오.
pt_br: Esta versão do produto não suporta a conversão do código SPADE. Para converter o código SPADE, use o SPADE para ferramentas de migração SPL que estiverem disponíveis na Versão 2.x do produto.
zh_tw: 此版本的產品不支援 SPADE 程式碼的轉換。如果要轉換 SPADE 程式碼，請使用 2.x 版產品中提供的 SPADE 至 SPL 移轉工具。

# CDISP0057E
source: The trang program failed to run. The error is: {0}.
de: Das trang-Programm konnte nicht ausgeführt werden. Fehler: {0}.
es: El programa trang no se ha podido ejecutar. El error es: {0}.
ko: trang 프로그램이 실행에 실패했습니다. 오류는 {0}입니다.
pt_br: O programa trang falhou ao executar. O erro é: {0}.
zh_tw: trang 程式無法執行。錯誤為：{0}。

# CDISP0059E
source: non-xml
de: Nicht-XML
es: no xml
pt_br: não xml
zh_tw: 非 XML

# CDISP0060I
source: Ignore XML namespaces.
de: XML-Namensbereiche ignorieren.
es: Ignorar espacios de nombres XML.
ko: XML 네임스페이스를 무시합니다.
pt_br: Ignorar namespaces XML.
zh_tw: 忽略 XML 名稱空間。

# CDISP0061E
source: The {0} parameter on an Import operator must be a compile time rstring, but the following expression was specified: {1}.
de: Der Parameter {0} für einen Importoperator muss der rstring-Wert für die Kompilierzeit sein. Es wurde jedoch der folgende Ausdruck angegeben: {1}.
es: El parámetro {0} en un operador de Importación debe ser un rstring de tiempo de compilación, pero se ha especificado la expresión siguiente: {1}.
ko: Import 연산자의 {0} 매개변수는 컴파일 시간 rstring이어야 하지만 다음 표현식이 지정되었습니다: {1}.
pt_br: O parâmetro {0} em um operador de Importação deve ser uma rstring de tempo de compilação, mas a expressão a seguir foi especificada: {1}.
zh_tw: 「匯入」運算子上的 {0} 參數必須是編譯時期 rstring，但卻指定了下列表示式：{1}。

# CDISP0062E
source: The {0} subscription parameter on the Import operator is not a valid subscription expression.
de: Der Subskriptionsparameter {0} für den Importoperator ist kein gültiger Subskriptionsausdruck.
es: El parámetro de suscripción {0} en el operador de Importación no es una expresión de suscripción válida.
ko: Import 연산자의 {0} subscription 매개변수는 유효한 서브스크립션 표현식이 아닙니다.
pt_br: O parâmetro de assinatura {0} no operador de Importação não é uma expressão de assinatura válida.
zh_tw: 「匯入」運算子上的 {0} subscription 參數不是有效的 subscription 表示式。

# CDISP0063E
source: A literal is expected in the filter expression, but the following expression is used instead: {0}.
de: Im Filterausdruck wird ein Literal erwartet. Stattdessen wird jedoch der folgende Ausdruck verwendet: {0}.
es: Se espera un literal en la expresión de filtro, pero en su lugar se utiliza la expresión siguiente: {0}.
ko: filter 표현식에서 리터럴이 기대되었으나 대신 다음 표현식이 사용되었습니다: {0}.
pt_br: Um literal é esperado na expressão de filtro, mas a expressão a seguir é usada: {0}.
zh_tw: 在過濾表示式中預期文字，但卻使用了下列表示式：{0}。

# CDISP0064E
source: An int64 literal is expected in the filter expression, but the following expression is found: {0}.
de: Im Filterausdruck wird ein int64-Literal erwartet, aber der folgende Ausdruck wurde gefunden: {0}.
es: Se espera un literal int64 en la expresión de filtro, pero se ha encontrado la expresión siguiente: {0}.
ko: filter 표현식에서 int64 리터럴이 기대되었으나 다음 표현식을 발견했습니다: {0}.
pt_br: Um literal int64 é esperado na expressão de filtro, mas a expressão a seguir foi localizada: {0}.
zh_tw: 在過濾表示式中預期 int64 文字，但卻找到了下列表示式：{0}。

# CDISP0065E
source: The type of the symbol in the filter % expression must be an integral type, but the following expression was found: {0}.
de: Der Typ des Symbols im Filterprozentausdruck muss ein Integraltyp sein, aber der folgende Ausdruck wurde gefunden: {0}.
es: El tipo de símbolo en la expresión de % de filtro debe ser un tipo integral, pero se ha encontrado la expresión siguiente: {0}.
ko: filter % 표현식에 있는 기호의 유형은 정수형이어야 하지만 다음 표현식을 발견했습니다: {0}.
pt_br: O tipo de símbolo na expressão de filtro % deve ser um tipo integral, mas a expressão a seguir foi localizada: {0}.
zh_tw: filter % 表示式中符號的類型必須是整數類型，但卻找到下列表示式：{0}。

# CDISP0066E
source: The type of the {0} symbol in the filter expression must be integer/rstring/float64/boolean type.
de: Der Typ des Symbols {0} im Filterausdruck muss ''integer/rstring/float64/boolean'' sein.
es: El tipo del símbolo {0} en la expresión de filtro debe ser un tipo integer/rstring/float64/boolean.
ko: filter 표현식에 있는 {0} 기호의 유형은 integer/rstring/float64/boolean 유형이어야 합니다.
pt_br: O tipo do símbolo {0} na expressão de filtro deve ser um número inteiro/rstring/float64/booleano.
zh_tw: 過濾表示式中 {0} 符號的類型必須是整數/rstring/float64/布林類型。

# CDISP0067E
source: The type of the {0} symbol in the filter subscript expression must be list<integer>/list<rstring>/list<float64>/list<boolean>.
de: Der Typ des Symbols {0} im Filterindexausdruck muss list<integer>/list<rstring>/list<float64>/list<boolean> sein.
es: El tipo del símbolo {0} en la expresión de subscript de filtro debe ser list<integer>/list<rstring>/list<float64>/list<boolean>.
ko: filter 서브스크립트 표현식에 있는 {0} 기호의 유형은 list<integer>/list<rstring>/list<float64>/list<boolean>이어야 합니다.
pt_br: O tipo do símbolo {0} na expressão de subscrito de filtro deve ser list<integer>/list<rstring>/list<float64>/list<boolean>.
zh_tw: filter 下標表示式中 {0} 符號的類型必須是 list<整數>/list<rstring>/list<float64>/list<布林>。

# CDISP0068E
source: An integer literal expression is expected in the filter subscript, but the following expression is found: {0}.
de: Im Filterindex wird ein ganzzahliger Literalausdruck erwartet, aber der folgende Ausdruck wurde gefunden: {0}.
es: Se espera un literal entero en el subscript de filtro, pero se ha encontrado la expresión siguiente: {0}.
ko: filter 서브스크립트에서 정수 리터럴 표현식이 기대되었으나 다음 표현식을 발견했습니다: {0}.
pt_br: Uma expressão de literal inteiro é esperada no subscrito de filtro, mas a expressão a seguir foi localizada: {0}.
zh_tw: 在 filter 下標中預期整數文字表示式，但卻找到了下列表示式：{0}。

# CDISP0069E
source: For the {0} operation, the type of the left side expression, which is {1}, does not match the type of the right side expression, which is {2}.
de: Für die Operation {0} stimmt der Typ des Ausdrucks auf der linken Seite, der {1} ist, nicht mit dem Typ des Ausdrucks auf der rechten Seite überein, der {2} ist.
es: Para la operación {0}, el tipo de la expresión de la izquierda, que es {1}, no coincide con el tipo de la expresión del lado derecho, que es {2}.
ko: {0} 연산자의 경우 왼쪽 표현식의 유형인 {1}이(가) 오른쪽 표현식의 유형인 {2}과(와) 일치하지 않습니다.
pt_br: Para a operação {0}, o tipo da expressão à esquerda, que é {1}, não corresponde ao tipo da expressão à direita, que é {2}.
zh_tw: 對於 {0} 作業，左側表示式的類型 {1} 與右側表示式的類型 {2} 不符。

# CDISP0070E
source: In the filter expression, for the {0} operation, the boolean type is expected, but the following type is found: {1}.
de: Im Filterausdruck für die Operation {0} wird der boolesche Typ erwartet, jedoch wurde der folgende Typ gefunden: {1}.
es: En la expresión de filtro, para la operación {0}, se espera el tipo booleano, pero se ha encontrado el tipo siguiente: {1}.
ko: filter 표현식의 경우 {0} 연산자에 대해 부울 유형을 사용해야 하지만 {1} 유형이 발견되었습니다.
pt_br: Na expressão de filtro, para a operação {0}, o tipo booleano é esperado, mas o tipo a seguir foi localizado: {1}.
zh_tw: 對於 {0} 作業，在過濾表示式中，預期布林類型，但卻找到下列類型：{1}。

# CDISP0071E
source: In the filter expression, the list type is expected for the in operand, but the following type is found: {0}.
de: Im Filterausdruck wird der Listentyp für den Operanden ''in'' erwartet, aber der folgende Typ wurde gefunden: {0}.
es: En la expresión de filtro, es espera el tipo de lista para el operando de entrada (in), pero se ha encontrado el tipo siguiente: {0}.
ko: filter 표현식에서 피연산자에 대해 list 유형이 기대되었으나 다음 유형을 발견했습니다: {0}.
pt_br: Na expressão de filtro, o tipo de lista é esperado para o operando ''in'', mas o tipo a seguir foi localizado: {0}.
zh_tw: 在過濾表示式中，In 運算元預期為清單類型，但卻找到下列類型：{0}。

# CDISP0072E
source: The use of the {0} symbol expression is not valid in a filter expression.
de: Die Verwendung des Symbolausdrucks {0} ist in einem Filterausdruck nicht gültig.
es: El uso de la expresión de símbolo {0} no es válido en una expresión de filtro.
ko: filter 표현식에서 {0} 기호 표현식의 사용은 유효하지 않습니다.
pt_br: O uso da expressão de símbolo {0} não é válido em uma expressão de filtro.
zh_tw: 在過濾表示式中，使用 {0} 符號表示式是無效動作。

# CDISP0073E
source: The use of the {0} literal expression is not valid in a filter expression.
de: Die Verwendung des Literalausdrucks {0} ist in einem Filterausdruck nicht gültig.
es: El uso de expresión de literal {0} no es válido en una expresión de filtro.
ko: filter 표현식에서 {0} 리터럴 표현식의 사용은 유효하지 않습니다.
pt_br: O uso da expressão literal {0} não é válido em uma expressão de filtro.
zh_tw: 在過濾表示式中，使用 {0} 文字表示式是無效動作。

# CDISP0074E
source: The use of the {0} expression in the filter is not valid.
de: Die Verwendung des Ausdrucks {0} im Filter ist nicht gültig.
es: El uso de la expresión {0} en el filtro no válido.
ko: filter에서 {0} 표현식의 사용은 유효하지 않습니다.
pt_br: O uso da expressão {0} no filtro não é válido.
zh_tw: 在過濾器中使用 {0} 表示式是無效動作。

# CDISP0075E
source: The {1} filter expression contains a subexpression that is not valid: {0}.
de: Der Filterausdruck {1} enthält einen Unterausdruck, der nicht gültig ist: {0}.
es: La expresión de filtro {1} contiene una subexpresión que no es válida: {0}.
ko: {1} filter 표현식에 유효하지 않은 하위 표현식이 포함되어 있습니다: {0}.
pt_br: A expressão de filtro {1} contém uma subexpressão que não é válida: {0}.
zh_tw: {1} 過濾表示式包含無效的子表示式：{0}。

# CDISP0076E
source: The following symbol is not defined in output tuple: {0}.
de: Das folgende Symbol ist im Ausgabetupel nicht definiert: {0}.
es: El símbolo siguiente no está definido en la tupla de salida: {0}.
ko: 출력 튜플에 다음 기호가 정의되어 있지 않습니다: {0}.
pt_br: O símbolo a seguir não está definido na tupla de saída: {0}.
zh_tw: 下列符號未定義於輸出值組中：{0}。

# CDISP0077E
source: The following expression is not a valid filter expression: {0}.
de: Der folgende Ausdruck ist kein gültiger Filterausdruck: {0}.
es: La expresión siguiente no es una expresión de filtro válida: {0}.
ko: 다음 표현식은 유효한 filter 표현식이 아닙니다: {0}.
pt_br: A expressão a seguir não é uma expressão de filtro válida: {0}.
zh_tw: 下列表示式不是有效的過濾表示式：{0}。

# CDISP0078E
source: Multiple calls to the following stateful functions exist in the same output clause: {0} and {1}. Ensure that no more than one stateful function is invoked by an output clause.
de: Eine Klausel ''output'' enthält mehrere Aufrufe der folgenden Funktionen mit Statusüberwachung: {0} und {1}. Stellen Sie sicher, dass eine Klausel ''output'' maximal eine Funktion mit Statusüberwachung aufruft.
es: Existen varias llamadas a las funciones con estado siguientes en la misma cláusula de salida: {0} y {1}. Asegúrese de que una cláusula de salida no ha invocado más de una función con estado.
ko: 동일한 output 절에 다음 stateful 함수에 대한 여러 호출이 존재합니다: {0} 및 {1}. 하나의 output 절에서 둘 이상의 stateful 함수가 호출되지 않도록 하십시오.
pt_br: Múltiplas chamadas para as seguintes funções stateful existem na mesma cláusula de saída: {0} e {1}. Certifique-se de que, no máximo, uma função stateful seja chamada por uma cláusula de saída.
zh_tw: 同一 output 子句中存在對下列有狀態函數的多重呼叫：{0} 和 {1}。請確保 output 子句所呼叫的有狀態函數不超過 1 個。

# CDISP0079W
source: Multiple calls to the following stateful functions exist in the same output clause: {0} and {1}. Ensure that no more than one stateful function is invoked by an output clause.
de: Eine Klausel ''output'' enthält mehrere Aufrufe der folgenden Funktionen mit Statusüberwachung: {0} und {1}. Stellen Sie sicher, dass eine Klausel ''output'' maximal eine Funktion mit Statusüberwachung aufruft.
es: Existen varias llamadas a las funciones con estado siguientes en la misma cláusula de salida: {0} y {1}. Asegúrese de que una cláusula de salida no ha invocado más de una función con estado.
ko: 동일한 output 절에 다음 stateful 함수에 대한 여러 호출이 존재합니다: {0} 및 {1}. 하나의 output 절에서 둘 이상의 stateful 함수가 호출되지 않도록 하십시오.
pt_br: Múltiplas chamadas para as seguintes funções stateful existem na mesma cláusula de saída: {0} e {1}. Certifique-se de que, no máximo, uma função stateful seja chamada por uma cláusula de saída.
zh_tw: 同一 output 子句中存在對下列有狀態函數的多重呼叫：{0} 和 {1}。請確保 output 子句所呼叫的有狀態函數不超過 1 個。

# CDISP0080W
source: A graph clause does not exist for the following main composite: {0}.
de: Für das folgende Hauptverbundelement ist keine Klausel ''graph'' vorhanden: {0}.
es: Una cláusula de gráfico no existe para el compuesto principal siguiente: {0}.
ko: 다음 기본 복합에 대해 graph 절이 존재하지 않습니다: {0}.
pt_br: Uma cláusula de gráfico não existe para o composto principal a seguir: {0}.
zh_tw: 不存在下列主要複合項的 graph 子句：{0}。

# CDISP0081W
source: The following label is a duplicate: {0}.
de: Der folgende Kennsatz ist ein Duplikat: {0}.
es: La etiqueta siguiente es un duplicado: {0}.
ko: 다음 레이블이 중복입니다: {0}.
pt_br: O rótulo a seguir é uma duplicata: {0}.
zh_tw: 以下標籤重複：{0}。

# CDISP0082W
source: The following label is a duplicate: {0}. A comma rather than a semicolon might have been used on the input port declarations.
de: Der folgende Kennsatz ist ein Duplikat: {0}. Möglicherweise wurde in den Eingabeportdeklarationen ein Komma anstelle eines Semikolons verwendet.
es: La etiqueta siguiente es un duplicado: {0}. Se podría haber utilizado una coma en lugar de un punto y coma en las declaraciones del puerto de entrada.
ko: 다음 레이블이 중복입니다: {0}. 입력 포트 선언에 세미콜론 대신 쉼표가 사용되었을 수 있습니다.
pt_br: O rótulo a seguir é uma duplicata: {0}. Uma vírgula em vez de um ponto e vírgula pode ter sido usada nas declarações de porta de entrada.
zh_tw: 以下標籤重複：{0}。輸入埠宣告中可能使用了逗點，而不是分號。

# CDISP0083E
source: The following label is a duplicate: {0}. A comma rather than a semicolon might have been used on the input port declarations.
de: Der folgende Kennsatz ist ein Duplikat: {0}. Möglicherweise wurde in den Eingabeportdeklarationen ein Komma anstelle eines Semikolons verwendet.
es: La etiqueta siguiente es un duplicado: {0}. Se podría haber utilizado una coma en lugar de un punto y coma en las declaraciones del puerto de entrada.
ko: 다음 레이블이 중복입니다: {0}. 입력 포트 선언에 세미콜론 대신 쉼표가 사용되었을 수 있습니다.
pt_br: O rótulo a seguir é uma duplicata: {0}. Uma vírgula em vez de um ponto e vírgula pode ter sido usada nas declarações de porta de entrada.
zh_tw: 以下標籤重複：{0}。輸入埠宣告中可能使用了逗點，而不是分號。

# CDISP0084E
source: The {1} and {2} languages are both specified as the default language for the following message set: {0}
de: Die Sprachen {1} und {2} sind beide als Standardsprache für die folgende Nachrichtengruppe angegeben: {0}
es: Se han especificado ambos idiomas, {1} y {2}, como el idioma predeterminado para el conjunto de mensajes siguiente: {0}
ko: {1} 및 {2} 언어가 둘 다 다음 메시지 세트의 기본 언어로 지정되어 있습니다: {0}
pt_br: Os idiomas {1} e {2} foram especificados como o idioma padrão para o conjunto de mensagens a seguir: {0}
zh_tw: 已同時將 {1} 和 {2} 語言指定為下列訊息集的預設語言：{0}

# CDISP0085E
source: A default language is not specified for the following message set: {0}
de: Für die folgende Nachrichtengruppe ist keine Standardsprache angegeben: {0}
es: No se ha especificado un idioma predeterminado para el conjunto de mensajes siguiente: {0}
ko: 다음 메시지 세트에 대해 기본 언어가 지정되지 않았습니다: {0}
pt_br: Um idioma padrão não foi especificado para o conjunto de mensagens a seguir: {0}
zh_tw: 未指定下列訊息集的預設語言：{0}

# CDISP0086E
source: The following input stream alias is identical to an input stream name: {0}.
de: Der folgende Aliasname des Eingabedatenstroms ist mit einem Eingabedatenstromnamen identisch: {0}.
es: El alias de secuencia de entrada siguiente es idéntico a un nombre de secuencia de entrada: {0}.
ko: 다음 입력 스트림 별명이 입력 스트림 이름과 동일합니다: {0}.
pt_br: O alias do fluxo de entrada a seguir é idêntico a um nome de fluxo de entrada: {0}.
zh_tw: 下列輸入串流別名與某個輸入串流名稱相同：{0}。

# CDISP0087W
source: The config checkpoint clause is not supported in stand alone mode.
de: Die Klausel ''config checkpoint'' wird im Standalone-Modus nicht unterstützt.
es: El punto de comprobación de configuración no está soportado en la modalidad autónoma.
ko: config checkpoint 절은 독립형 모드에서 지원되지 않습니다.
pt_br: A cláusula de ponto de verificação de configuração não é suportada no modo independente.
zh_tw: 在獨立模式下，不支援 config checkpoint 子句。

# CDISP0088E
source: The {0} value of the {1} parameter is not a custom literal. The operator model for the {2} operator expects a value of the custom literal type.
de: Der Wert {0} des Parameters {1} ist kein angepasstes Literal. Das Operatormodell für den Operator {2} erwartet einen Wert des angepassten Literaltyps.
es: El valor {0} del parámetro {1} no es un literal personalizado. El modelo de operador para el operador {2} espera un valor del tipo de literal personalizado.
ko: {1} 매개변수의 {0} 값이 사용자 정의 리터럴이 아닙니다. {2} 연산자의 연산자 모델에서는 사용자 정의 리터럴 유형의 값을 기대하고 있습니다.
pt_br: O valor {0} do parâmetro {1} não é um literal customizado. O modelo do operador para o operador {2} espera um valor do tipo literal customizado.
zh_tw: {1} 參數的 {0} 值不是自訂文字。{2} 運算子的運算子模型預期一個自訂文字類型的值。

# CDISP0089E
source: The following expression for the config threadedPort clause is not valid: {0}.
de: Der folgende Ausdruck für die Klausel ''config threadedPort'' ist nicht gültig: {0}.
es: La expresión siguiente para la cláusula threadedPort de configuración no es válida: {0}.
ko: config threadedPort 절에 대한 다음 표현식이 유효하지 않습니다: {0}.
pt_br: A expressão a seguir para a cláusula de configuração threadedPort não é válida: {0}.
zh_tw: config threadedPort 子句的下列表示式無效：{0}。

# CDISP0090E
source: The expression for the queue size parameter must be int32 literal >= 1. The incorrect expression is: {0}.
de: Der Ausdruck für den Warteschlangengrößenparameter muss ''int32 literal >= 1'' sein. Der falsche Ausdruck ist: {0}.
es: La expresión para el parámetro de tamaño de cola debe ser int32 literal >= 1. La expresión incorrecta es: {0}.
ko: 큐 크기 매개변수에 대한 표현식은 int32 literal >= 1이어야 합니다. 올바르지 않은 표현식은 다음과 같습니다: {0}.
pt_br: A expressão para o parâmetro de tamanho da fila deve ser um literal int32 > = 1. A expressão incorreta é: {0}.
zh_tw: 佇列大小參數的表示式必須是大於或等於 1 的 int32 文字。不正確的表示式是：{0}。

# CDISP0091E
source: A queue was already specified for the following port: {0}.
de: Für den folgenden Port wurde bereits eine Warteschlange angegeben: {0}.
es: Ya se ha especificado un cola para el puerto siguiente: {0}.
ko: 큐가 다음 포트에 대해 이미 지정되었습니다: {0}.
pt_br: Uma fila já foi especificada para a porta a seguir: {0}.
zh_tw: 已經為下列埠指定了佇列：{0}。

# CDISP0092E
source: Because of previous compilation errors, the compile process cannot continue.
de: Der Kompilierungsprozess kann aufgrund vorheriger Kompilierungsfehler nicht fortgesetzt werden.
es: Debido a errores de compilación anteriores, el proceso de compilación no puede continuar.
ko: 이전 컴파일 오류로 인해 컴파일 프로세스를 계속할 수 없습니다.
pt_br: Devido a erros de compilação anteriores, o processo de compilação não pode continuar.
zh_tw: 由於先前的編譯錯誤，編譯程序無法繼續。

# CDISP0093E
source: The following path does not exist: {0}.
de: Der folgende Pfad ist nicht vorhanden: {0}.
es: La vía de acceso siguiente no existe: {0}.
ko: 다음 경로가 존재하지 않습니다: {0}.
pt_br: O caminho a seguir não existe: {0}.
zh_tw: 以下路徑不存在：{0}。

# CDISP0094E
source: The following path was input, but is the path to a directory: {0}.
de: Der folgende Pfad wurde eingegeben, ist jedoch der Pfad zu einem Verzeichnis: {0}.
es: La vía de acceso siguiente era de entrada, pero es la vía de acceso de un directorio: {0}.
ko: 다음 경로가 입력되었으나 이 경로가 디렉토리에 대한 경로입니다: {0}.
pt_br: O caminho a seguir era uma entrada, mas é o caminho para um diretório: {0}.
zh_tw: 以下路徑是輸入，但卻是某個目錄的路徑：{0}。

# CDISP0095E
source: The following path was input, but is not the path to a directory: {0}.
de: Der folgende Pfad wurde eingegeben, ist jedoch nicht der Pfad zu einem Verzeichnis: {0}.
es: La vía de acceso siguiente era de entrada, pero no es la vía de acceso de un directorio: {0}.
ko: 다음 경로가 입력되었으나 이 경로가 디렉토리에 대한 경로가 아닙니다: {0}.
pt_br: O caminho a seguir era uma entrada, mas não é o caminho para um diretório: {0}.
zh_tw: 以下路徑是輸入，但卻不是某個目錄的路徑：{0}。

# CDISP0097E
source: The {1} file extension of the input file {0} is not valid. The expected file extension is {2}.
de: Die Dateierweiterung {1} der Eingabedatei {0} ist nicht gültig. Erwartete Dateierweiterung: {2}.
es: La extensión de archivo {1} del archivo de entrada {0} no es válida. La extensión de archivo prevista es {2}.
pt_br: A extensão do arquivo {1} do arquivo de entrada {0} não é válida. A extensão do arquivo esperada é {2}.
zh_tw: 輸入檔 {0} 的 {1} 副檔名無效。預期的副檔名為 {2}。

# CDISP0098E
source: The preprocessing of the following file failed: {0}.
de: Die Vorverarbeitung der folgenden Datei ist fehlgeschlagen: {0}.
es: El proceso previo del archivo siguiente ha fallado: {0}.
ko: 다음 파일의 선행 처리가 실패했습니다: {0}.
pt_br: O pré-processamento do arquivo a seguir falhou: {0}.
zh_tw: 以下檔案的預處理失敗：{0}。

# CDISP0100E
source: The following thread count value, which is specified by the -j switch, is not valid: {0,number,0}. The thread count must be greater than 0.
de: Der folgende Threadanzahlwert, der durch den Schalter -j angegeben wird, ist nicht gültig: {0,number,0}. Die Threadanzahl muss größer als 0 sein.
es: El valor de recuento de hebras siguiente, que se especifica mediante el conmutador -j, no es válido: {0,número,0}. El recuento de hebras debe ser mayor que 0.
ko: -j 스위치에 의해 지정된 다음 스레드 개수 값이 유효하지 않습니다: {0,number,0}. 스레드 개수는 0보다 커야 합니다.
pt_br: O valor de contagem de encadeamentos a seguir, que é especificado pelo comutador -j, não é válido: {0,number,0}. A contagem de encadeamentos deve ser maior que 0.
zh_tw: 由 -j 參數指定的以下執行緒數量值無效：{0,number,0}。執行緒數量必須大於 0。

# CDISP0101E
source: The following remote distcc node count value, which is specified by the -r switch, is not valid: {0,number,0}. The remote distcc node count must be greater than zero.
de: Der folgende Wert für die Anzahl der fernen distcc-Knoten, der durch den Schalter -r angegeben wird, ist nicht gültig: {0,number,0}. Die Anzahl der fernen distcc-Knoten muss größer als null sein.
es: El valor del recuento de nodos distcc remotos siguiente, que se especifica mediante el conmutador -r, no es válido: {0,número,0}. El recuento de nodos distcc remotos debe ser mayor que cero.
ko: -r 스위치에 의해 지정된 다음 원격 distcc 노드 개수 값이 유효하지 않습니다: {0,number,0}. 원격 distcc 노드 개수는 영(0)보다 커야 합니다.
pt_br: O valor de contagem de nó distcc remoto a seguir, que é especificado pelo comutador -r, não é válido: {0,number,0}. A contagem do nó distcc remoto deve ser maior que zero.
zh_tw: 由 -r 開關指定的以下遠端 distcc 節點數量值無效：{0,number,0}。遠端 distcc 節點數量必須大於 0。
