Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0852E
source: The {0} port name has been used more than once in a broadcast element of a parallel annotation.
de: Der Portname {0} wurde in einem Element ''broadcast'' einer parallelen Annotation mehrmals verwendet.
es: El nombre de puerto {0} se ha utilizado más de una vez en un elemento de difusión de una anotación paralela.
ko: {0} 포트 이름이 병렬 어노테이션의 broadcast 요소에 두 번 이상 사용되었습니다.
pt_br: O nome da porta {0} foi utilizado mais de uma vez em um elemento de transmissão de uma anotação paralela.
zh_tw: 在平行註釋的 broadcast 元素中，已經使用了 {0} 埠名稱多次。

# CDISP0853E
source: The {0} port name has been in both a broadcast element and a partitionBy element of a parallel annotation.
de: Der Portname {0} wurde in einem Element ''broadcast'' und in einem Element ''partitionBy'' einer parallelen Annotation gefunden.
es: El nombre de puerto {0} ha estado tanto en un elemento de difusión, como en un elemento partitionBy de una anotación paralela.
ko: {0} 포트 이름이 병렬 어노테이션의 broadcast 요소와 partitionBy 요소에 모두 포함되어 있습니다.
pt_br: O nome da porta {0} esteve um elemento de transmissão e em um elemento partitionBy de uma anotação paralela.
zh_tw: {0} 埠名稱已經同時位於平行註釋的 broadcast 元素和 partitionBy 元素內。

# CDISP0854E
source: The {0} port name has been used more than once in a partitionBy element of a parallel annotation.
de: Der Portname {0} wurde in einem Element ''partitionBy'' einer parallelen Annotation mehrmals verwendet.
es: El nombre de puerto {0} se ha utilizado más de una vez en un elemento partitionBy de una anotación paralela.
ko: {0} 포트 이름이 병렬 어노테이션의 partitionBy 요소에 두 번 이상 사용되었습니다.
pt_br: O nome da porta {0} foi usado mais de uma vez em um elemento partitionBy de uma anotação paralela.
zh_tw: 在平行註釋的 partitionBy 元素中，已經使用了 {0} 埠名稱多次。

# CDISP0855E
source: The XML schema {0} is not found.
de: Das XML-Schema {0} wurde nicht gefunden.
es: No se ha encontrado el esquema XML {0}.
ko: XML 스키마 {0}을(를) 찾을 수 없습니다.
pt_br: O esquema XML {0} não foi localizado.
zh_tw: 找不到 XML 綱目 {0}。

# CDISP0856E
source: Error generating Java template code.
de: Fehler beim Generieren des Java-Vorlagencodes.
es: Se ha producido un error al generar código de plantilla de Java.
ko: Java 템플리트 코드를 생성하는 중에 오류가 발생했습니다.
pt_br: Erro ao gerar o código do modelo Java.
zh_tw: 產生 Java 範本程式碼時發生錯誤。

# CDISP0857E
source: Operator invocation error for Java primitive {0}
de: Fehler beim Aufrufen des Operators für Java-Basiselement {0}
es: Error en la invocación de operador para primitiva de Java {0}
ko: Java 기본 {0}의 연산자 호출 오류
pt_br: Erro de chamada do operador para primitivas em Java {0}
zh_tw: Java 初始 {0} 的運算子呼叫錯誤

# CDISP0858T
source: Generating Java template code for {0}
de: Java-Vorlagencode für {0} wird generiert
es: Generando código de plantilla de Java para {0}
ko: {0}에 대한 Java 템플리트 코드를 생성하는 중입니다.
pt_br: Gerando código do modelo Java para {0}.
zh_tw: 正在產生 {0} 的 Java 範本程式碼

# CDISP0859E
source: Error opening file {0} reason: {1}
de: Fehler beim Öffnen von Datei {0}, Ursache: {1}
es: Se ha producido un error al abrir el archivo {0}, razón: {1}
ko: {0} 파일을 여는 중에 오류가 발생했습니다. 이유: {1}
pt_br: Erro ao abrir o arquivo {0} razão: {1}
zh_tw: 開啟檔案 {0} 時發生錯誤，原因：{1}

# CDISP0860E
source: Error writing to file {0} reason: {1}
de: Fehler beim Schreiben in Datei {0}, Ursache: {1}
es: Se ha producido un error al escribir en el archivo {0}, razón: {1}
ko: {0} 파일에 기록하는 중에 오류가 발생했습니다. 이유: {1}
pt_br: Erro ao gravar no arquivo {0} razão: {1}
zh_tw: 寫入檔案 {0} 時發生錯誤，原因：{1}

# CDISP0861E
source: The {0} operator may not be used with a boolean literal.
de: Der Operator {0} darf nicht mit einem booleschen Literal verwendet werden.
es: Es posible que el operador {0} no se utilice con un literal booleano.
ko: {0} 연산자는 부울 리터럴과 함께 사용할 수 없습니다.
pt_br: O operador {0} pode não ser usado com um literal booleano.
zh_tw: {0} 運算子不能搭配布林文字使用。

# CDISP0862E
source: An optional type may not have another optional type as its underlying type.
de: Ein optionaler Typ darf keinen weiteren optionalen Typ als zugrunde liegenden Typ haben.
es: Es posible que un tipo opcional no tenga otro tipo opcional como tipo subyacente correspondiente.
ko: 선택적 유형의 경우 해당 기본 유형으로 다른 선택적 유형을 포함시킬 수 없습니다.
pt_br: Um tipo opcional pode não ter outro tipo opcional como seu tipo subjacente.
zh_tw: 選用類型不能以另一選用類型作為其基礎類型。

# CDISP0863E
source: A literal null cannot be assigned to a non-optional type.
de: Ein Literal ''null'' darf nicht einem nicht optionalen Typ zugewiesen werden.
es: Un nulo literal no se puede asignar a un tipo no opcional.
ko: 선택적 유형이 아닌 유형에는 리터럴 널을 지정할 수 없습니다.
pt_br: Um literal nulo não pode ser designado a um tipo não opcional.
zh_tw: 文字空值不能指派給非選用類型。

# CDISP0864E
source: A literal null cannot appear in a parameter expression without an explicit cast to an optional type if that parameter does not have a type.
de: Ein Literal ''null'' darf nicht ohne explizite Umsetzung in einen optionalen Typ in einem Parameterausdruck verwendet werden, wenn dieser Parameter keinen Typ aufweist.
es: Un nulo literal no puede aparecer en una expresión de parámetro sin una expresión de conversión de tipo de datos explícita a un tipo opcional si ese parámetro no tiene un tipo.
ko: 해당 매개변수에 유형이 없는 경우 선택적 유형에 대한 명시적 캐스트 없이 매개변수 표현식에서 리터럴 널을 사용할 수 없습니다.
pt_br: Um literal nulo não pode aparecer em uma expressão de parâmetro sem uma cast explícita para um tipo opcional se esse parâmetro não possuir um tipo.
zh_tw: 文字空值不能出現在不含明確強制轉型為選用類型的參數表示式中（如果該參數沒有類型的話）。

# CDISP0865E
source: A literal null cannot appear in the given expression without an explicit cast to an optional type.
de: Ein Literal ''null'' darf nicht ohne explizite Umsetzung in einen optionalen Typ im angegebenen Ausdruck verwendet werden.
es: Un nulo literal no puede aparecer en la expresión dada sin una expresión de conversión de tipo de datos explícita a un tipo opcional.
ko: 선택적 유형에 대한 명시적 캐스트 없이 지정된 표현식에서 리터럴 널을 사용할 수 없습니다.
pt_br: Um literal nulo não pode aparecer na expressão fornecida sem uma cast explícita para um tipo opcional.
zh_tw: 文字空值不能出現在不含明確強制轉型為選用類型的給定表示式中。

# CDISP0866E
source: For the {0} subclause of the window definition, the {1} expression must not reference an input stream.
de: Der Ausdruck {1} für die Unterklausel {0} der Fensterdefinition darf keinen Eingabedatenstrom referenzieren.
es: Para la subcláusula {0} de la definición de ventana, la expresión {1} no debe hacer referencia a una secuencia de entrada.
ko: 창 정의에 대한 {0} 하위 절의 경우 {1} 표현식에서 입력 스트림을 참조해서는 안됩니다.
pt_br: Para o subitem {0} da definição de janela, a expressão {1} não deve referenciar um fluxo de entrada.
zh_tw: 對於視窗定義的 {0} 子條件式，{1} 表示式不可參照輸入串流。

# CDISP0867E
source: The resolution in an @eventTime annotation must be one of Milliseconds, Microseconds, or Nanoseconds.
de: Die Auflösung einer Annotation @eventTime muss Millisekunden, Mikrosekunden oder Nanosekunden sein.
es: La resolución de una anotación @eventTime debe ser una de Milisegundos, Microsegundos o Nanosegundos.
ko: @eventTime 어노테이션의 분석은 밀리초, 마이크로초 또는 나노초 중 하나여야 합니다.
pt_br: A resolução em uma anotação @eventTime deve ser em Milisegundos, Microssegundos ou Nanossegundos.
zh_tw: @eventTime 註釋中的解析度必須為 Milliseconds、Microseconds 或 Nanoseconds。

# CDISP0868E
source: The {0} port of the {1} operator is included in multiple timeInterval subgraphs.
de: Der Port {0} des Operators {1} ist in mehreren timeInterval-Unterdiagrammen enthalten.
es: El puerto {0} del operador {1} se incluye en varios subgrafos de timeInterval.
ko: {1} 연산자의 포트 {0}이(가) 복수의 timeInterval 서브그래프에 포함되어 있습니다.
pt_br: A porta {0} do operador {1} é incluída em diversos subgráficos timeInterval.
zh_tw: {1} 運算子的 {0} 埠已併入多個 timeInterval 子圖形。

# CDISP0869D
source: The duplicate timeInterval attributes are {0} and {1}.
de: Die doppelten timeInterval-Attribute sind {0} und {1}.
es: Los atributos de timeInterval duplicados son {0} y {1}.
ko: 중복 timeInterval 속성은 {0} 및 {1}입니다.
pt_br: Os atributos timeInterval duplicados são {0} e {1}.
zh_tw: 重複的 timeInterval 屬性為 {0} 及 {1}。

# CDISP0870E
source: The window clause uses a subclause valid only for timeInterval windows with a subclause valid only for sliding or tumbling windows.
de: Die Fensterklausel verwendet eine Unterklausel, die nur für timeInterval-Fenster gültig ist, sowie eine Unterklausel, die nur für Sliding oder Tumbling Window gültig ist.
es: La cláusula de ventana utiliza una subcláusula válida solo para ventanas de timeInterval con una subcláusula válida solo para ventanas deslizantes o en movimiento.
ko: window절은 슬라이딩 또는 텀블링 창에만 유효한 하위 절과 함께 timeInterval 창에만 유효한 하위 절을 사용합니다.
pt_br: A cláusula da janela usa um subitem válido somente para janelas timeInterval com um subitem válido somente para janelas deslizantes ou rolantes.
zh_tw: window 子句搭配使用了僅適用於 timeInterval 視窗的子條件式，與僅適用於滑動或翻轉視窗的子條件式。

# CDISP0871E
source: The window clause specifies a timeInterval window, but there is no \@eventTime annotation.
de: Die Fensterklausel gibt ein timeInterval-Fenster an, es ist jedoch keine Annotation \@eventTime vorhanden.
es: La cláusula de ventana especifica una ventana timeInterval, pero no hay anotación de \@eventTime.
ko: window절에서 timeInterval 창을 지정하지만 \@eventTime 어노테이션이 존재하지 않습니다.
pt_br: A cláusula de janela especifica uma janela timeInterval, mas não há anotação \@eventTime.
zh_tw: window 子句指定了 timeInterval 視窗，但沒有 \@eventTime 註釋。

# CDISP0872E
source: The window clause specifies a timeInterval window, but the \@eventTime annotation specifies an eventTimeAttribute value that is not in the input schema.
de: Die Fensterklausel gibt ein timeInterval-Fenster an, die Annotation \@eventTime gibt jedoch einen eventTimeAttribute-Wert an, der nicht im Eingabeschema vorhanden ist.
es: La cláusula de ventana especifica una ventana timeInterval pero la anotación \@eventTime especifica un valor de eventTimeAttribute que no está en el esquema de entrada.
ko: window절에서 timeInterval 창을 지정하지만 \@eventTime 어노테이션에서 입력 스키마에 존재하지 않는 eventTimeAttribute 값을 지정합니다.
pt_br: A cláusula de janela especifica uma janela timeInterval, mas a anotação \@eventTime especifica um valor eventTimeAttribute que não está no esquema de entrada.
zh_tw: window 子句指定了 timeInterval 視窗，但 \@eventTime 註釋指定了不存在於輸入綱目中的 eventTimeAttribute 值。

# CDISP0873E
source: There are at least two output ports with an attribute matching the eventTimeAttribute from the @eventTime annotation, but with different types. This is not supported. The types are {0} and {1}.
de: Es sind mindestens zwei Ausgabeports mit einem Attribut vorhanden, das mit eventTimeAttribute aus der Annotation @eventTime übereinstimmt. Diese haben jedoch unterschiedliche Typen. Dies wird nicht unterstützt. Typen: {0} und {1}.
es: Hay dos puertos de salida como mínimo con un atributo que coincide con eventTimeAttribute de la anotación @eventTime, pero con tipos diferentes. Esto no está soportado. Los tipos son {0} y {1}.
ko: @eventTime 어노테이션의 eventTimeAttribute와 일치하는 속성이 포함되어 있지만 유형이 다른 두 개 이상의 출력 포트가 존재합니다. 이러한 조건은 지원되지 않습니다. 해당 유형은 {0} 및 {1}입니다.
pt_br: Há pelo menos duas portas de saída com um atributo correspondente ao eventTimeAttribute da anotação @eventTime, mas com tipos diferentes. Isso não é suportado. Os tipos são {0} e {1}.
zh_tw: 在 @eventTime 註釋中，至少有兩個屬性符合 eventTimeAttribute 但類型不同的輸出埠。不支援這種情形。類型為 {0} 和 {1}。

# CDISP0874E
source: No attribute was found matching event-time attribute {0}.
de: Es wurde kein Attribut gefunden, das mit dem Ereigniszeitattribut {0} übereinstimmt.
es: No se ha encontrado ningún atributo que coincida con el atributo de tiempo de suceso {0}.
ko: event-time 속성 {0}과(와) 일치하는 속성을 찾을 수 없습니다.
pt_br: Nenhum atributo correspondente ao atributo event-time {0} foi encontrado.
zh_tw: 找不到符合 event-time 屬性 {0} 的屬性。

# CDISP0875E
source: The event-time attribute {0} has unsupported type {1}. Only timestamp, uint64, and int64 are supported.
de: Das Ereigniszeitattribut {0} hat den nicht unterstützten Typ {1}. Nur ''timestamp'', ''uint64'' und ''int64'' werden unterstützt.
es: El atributo de tiempo de suceso {0} tiene un tipo no soportado {1}. Solo se da soporte a indicación de fecha y hora, uint64 y int64.
ko: event-time 속성 {0}의 유형 {1}이(가) 지원되지 않습니다. timestamp, uint64 및 int64만 지원됩니다.
pt_br: O atributo event-time {0} tem tipo não suportado {1}. Somente registro de data e hora, uint64 e int64 são suportados.
zh_tw: event-time 屬性 {0} 具有不受支援的類型 {1}。僅支援時間戳記、uint64 及 int64。

# CDISP0876E
source: The @eventTime annotation is not supported on composite operators.
de: Die Annotation @eventTime wird für Verbundoperatoren nicht unterstützt.
es: La anotación @eventTime no está soportada en operadores compuestos.
ko: 복합 연산자에서는 @eventTime 어노테이션이 지원되지 않습니다.
pt_br: A anotação @eventTime não é suportada em operadores compostos.
zh_tw: @eventTime 註釋在複合運算子上不受支援。

# CDISP0877E
source: The @eventTime annotation specifies a resolution other than Nanoseconds. The type of the event-time attribute is timestamp. The only supported resolution for timestamp is Nanoseconds.
de: Die Annotation @eventTime gibt eine andere Auflösung als Nanosekunden an. Der Typ das Ereigniszeitattributs ist ''timestamp''. Für Zeitmarken wird nur die Auflösung Nanosekunden unterstützt.
es: La anotación @eventTime especifica una resolución distinta de Nanosegundos. El tipo del atributo de tiempo de suceso es indicación de fecha y hora. La única resolución soportada para indicación de fecha y hora es Nanosegundos.
ko: @eventTime 어노테이션에서 나노초 이외의 분석을 지정합니다. event-time 속성의 유형이 시간소인입니다. 시간소인에 대해 지원되는 분석은 나노초 뿐입니다.
pt_br: A anotação @eventTime especifica uma resolução diferente de Nanossegundos. O tipo do atributo event-time é registro de data e hora. A única resolução suportada para registro de data e hora é Nanosegundos.
zh_tw: @eventTime 註釋指定了除 Nanoseconds 外的解析度。event-time 屬性的類型為時間戳記。時間戳記僅支援 Nanoseconds 解析度。

# CDISP0878E
source: In the window clause for a timeInterval window, {0} must be specified exactly once.
de: In der Fensterklausel für ein timeInterval-Fenster muss {0} genau einmal angegeben werden.
es: En la cláusula window para una ventana de timeInterval, {0} se debe especificar exactamente una vez.
ko: timeInterval 창에 대한 window절의 경우 {0}을(를) 정확히 한 번만 지정해야 합니다.
pt_br: Na cláusula de janela para uma janela timeInterval, {0} deve ser especificado exatamente uma vez.
zh_tw: 在 timeInterval 視窗的 window 子句中，{0} 必須剛好指定一次。

# CDISP0879E
source: In the window clause for a timeInterval window, {0} may be specified at most once.
de: In der Fensterklausel für ein timeInterval-Fenster darf {0} maximal einmal angegeben werden.
es: En la cláusula window para una ventana de timeInterval, {0} se pueden especificar una vez como mucho.
ko: timeInterval 창에 대한 window절의 경우 {0}을(를) 최대 한 번만 지정할 수 있습니다.
pt_br: Na cláusula de janela para uma janela timeInterval, {0} pode ser especificado no máximo uma vez.
zh_tw: 在 timeInterval 視窗的 window 子句中，{0} 最多可以指定一次。

# CDISP0880E
source: {0} may only be used in a window clause if the window is a timeInterval window.
de: {0} darf nur in einer Fensterklausel verwendet werden, wenn das Fenster ein timeInterval-Fenster ist.
es: {0} solo se puede utilizar en una cláusula de ventana y la ventana es una ventana de timeInterval.
ko: {0}은(는) 창이 timeInterval 창인 경우에만 window절에서 사용할 수 있습니다.
pt_br: {0} pode ser usado somente em uma cláusula de janela se ela for uma janela timeInterval.
zh_tw: 唯有當視窗為 timeInterval 視窗時，{0} 才能用於 window 子句中。

# CDISP0881E
source: For the {0} subclause of the window definition, the {1} expression does not simplify to a literal.
de: Für die Unterklausel {0} der Fensterdefinition kann der Ausdruck {1} nicht zu einem Literal vereinfacht werden.
es: Para la subcláusula {0} de la definición de ventana, la expresión {1} no se simplifica a un literal.
ko: 창 정의의 {0} 하위 절에 대한 {1} 표현식이 리터럴로 단순화되지 않습니다.
pt_br: Para o subitem {0} da definição de janela, a expressão {1} não é simplificada para um literal.
zh_tw: 對於視窗定義的 {0} 子條件式，{1} 表示式不會簡化為文字。

# CDISP0882E
source: The eventTimeAttribute value in the @eventTime annotation must be an attribute in an output tuple type.
de: Der eventTimeAttribute-Wert in der Annotation @eventTime muss ein Attribut in einem Ausgabetupeltyp sein.
es: El valor de eventTimeAttribute en la anotación @eventTime debe ser un atributo en un tipo de tupla de salida.
ko: @eventTime 어노테이션의 eventTimeAttribute 값은 출력 튜플 유형의 속성이어야 합니다.
pt_br: O valor eventTimeAttribute na anotação @eventTime deve ser um atributo em um tipo de tupla de saída.
zh_tw: @eventTime 註釋中的 eventTimeAttribute 值，必須是輸出值組類型中的屬性。

# CDISP9000I
source: usage: {0} -h, --help | -g, --generator <generator> -x, --model <xmlModel> \ -s, --signature <signature> | --signature-file <sigfile> \ -o, --outfile <outfile> -z, --beautify <configuration> -h, --help Get (this) usage information -i, --incremental Incrementally generate the code -g, --generator <generator> The generator to be run -x, --model <xmlModel> The file containing the xml model to be code generated -s, --signature <signature> A type-unique signature to be written into the generated code --signature-file <sigfile> A type-unique signature to be written into the generated code -o, --outfile <outfile> The file into which the code is generated -z, --beautify <configuration> Format the generated code by using the provided uncrustify configuration This module generates code from an XML model.
de: Syntax: {0} -h, --help | -g, --generator <Generator> -x, --model <XML-Modell> \ -s, --signature <Signatur> | --signature-file <Signaturdatei> \ -o, --outfile <Ausgabedatei> -z, --beautify <Konfiguration> -h, --help (Diese) Syntaxinformationen abrufen -i, --incremental Code inkrementell generieren -g, --generator <Generator> Auszuführender Generator -x, --model <XML-Modell> Datei mit dem XML-Modell, dessen Code generiert werden soll -s, --signature <Signatur> In den generierten Code zu schreibende typeneindeutige Signatur --signature-file <Signaturdatei> In den generierten Code zu schreibende typeneindeutige Signatur -o, --outfile <Ausgabedatei> Datei, in der der Code generiert wird -z, --beautify <Konfiguration> Generierten Code mit der bereitgestellten uncrustify-Konfiguration formatieren Dieses Modul generiert Code über ein XML-Modell.
es: uso: {0} -h, --help | -g, --generator <generator> -x, --model <xmlModel> \ -s, --signature <signature> | --signature-file <sigfile> \ -o, --outfile <outfile> -z, --beautify <configuration> -h, --help Obtener (esta) información de uso -i, --incremental Generar el código de forma incremental -g, --generator <generator> El generador que se ejecutará -x, --model <xmlModel> El archivo que contiene el modelo xml del que se generará código -s, --signature <signature> Una firma exclusiva de tipo que se escribirá en el código generado --signature-file <sigfile> Una firma exclusiva de tipo que se escribirá en el código generado -o, --outfile <outfile> El archivo en el cual se generará el código -z, --beautify <configuration> Dar formato al código generado utilizando la configuración de uncrustify proporcionada Este módulo genera código a partir de un modelo XML.
ko: 사용법: {0} -h, --help | -g, --generator <generator> -x, --model <xmlModel> \ -s, --signature <signature> | --signature-file <sigfile> \ -o, --outfile <outfile> -z, --beautify <configuration> -h, --help 사용법 정보를 가져옵니다. -i, --incremental 코드를 증분식으로 생성합니다. -g, --generator <generator> 실행할 생성 프로그램입니다. -x, --model <xmlModel> 코드 생성될 XML 모델을 포함하는 파일입니다. -s, --signature <signature> 생성되는 코드에 쓰일 유형 고유 시그니처입니다. --signature-file <sigfile> 생성되는 코드에 쓰일 유형 고유 시그니처입니다. -o, --outfile <outfile> 생성되는 코드가 포함될 파일입니다. -z, --beautify <configuration> 제공된 uncrustify 구성을 사용하여 생성된 코드를 형식화합니다. 이 모듈은 XML 모델로부터 코드를 생성합니다.
pt_br: uso: {0} -h, --help | -g, --generator <generator> -x, --model <xmlModel> \ -s, --signature <signature> | --signature-file <sigfile> \ -o, --outfile <outfile> -z, --beautify <configuration> -h, --help obtém (estas) informações de uso -i, --incremental gera incrementalmente o código -g, --generator <generator> o gerador a ser executado -x, --model <xmlModel> o arquivo que contém o modelo XML do qual o código é gerado -s, --signature <signature> uma assinatura de tipo exclusivo a ser gravada no código gerado --signature-file <sigfile> uma assinatura de tipo exclusivo a ser gravada no código gerado -o, --outfile <outfile> o arquivo no qual o código é gerado -z, --beautify <configuration> formata o código gerado usando a configuração uncrustify fornecida Esse módulo gera código a partir de um modelo XML.
zh_tw: 用法：{0} -h, --help | -g, --generator <generator> -x, --model <xmlModel> \ -s, --signature <signature> | --signature-file <sigfile> \ -o, --outfile <outfile> -z, --beautify <configuration> -h, --help 取得（此）用法資訊 -i, --incremental 漸進式產生程式碼 -g, --generator <generator> 要執行的產生器 -x, --model <xmlModel> 包含要對其產生程式碼之 XML 模型的檔案 -s, --signature <signature> 要寫入所產生之程式碼中的唯一類型的簽章 --signature-file <sigfile> 要寫入所產生之程式碼中的唯一類型的簽章 -o, --outfile <outfile> 要在其中產生程式碼的檔案 -z, --beautify <configuration> 使用所提供的 uncrustify 配置來格式化產生的程式碼 此模組會從 XML 模型產生程式碼。
