Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0804E
source: A cycle was detected in the toolkit dependency tree that involves the following toolkits:
de: In der Baumstruktur der Toolkitabhängigkeiten wurde ein Zyklus festgestellt, der die folgenden Toolkits einbezieht:
es: Se ha detectado un ciclo en el árbol de dependencias de kit de herramientas implica los kits de herramientas siguientes:
ko: 툴킷 종속 트리에서 다음 툴킷을 포함하는 순환을 발견했습니다:
pt_br: Um ciclo foi detectado na árvore de dependência do kit de ferramentas que envolve os seguintes kits de ferramentas:
zh_tw: 在工具箱相依關係樹狀結構中偵測到一個循環，該循環涉及到下列工具箱：

# CDISP0805D
source: The following toolkit was involved in a toolkit dependency cycle. The toolkit is: {0} and the version is: {1}.
de: Das folgende Toolkit war an einem Toolkitabhängigkeitszyklus beteiligt. Toolkit: {0}. Version: {1}.
es: El kit de herramientas siguiente estaba implicado en un ciclo de dependencia de kit de herramientas. El kit de herramientas es: {0} y la versión es: {1}.
ko: 툴킷 종속성 순환에 다음 툴킷이 포함되어 있습니다. 툴킷은 {0}, 버전은 {1}입니다.
pt_br: O kit de ferramentas a seguir está envolvido em um ciclo de dependência do kit de ferramentas. O kit de ferramentas é: {0} e a versão é: {1}.
zh_tw: 工具箱相依關係循環中涉及到下列工具箱。工具箱為：{0}，版本為：{1}。

# CDISP0806E
source: A syntax error was found while parsing the SPLDOC comment block.
de: Beim Parsen des SPLDOC-Kommentarblocks wurde ein Syntaxfehler gefunden.
es: Se ha encontrado un error de sintaxis mientras se analizaba el bloque de comentario SPLDOC.
ko: SPLDOC 주속 블록을 구문 분석하는 중에 구문 오류를 발견했습니다.
pt_br: Um erro de sintaxe foi localizado ao analisar o bloco de comentário SPLDOC.
zh_tw: 剖析 SPLDOC 註解區塊時找到語法錯誤。

# CDISP0809E
source: The value specified as a getSubmissionTimeValue default cannot be converted to an integer.
de: Der als getSubmissionTimeValue-Standardwert angegebene Wert kann nicht in einen Integer konvertiert werden.
es: El valor especificado como un valor predeterminado getSubmissionTimeValue no se puede convertir a un entero.
ko: getSubmissionTimeValue 기본값으로 지정된 값을 정수로 변환할 수 없습니다.
pt_br: O valor especificado como um padrão getSubmissionTimeValue não pode ser convertido em um número inteiro.
zh_tw: 無法將指定為 getSubmissionTimeValue 預設值的值轉換成整數。

# CDISP0810E
source: The export parameter for the {0} stream id does not use the getChannel function.
de: Der Exportparameter für die Datenstrom-ID {0} verwendet die Funktion ''getChannel'' nicht.
es: El parámetro de exportación para el id de secuencia {0} no utiliza la función getChannel.
ko: {0} 스트림 ID에 대한 Export 매개변수가 getChannel 함수를 사용하지 않습니다.
pt_br: O parâmetro de exportação para o ID de fluxo {0} não usa a função getChannel.
zh_tw: {0} 串流 ID 的匯出參數不使用 getChannel 函數。

# CDISP0811E
source: The initializer expression for the {0} parameter of the {1} annotation does not have the correct type. The expression must be of {2} type.
de: Der Initialisierungsoperatorausdruck für den Parameter {0} der Annotation {1} hat nicht den richtigen Typ. Der Ausdruck muss vom Typ {2} sein.
es: La expresión de inicializador para el parámetro {0} de la anotación {1} no tiene el tipo correcto. La expresión debe ser del tipo {2}.
ko: {1} 어노테이션의 {0} 매개변수에 대한 초기자 표현식의 유형이 올바르지 않습니다. 이 표현식은 {2} 유형이어야 합니다.
pt_br: A expressão do inicializador para o parâmetro {0} da anotação {1} não possui o tipo correto. A expressão deve ser do tipo {2}.
zh_tw: {1} 註釋之 {0} 參數的起始設定表示式，沒有正確的類型。該表示式必須是 {2} 類型。

# CDISP0812E
source: The {0} annotation cannot be applied to a composite operator definition.
de: Die Annotation {0} kann nicht auf die Definition eines Verbundoperators angewendet werden.
es: La anotación {0} no se puede aplicar a una definición de operador compuesto.
ko: {0} 어노테이션은 복합 연산자 정의에 적용할 수 없습니다.
pt_br: A anotação {0} não pode ser aplicada a uma definição de operador composto.
zh_tw: 無法將 {0} 註釋套用至複合運算子定義。

# CDISP0813E
source: Unused.
de: Nicht verwendet.
es: No utilizado.
ko: 사용되지 않습니다.
pt_br: Não usado.
zh_tw: 未使用。

# CDISP0814D
source: Unused.
de: Nicht verwendet.
es: No utilizado.
ko: 사용되지 않습니다.
pt_br: Não usado.
zh_tw: 未使用。

# CDISP0815E
source: The {0} annotation cannot be applied to the {1} operator.
de: Die Annotation {0} kann nicht auf den Operator {1} angewendet werden.
es: La anotación {0} no se puede aplicar al operador {1}.
ko: {0} 어노테이션은 {1} 연산자에 적용할 수 없습니다.
pt_br: A anotação {0} não pode ser aplicada ao operador {1}.
zh_tw: 無法將 {0} 註釋套用至 {1} 運算子。

# CDISP0816E
source: A stream from an Import operator or to an Export operator cannot cross a parallel region boundary.
de: Ein Datenstrom von einem Importoperator oder in einen Exportoperator kann die Grenze einer parallelen Region nicht überschreiten.
es: Una secuencia de un operador de importación o un operador de exportación no puede cruzar un límite de región paralela.
ko: Import 연산자 또는 Export 연산자의 스트림은 병렬 영역 경계를 통과할 수 없습니다.
pt_br: Um fluxo de um operador de importação ou de um operador de exportação não pode cruzar um limite de região paralela.
zh_tw: 來源為「匯入」運算子或目標為「匯出」運算子的串流，不能跨越平行區域界限。

# CDISP0817D
source: The Import operator producing the stream that crosses the parallel region boundary is defined here.
de: Der Importoperator, der den Datenstrom erzeugt, der die Grenze einer parallelen Region überschreitet, ist hier definiert.
es: El operador de importación que genera la secuencia que cruza el límite de región paralela está definido aquí.
ko: 병렬 영역 경계를 통과하는 스트림을 생성하는 Import 연산자가 여기 정의되어 있습니다.
pt_br: O operador de importação que produz o fluxo que cruza o limite da região paralela é definido aqui.
zh_tw: 產生可跨越平行區域界限之串流的「匯入」運算子是在這裡進行定義。

# CDISP0818D
source: The Export operator consuming the stream that crosses the parallel region boundary is defined here.
de: Der Exportoperator, der den Datenstrom verarbeitet, der die Grenze einer parallelen Region überschreitet, ist hier definiert.
es: El operador de exportación que consume la secuencia que cruza el límite de región paralela está definido aquí.
ko: 병렬 영역 경계를 통과하는 스트림을 이용하는 Export 연산자가 여기 정의되어 있습니다.
pt_br: O operador de exportação que consome o fluxo que cruza o limite de região paralela é definido aqui.
zh_tw: 使用可跨越平行區域界限之串流的「匯出」運算子是在這裡進行定義。

# CDISP0819E
source: Input port number {1,number,0} in the {0} operator, which expects punctuation, is potentially connected to multiple streams due to an upstream parallel region.
de: Eingabeportnummer {1,number,0} im Operator {0}, der Punktuation erwartet, ist aufgrund einer vorgeschalteten parallelen Regionpotenziell mit mehreren Datenströmen verbunden.
es: El número de puerto de entrada {1,número,0} en el operador {0}, que espera puntuación, posiblemente está conectado a varias secuencias debido a una región paralela en sentido ascendente.
ko: 구두점을 기대하는 {0} 연산자의 입력 포트 번호 {1,number,0}이(가) 업스트림 병렬 영역으로 인해 잠재적으로 여러 스트림에 연결되어 있습니다.
pt_br: O número da porta de entrada {1,number,0} no operador {0}, que espera uma pontuação, é potencialmente conectado a múltiplos fluxos devido a uma região paralela de envio de dados.
zh_tw: 由於上游平行區域，{0} 運算子中的輸入埠號 {1,number,0}（預期標點符號）可能已連接至多個串流。

# CDISP0820E
source: The {0} operator, which specifies punctuation for port number {1,number,0}, is in a parallel region that is directly adjacent to an upstream parallel region.
de: Der Operator {0}, der Punktuation für Portnummer {1,number,0} angibt, ist in einer parallelen Region, die direkt an eine vorgeschaltete parallele Region angrenzt.
es: El operador {0}, que especifica puntuación para el número de puerto {1,número,0}, está en una región paralela que está directamente al lado de una región paralela en sentido ascendente.
ko: 포트 번호 {1,number,0}에 대한 구두점을 지정하는 {0} 연산자가 업스트림 병렬 영역에 인접해 있는 병렬 영역에 포함되어 있습니다.
pt_br: O operador {0}, que especifica uma pontuação para o número da porta {1,number,0}, está em uma região paralela bem ao lado de uma região paralela de envio de dados.
zh_tw: 用來為埠號 {1,number,0} 指定標點符號的 {0} 運算子，位於直接與上游平行區域相鄰的某個平行區域中。

# CDISP0821E
source: The value of the width parameter specified in the parallel annotation is not valid.
de: Der Wert des Parameters ''width'', der in der parallelen Annotation angegeben ist, ist nicht gültig.
es: El valor del parámetro de anchura especificado en la anotación paralela no es válido.
ko: 병렬 어노테이션에 지정된 width 매개변수가 유효하지 않습니다.
pt_br: O valor do parâmetro de largura especificado na anotação paralela não é válido.
zh_tw: 在平行註釋中指定之寬度參數的值無效。

# CDISP0822E
source: The parallel annotation has a partitionBy parameter specified but no partitions were found.
de: Für die parallele Annotation ist ein Parameter ''partitionBy'' angegeben, es wurden jedoch keine Partitionen gefunden.
es: La anotación paralela tiene un parámetro partitionBy especificado, pero no se ha encontrado ninguna partición.
ko: 병렬 어노테이션에 partitionBy 매개변수가 지정되어 있으나 파티션을 찾지 못했습니다.
pt_br: A anotação paralela tem um parâmetro partitionBy especificado, mas nenhuma partição foi localizada.
zh_tw: 平行註釋已指定 partitionBy 參數，但卻找不到任何分割區。

# CDISP0823E
source: The port name {0} specified in the parallel annotation is not a valid stream or port name.
de: Der in der parallelen Annotation angegebene Portname {0} ist kein gültiger Datenstrom- oder Portname.
es: El nombre de puerto {0} especificado en la anotación paralela no es un nombre de secuencia o puerto válido.
ko: 병렬 어노테이션에 지정된 포트 이름 {0}이(가) 유효한 스트림 또는 포트 이름이 아닙니다.
pt_br: O nome da porta {0} especificado na anotação paralela não é um nome de fluxo ou de porta válido.
zh_tw: 在平行註釋中指定的埠名稱 {0}，不是有效的串流或埠名稱。

# CDISP0824E
source: The attribute name {0} specified in the parallel annotation is not a valid attribute name in the stream type associated with port {1}.
de: Der in der parallelen Annotation angegebene Attributname {0} ist kein gültiger Attributname im Datenstromtyp, der dem Port {1} zugeordnet ist.
es: El nombre de atributo {0} especificado en la anotación paralela no es un nombre de atributo válido en el tipo de secuencia asociado al puerto {1}.
ko: 병렬 어노테이션에 지정된 속성 이름 {0}이(가) 포트 {1}과(와) 연관된 스트림 유형에서 유효한 속성 이름이 아닙니다.
pt_br: O nome do atributo {0} especificado na anotação paralela não é um nome de atributo válido no tipo de fluxo associado à porta {1}.
zh_tw: 在平行註釋中指定的屬性名稱 {0}，不是與埠 {1} 相關聯之串流類型中的有效屬性名稱。

# CDISP0825E
source: The attribute name {0} specified in the parallel annotation is already in the attribute list.
de: Der in der parallelen Annotation angegebene Attributname {0} befindet sich bereits in der Attributliste.
es: El nombre de atributo {0} especificado en la anotación paralela ya está en la lista de atributos.
ko: 병렬 어노테이션에 지정된 속성 이름 {0}이(가) 이미 속성 목록에 포함되어 있습니다.
pt_br: O nome do atributo {0} especificado na anotação paralela já está na lista de atributos.
zh_tw: 在平行註釋中指定的屬性名稱 {0}，已經位於屬性清單內。

# CDISP0826E
source: The value specified for the replicateHostTags parameter of the parallel annotation must be a compile-time constant non-empty list of rstring literals.
de: Der für den Parameter ''replicateHostTags'' der parallelen Annotation angegebene Wert muss eine nicht leere Liste der Kompilierzeitkonstanten von rstring-Literalen sein.
es: El valor especificado para el parámetro replicateHostTags de la anotación paralela debe ser una lista no vacía de constantes de tiempo de compilación de literales del tipo rstring.
ko: 병렬 어노테이션의 replicateHostTags 매개변수에 대해 지정되는 값은 rstring 리터럴의, 비어있지 않은 컴파일 시간 상수 목록이어야 합니다.
pt_br: O valor especificado para o parâmetro replicateHostTags da anotação paralela deve ser uma lista não vazia de constante de tempo de compilação de literais rstring.
zh_tw: 對平行註釋的 replicateHostTags 參數指定的值，必須是 rstring 文字的編譯時期常數非空清單。

# CDISP0827E
source: The partitionBy attribute of the parallel annotation is missing the port or attributes attribute.
de: Im Attribut ''partitionBy'' der parallelen Annotation fehlt das Attribut ''port'' oder ''attributes''.
es: En el atributo partitionBy de la anotación paralela falta el atributo de puerto o de atributos.
ko: 병렬 어노테이션의 partitionBy 속성에서 port 속성 또는 attributes 속성이 누락되었습니다.
pt_br: O atributo partitionBy da anotação paralela requer o atributo de porta ou de atributos.
zh_tw: 平行註釋的 partitionBy 屬性遺漏了埠或 attributes 屬性。

# CDISP0829E
source: The value specified for the attributes attribute of the parallel annotation is invalid. A list of attributes from the specified input port is expected.
de: Der für das Attribut ''attributes'' der parallelen Annotation angegebene Wert ist ungültig. Es wird eine Liste der Attribute vom angegebenen Eingabeport erwartet.
es: El valor especificado para el atributo de atributos de la anotación paralela no es válido. Se espera una lista de atributos del puerto de entrada especificado.
ko: 병렬 어노테이션의 attributes 속성에 대해 지정된 값이 유효하지 않습니다. 기대된 항목은 지정된 입력 포트의 속성 목록입니다.
pt_br: O valor especificado para o atributo de atributos da anotação paralela é inválido. Uma lista de atributos a partir da porta de entrada especificada é esperada.
zh_tw: 對平行註釋的 attributes 屬性指定的值無效。預期為來自指定之輸入埠的屬性清單。

# CDISP0830E
source: The STREAMS_INSTALL environment variable is not defined.
de: Die Umgebungsvariable STREAMS_INSTALL ist nicht definiert.
es: La variable de entorno STREAMS_INSTALL no está definida.
ko: STREAMS_INSTALL 환경 변수가 정의되지 않았습니다.
pt_br: A variável de ambiente STREAMS_INSTALL não está definida.
zh_tw: 未定義 STREAMS_INSTALL 環境變數。

# CDISP0831E
source: Illegal consistent region topology: Custom operator {0} cannot be the start of a consistent region.
de: Unzulässige Topologie für konsistente Region: Benutzerdefinierter Operator {0} kann nicht der Anfang einer konsistenten Region sein.
es: Topología de región coherente ilegal: el operador personalizado {0} no puede ser el inicio de una región coherente.
ko: 잘못된 일관성 있는 영역 토폴로지: Custom 연산자 {0}은(는) 일관성 있는 영역의 시작이 될 수 없습니다.
pt_br: Topologia de região consistente ilegal: o operador customizado {0} não pode ser o início de uma região consistente.
zh_tw: 一致區域拓蹼無效：「自訂」運算子 {0} 不能是一致區域的開頭。

# CDISP0832E
source: Illegal consistent region topology: a start operator has a feedback loop within the consistent region. The path is: {0}.
de: Unzulässige Topologie für konsistente Region: Ein Startoperator hat eine Rückkopplungsschleife in der konsistenten Region. Pfad: {0}.
es: Topología de región coherente ilegal: un operador de inicio tiene un bucle de comentarios dentro de la región coherente. La vía de acceso es: {0}.
ko: 잘못된 일관성 있는 영역 토폴로지: 시작 연산자가 일관성 있는 영역 내에 피드백 루프를 갖고 있습니다. 경로는 {0}입니다.
pt_br: Topologia de região consistente ilegal: um operador de início tem um loop de feedback contido na região consistente. O caminho é: {0}.
zh_tw: 一致區域拓蹼無效：一致區域內的起始運算子具有反饋迴圈。路徑為：{0}。

# CDISP0833E
source: Illegal consistent region topology: there is a feedback loop contained within the consistent region. The path is: {0}.
de: Unzulässige Topologie für konsistente Region: Die konsistente Region enthält eine Rückkopplungsschleife. Pfad: {0}.
es: Topología de región cohere ilegal: existe un bucle de comentarios incluido en la región coherente. La vía de acceso es: {0}.
ko: 잘못된 일관성 있는 영역 토폴로지: 일관성 있는 영역 내에 피드백 루프가 포함되어 있습니다. 경로는 {0}입니다.
pt_br: Topologia de região consistente ilegal: há um loop de feedback contido na região consistente. O caminho é: {0}.
zh_tw: 一致區域拓蹼無效：一致區域內包含一個反饋迴圈。路徑為：{0}。

# CDISP0834E
source: Illegal consistent region topology: operator {0} has exclusively control input ports and has output ports.
de: Unzulässige Topologie für konsistente Region: Operator {0} hat exklusive Steuereingabeports und Ausgabeports.
es: Topología de región coherente ilegal: el operador {0} tiene puertos de entrada de control de forma exclusiva y puertos de salida.
ko: 잘못된 일관성 있는 영역 토폴로지: 연산자 {0}에 독점 제어 입력 포트 및 출력 포트가 있습니다.
pt_br: Topologia de região consistente ilegal: o operador {0} tem exclusivamente portas de entrada de controle e também tem portas de saída.
zh_tw: 一致區域拓蹼無效：運算子 {0} 以獨佔模式具有控制輸入埠且具有輸出埠。

# CDISP0835E
source: Illegal consistent region topology: incompatible consistent regions cannot be merged.
de: Unzulässige Topologie für konsistente Region: Inkompatible konsistente Regionen können nicht zusammengeführt werden.
es: Topología de región coherente ilegal: no se pueden fusionar regiones coherentes incompatibles.
ko: 잘못된 일관성 있는 영역 토폴로지: 호환되지 않는 일관성 있는 영역은 병합할 수 없습니다.
pt_br: Topologia de região consistente ilegal: regiões consistentes incompatíveis não podem ser mescladas.
zh_tw: 一致區域拓蹼無效：無法合併不相容的一致區域。

# CDISP0836D
source: The incompatible consistent region is defined here.
de: Die inkompatible konsistente Region ist hier definiert.
es: La región coherente incompatible está definida aquí.
ko: 호환되지 않는 일관성 있는 영역이 여기 정의되어 있습니다.
pt_br: A região consistente incompatível é definida aqui.
zh_tw: 不相容的一致區域是在這裡進行定義。

# CDISP0837E
source: Illegal consistent region topology: There are too many start operators that are operator driven. Start operators are: {0}
de: Unzulässige Topologie für konsistente Region: Es gibt zu viele operatorgesteuerte Startoperatoren. Startoperatoren: {0}
es: Topología de región coherente ilegal: existen demasiados operadores de inicio que están controlados por operador. Los operadores de inicio son: {0}
ko: 잘못된 일관성 있는 영역 토폴로지: 연산자 구동인 시작 연산자가 너무 많습니다. 시작 연산자는 다음과 같습니다: {0}
pt_br: Topologia de região consistente ilegal: há muitos operadores de início que são acionados por operador. Os operadores de início são: {0}
zh_tw: 一致區域拓蹼無效：由運算子驅動的起始運算子太多。起始運算子為：{0}

# CDISP0838E
source: Illegal consistent region topology: start operator {0} is specified as a parallel region with a width greater than 1, and has a trigger kind of operatorDriven.
de: Unzulässige Topologie für konsistente Region: Startoperator {0} ist als parallele Region mit einer Breite angegeben, die größer als 1 ist, und hat die Triggerart ''operatorDriven''.
es: Topología de región coherente ilegal: el operador de inicio {0} está especificado como una región paralela con una anchura mayor que 1, y tiene un tipo de desencadenante de operatorDriven.
ko: 잘못된 일관성 있는 영역 토폴로지: 시작 연산자 {0}이(가) 너비가 1보다 큰 병렬 영역으로 지정되었으며 트리거 종류가 operatorDriven입니다.
pt_br: Topologia de região consistente ilegal: o operador de início {0} é especificado como uma região paralela com uma largura maior que 1 e tem um tipo de acionador de operatorDriven.
zh_tw: 一致區域拓蹼無效：已將起始運算子 {0} 指定為寬度大於 1 的平行區域，並且該起始運算子的觸發程式類型為 operatorDriven。

# CDISP0839W
source: The consistent region start operator {0} is also specified as a parallel region. Application submission will fail if a parallel width greater than 1 is specified.
de: Der Startoperator {0} der konsistenten Region ist auch als parallele Region angegeben. Die Anwendungsübergabe schlägt fehl, wenn eine parallele Breite angegeben wird, die größer als 1 ist.
es: El operador de inicio de la región coherente {0} también está especificado como una región paralela. El envío de la aplicación fallará si se ha especificado una anchura paralela mayor que 1.
ko: 일관성 있는 영역 시작 연산자 {0}이(가) 동시에 병렬 영역으로 지정되었습니다. 1보다 큰 병렬 너비가 지정된 경우에는 애플리케이션 제출이 실패합니다.
pt_br: O operador de início de região consistente {0} também é especificado como uma região paralela. Um envio de aplicativo falhará se uma largura paralela maior que 1 for especificada.
zh_tw: 也將一致區域起始運算子 {0} 指定為平行區域。如果指定了大於 1 的平行寬度，則應用程式提交將失敗。

# CDISP0840E
source: The {0} annotation has a {1} parameter with a value of {2} but the required {3} parameter was not specified.
de: Die Annotation {0} hat einen Parameter {1} mit dem Wert {2}, aber der erforderliche Parameter {3} wurde nicht angegeben.
es: La anotación {0} tiene un parámetro {1} con un valor de {2}, pero no se ha especificado el parámetro necesario {3}.
ko: {0} 어노테이션에 값이 {2}인 {1} 매개변수가 있으나 필수 {3} 매개변수가 지정되지 않았습니다.
pt_br: A anotação {0} tem um parâmetro {1} com um valor de {2}, mas o parâmetro necessário {3} não foi especificado.
zh_tw: {0} 註釋具有一個 {1} 參數（值為 {2}），但卻未指定必要的 {3} 參數。

# CDISP0841E
source: The {0} annotation has a {1} parameter which is not valid unless the {2} parameter with a value of {3} is also specified.
de: Die Annotation {0} hat einen Parameter {1}, der nicht gültig ist, außer wenn der Parameter {2} mit dem Wert {3} auch angegeben wird.
es: La anotación {0} tiene un parámetro {1} que no es válido, a menos que también se especifique el parámetro {2} con un valor de {3}.
ko: {0} 어노테이션에 값이 {3}인 {2} 매개변수가 함께 지정되어야 유효한 {1} 매개변수가 있습니다.
pt_br: A anotação {0} tem um parâmetro {1} que não é válido, a menos que o parâmetro {2} com um valor de {3} também seja especificado.
zh_tw: {0} 註釋具有一個 {1} 參數，該參數只在同時指定了 {2} 參數（值為 {3}）的情況下才有效。

# CDISP0842E
source: The copy of toolkit {0} to {1} failed.
de: Das Toolkit {0} konnte nicht in {1} kopiert werden.
es: La copia del kit de herramientas {0} en {1} ha fallado.
ko: {1}(으)로의 툴킷 {0} 복사가 실패했습니다.
pt_br: A cópia do kit de ferramentas {0} para {1} falhou.
zh_tw: 將工具箱 {0} 複製到 {1} 失敗。

# CDISP0843E
source: The {0} file was not found.
de: Die Datei {0} wurde nicht gefunden.
es: El archivo {0} no se ha encontrado.
ko: {0} 파일을 찾지 못했습니다.
pt_br: O arquivo {0} não foi localizado.
zh_tw: 找不到 {0} 檔案。

# CDISP0844E
source: The profile option FOPT must be specified with a profile file.
de: Die Profiloption FOPT muss mit einer Profildatei angegeben werden.
es: La opción de perfil FOPT se debe especificar con un archivo de perfil.
ko: 프로파일 옵션 FOPT가 프로파일 파일과 함께 지정되어야 합니다.
pt_br: A opção de perfil FOPT deve ser especificada com um arquivo de perfil.
zh_tw: 必須使用設定檔來指定設定檔選項 FOPT。

# CDISP0845E
source: The profile file {0} could not be untared.
de: Die Profildatei {0} konnte nicht entpackt werden.
es: El archivo de perfil {0} no se ha podido descomprimir.
ko: 프로파일 파일 {0}을(를) tar 해제할 수 없습니다.
pt_br: O arquivo de perfil {0} não pôde ser descompactado.
zh_tw: 無法解壓縮設定檔 {0}。

# CDISP0846E
source: More than one {0} operator is declared in the application.
de: In der Anwendung sind mehrere {0}-Operatoren deklariert.
es: Se ha declarado más de un operador {0} en la aplicación.
ko: 애플리케이션에 둘 이상의 {0} 연산자가 선언되었습니다.
pt_br: Mais de um operador {0} foi declarado no aplicativo.
zh_tw: 在應用程式中宣告了多個 {0} 運算子。

# CDISP0847D
source: The first {0} operator is defined here.
de: Der erste Operator {0} ist hier definiert.
es: El primer operador {0} está definido aquí.
ko: 첫 번재 {0} 연산자가 여기 정의되어 있습니다.
pt_br: O primeiro operador {0} foi definido aqui.
zh_tw: 第一個 {0} 運算子是在這裡進行定義。

# CDISP0848E
source: The {0} operator may not appear in a parallel region.
de: Der Operator {0} darf nicht in einer parallelen Region vorkommen.
es: El operador {0} puede no aparecer en una región paralela.
ko: {0} 연산자는 병렬 영역에 포함되지 않아야 합니다.
pt_br: O operador {0} pode não aparecer em uma região paralela.
zh_tw: {0} 運算子不能出現在平行區域中。

# CDISP0849E
source: The {0} annotation may not be applied to the invocation of the {1} operator.
de: Die Annotation {0} darf nicht auf den Aufruf des Operators {1} angewendet werden.
es: La anotación {0} puede no aplicarse en la invocación del operador {1}.
ko: {0} 어노테이션은 {1} 연산자의 호출에 적용되지 않아야 합니다.
pt_br: A anotação {0} pode não ser aplicada à chamada do operador {1}.
zh_tw: 不能將 {0} 註釋套用至 {1} 運算子的呼叫。

# CDISP0850I
source: The {0} option is no longer supported and will be removed in a future release.
de: Die Option {0} wird nicht mehr unterstützt und wird in einem zukünftigen Release entfernt.
es: La opción {0} ya no está soportada y se eliminará en un futuro release.
ko: {0} 옵션은 더 이상 지원되지 않으며 이후 릴리스에서 제거될 예정입니다.
pt_br: A opção {0} não é mais suportada e será removida em uma liberação futura.
zh_tw: {0} 選項不再受支援，並且將在未來版本中予以移除。

# CDISP0851E
source: The {0} annotation may not be applied to the invocation of a primitive operator.
de: Die Annotation {0} darf nicht auf den Aufruf eines primitiven Operators angewendet werden.
es: La anotación {0} puede no aplicarse a la invocación de un operador de primitiva.
ko: {0} 어노테이션은 기본 연산자의 호출에 적용되지 않아야 합니다.
pt_br: A anotação {0} pode não ser aplicada à chamada de um operador primitivo.
zh_tw: 不能將 {0} 註釋套用至初始運算子的呼叫。
