Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP9139E
source: The {0} instance is not running.
de: Die Instanz {0} wird nicht ausgeführt.
es: La instancia {0} no se está ejecutando.
ko: {0} 인스턴스가 실행 중이 아닙니다.
pt_br: A instância {0} não está em execução.
zh_tw: {0} 實例不在執行中。

# CDISP9140E
source: The aggregateIncompleteWindows parameter is valid only with sliding windows.
de: Der Parameter ''aggregateIncompleteWindows'' ist nur mit Sliding Windows gültig.
es: El parámetro aggregateIncompleteWindows solo es válido con ventanas deslizantes.
ko: aggregateIncompleteWindows 매개변수는 슬라이딩 창에 대해서만 유효합니다.
pt_br: O parâmetro aggregateIncompleteWindows é válido somente com janelas deslizantes.
zh_tw: aggregateIncompleteWindows 參數僅適用於滑動視窗。

# CDISP9141E
source: The command failed to change to a temporary directory under the current directory: {0}.
de: Der Befehl konnte nicht in ein temporäres Verzeichnis unter dem aktuellen Verzeichnis wechseln: {0}.
es: El mandato no ha podido cambiar a un directorio temporal bajo el directorio actual: {0}.
ko: 명령이 현재 디렉토리에 있는 임시 디렉토리로 변경하는 데 실패했습니다: {0}.
pt_br: O comando falhou ao mudar para um diretório temporário no diretório atual: {0}.
zh_tw: 指令無法切換到現行目錄下面的暫存目錄：{0}。

# CDISP9142E
source: The xml file was not generated. Verify that the working directory is shared across the instance hosts.
de: Die XML-Datei wurde nicht generiert. Verifizieren Sie, dass das Arbeitsverzeichnis auf allen Instanzhosts gemeinsam genutzt wird.
es: El archivo xml no se ha generado. Verifique que el directorio de trabajo está compartido entre los hosts de instancia.
ko: xml 파일이 생성되지 않았습니다. 작업 디렉토리가 인스턴스 호스트 간에 공유되고 있는지 확인하십시오.
pt_br: O arquivo XML não foi gerado. Verifique se o diretório ativo é compartilhado entre os hosts da instância.
zh_tw: 未產生 XML 檔。請驗證是否在實例主機之間共用了工作目錄。

# CDISP9143I
source: The following instance is used to run the transport performance tests: {0}.
de: Mit der folgenden Instanz werden die Transportleistungstests ausgeführt: {0}.
es: Se utiliza la instancia siguiente para ejecutar las pruebas de rendimiento de transporte: {0}.
ko: 전송 성능 테스트를 실행하는 데 다음 인스턴스가 사용되었습니다: {0}.
pt_br: O exemplo a seguir é usado para executar os testes de desempenho de transporte: {0}.
zh_tw: 下列實例用於執行傳輸效能測試：{0}。

# CDISP9144I
source: The transport performance benchmark is running and using a tuple size of {0} bytes.
de: Die Transportleistungsbenchmark wird ausgeführt und verwendet die Tupelgröße von {0} Byte.
es: La prueba de referencia de rendimiento de transporte se está ejecutando y está utilizando un tamaño de tupla de {0} bytes.
ko: 전송 성능 벤치 마크가 실행 중이며 {0}바이트의 튜플 크기를 사용하고 있습니다.
pt_br: A avaliação de desempenho de transporte está em execução e usando um tamanho de tupla de {0} bytes.
zh_tw: 傳輸效能基準性能測試在執行中，並且正在使用的值組大小為 {0} 個位元組。

# CDISP9145I
source: The transport performance benchmark for the {0} transport is compiling in the {1} temporary directory.
de: Die Transportleistungsbenchmark für das Transportprotokoll {0} wird im temporären Verzeichnis {1} kompiliert.
es: La prueba de referencia de rendimiento de transporte para el transporte {0} se está compilando en el directorio temporal {1}.
ko: {0} 전송에 대한 전송 성능 벤치 마크가 {1} 임시 디렉토리에서 컴파일 중입니다.
pt_br: A avaliação de desempenho de transporte para o transporte {0} está compilando no diretório temporário {1}.
zh_tw: 適用於 {0} 傳輸的傳輸效能基準性能測試正在 {1} 暫存目錄中進行編譯。

# CDISP9146I
source: The transport performance benchmark is complete. The following XML file for the transport statistics is now being generated: {0}.
de: Die Transportleistungsbenchmark ist vollständig. Die folgende XML-Datei für die Transportstatistikdaten wird nun generiert: {0}.
es: La prueba de referencia de rendimiento de transporte se ha completado. El archivo XML siguiente para las estadísticas de transporte se están generando ahora: {0}.
ko: 전송 성능 벤치 마크가 완료되었습니다. 전송 성능에 대한 다음 XML 파일이 생성되는 중입니다: {0}.
pt_br: A avaliação de desempenho de transporte está concluída. O arquivo XML a seguir para as estatísticas de transporte está sendo gerado: {0}.
zh_tw: 傳輸效能基準性能測試已完成。現在，正在產生傳輸統計資料的下列 XML 檔：{0}。

# CDISP9147E
source: The transport performance benchmark failed to build.
de: Die Transportleistungsbenchmark konnte nicht erzeugt werden.
es: La prueba de referencia de rendimiento de transporte no se ha podido crear.
ko: 전송 성능 벤치 마크가 빌드에 실패했습니다.
pt_br: A avaliação de desempenho de transporte falhou ao construir.
zh_tw: 傳輸效能基準性能測試建置失敗。

# CDISP9148E
source: The FileSink output tuple requires one rstring attribute.
de: Das Ausgabetupel des Operators ''FileSink'' erfordert ein rstring-Attribut.
es: La tupla de salida FileSink requiere un atributo rstring.
ko: FileSink 출력 튜플은 하나의 rstring 속성을 필요로 합니다.
pt_br: A tupla de saída FileSink requer um atributo rstring.
zh_tw: FileSink 輸出值組需要一個 rstring 屬性。

# CDISP9149E
source: The closeMode parameter of the {0} kind also requires the {1} parameter.
de: Der Parameter ''closeMode'' der Art {0} erfordert auch den Parameter {1}.
es: El parámetro closeMode del tipo {0} también requiere el parámetro {1}.
ko: {0} 종류의 closeMode 매개변수는 {1} 매개변수를 필요로 합니다.
pt_br: O parâmetro closeMode do tipo {0} também requer o parâmetro {1}.
zh_tw: {0} 類型的 closeMode 參數還需要 {1} 參數。

# CDISP9150E
source: The type of the {0} parameter of the FileSink operator is {1}. The expected type is: uint32/uint64.
de: Der Typ des Parameters {0} des Operators FileSink ist {1}. Erwarteter Typ: uint32/uint64.
es: El tipo del parámetro {0} del operador FileSink es {1}. El tipo esperado es: uint32/uint64.
ko: FileSink 연산자의 {0} 매개변수 유형이 {1}입니다. 예상 유형은 uint32/uint64입니다.
pt_br: O tipo do parâmetro {0} do operador FileSink é {1}. O tipo esperado é: uint32/uint64.
zh_tw: FileSink 運算子之 {0} 參數的類型是 {1}。預期的類型是：uint32/uint64。

# CDISP9151E
source: The {0} parameter of the FileSink operator is not valid with the closeMode parameter of the {1} kind.
de: Der Parameter {0} des Operators FileSink ist mit dem Parameter closeMode der Art {1} nicht gültig.
es: El parámetro {0} del operador FileSink no es válido con el parámetro closeMode del tipo {1}.
ko: FileSink 연산자의 {0} 매개변수가 {1} 종류의 closeMode 매개변수에 대해 유효하지 않습니다.
pt_br: O parâmetro {0} do operador FileSink não é válido com o parâmetro closeMode do tipo {1}.
zh_tw: FileSink 運算子的 {0} 參數不適用於 {1} 類型的 closeMode 參數。

# CDISP9152I
source: usage: {0} -h, --help | -f, --file <file> -h, --help Get (this) usage information -f, --file <file> info.xml file Check whether the info.xml file is well formed and valid.
de: Syntax: {0} -h, --help | -f, --file <Datei> -h, --help (Diese) Syntaxinformationen abrufen -f, --file <Datei> Datei ''info.xml'' Überprüft, ob die Datei ''info.xml'' korrekt formatiert und gültig ist.
es: uso: {0} -h, --help | -f, --file <file> -h, --help Obtener (esta) información de uso -f, --file <file> Archivo info.xml Comprobar si el archivo info.xml está bien formado y es válido.
ko: 사용법: {0} -h, --help | -f, --file <file> -h, --help 사용법 정보를 가져옵니다. -f, --file <file> info.xml 파일 info.xml 파일의 형식이 올바르며 유효한지 확인합니다.
pt_br: uso: {0} -h, --help | -f, --file <file> -h, --help obtém (estas) informações de uso -f, --file <file> arquivo info.xml Verifique se o arquivo info.xml está bem formado e válido.
zh_tw: 用法：{0} -h, --help | -f, --file <file> -h, --help 取得（此）用法資訊 -f, --file <file> info.xml 檔 檢查 info.xml 檔的格式是否正確以及是否有效。

# CDISP9153E
source: The info.xml file is not specified.
de: Die Datei ''info.xml'' wurde nicht angegeben.
es: El archivo info.xml no se ha especificado.
ko: info.xml 파일이 지정되지 않았습니다.
pt_br: O arquivo info.xml não está especificado.
zh_tw: 未指定 info.xml 檔。

# CDISP9154I
source: usage: {0} -h, --help | -f, --file <file> -h, --help Get (this) usage information -f, --file <file> Toolkit list xml file Check whether the Toolkit list xml file is well formed and valid.
de: Syntax: {0} -h, --help | -f, --file <Datei> -h, --help (Diese) Syntaxinformationen abrufen -f, --file <Datei> XML-Datei für Toolkitliste Überprüft, ob die XML-Datei für Toolkitliste korrekt formatiert und gültig ist.
es: uso: {0} -h, --help | -f, --file <file> -h, --help Obtener (esta) información de uso -f, --file <file> Archivo xml de lista de kits de herramientas Comprobar si el archivo xml de lista de kits de herramientas está bien formado y es válido.
ko: 사용법: {0} -h, --help | -f, --file <file> -h, --help 사용법 정보를 가져옵니다. -f, --file <file> 툴킷 목록 xml 파일 툴킷 목록 xml 파일의 형식이 올바르며 유효한지 확인합니다.
pt_br: uso: {0} -h, --help | -f, --file <file> -h, --help obtém (estas) informações de uso -f, --file <file> arquivo XML da lista de kit de ferramentas Verifique se o arquivo XML da lista de kit de ferramentas está bem formado e válido.
zh_tw: 用法：{0} -h, --help | -f, --file <file> -h, --help 取得（此）用法資訊 -f, --file <file> 工具箱清單 XML 檔 檢查工具箱清單 XML 檔的格式是否正確以及是否有效。

# CDISP9155E
source: The XML file for the toolkit list is not specified.
de: Die XML-Datei für die Toolkitliste ist nicht angegeben.
es: El archivo XML para la lista de kits de herramientas no se ha especificado.
ko: 툴킷 목록에 대한 XML 파일이 지정되지 않았습니다.
pt_br: O arquivo XML para a lista de kit de ferramentas não está especificado.
zh_tw: 未指定工具箱清單的 XML 檔。

# CDISP9156E
source: The hasHeaderLine parameter is valid only with the csv format.
de: Der Parameter ''hasHeaderLine'' ist nur mit dem CSV-Format gültig.
es: El parámetro hasHeaderLine solo es válido con el formato csv.
ko: hasHeaderLine 매개변수는 csv 형식에 대해서만 유효합니다.
pt_br: O parâmetro hasHeaderLine é válido somente com o formato CSV.
zh_tw: hasHeaderLine 參數僅適用於 CSV 格式。

# CDISP9157E
source: The type of the tuple in the {0} parameter does not match the schema for input port number {1}.
de: Der Typ des Tupels im Parameter {0} stimmt nicht mit dem Schema für Eingabeportnummer {1} überein.
es: El tipo de la tupla en el parámetro {0} no coincide con el esquema para el número de puerto de entrada {1}.
ko: {0} 매개변수의 튜플 유형이 입력 포트 번호 {1}의 스키마와 일치하지 않습니다.
pt_br: O tipo da tupla no parâmetro {0} não corresponde ao esquema para o número da porta de entrada {1}.
zh_tw: {0} 參數中值組的類型，與輸入埠號 {1} 的綱目不符。

# CDISP9158E
source: The type of the primitive operator cannot be determined from the {0} operator model file. Verify the operator model by using the spl-verify-operator-model command.
de: Der Typ des primitiven Operators kann nicht aus der Operatormodelldatei {0} ermittelt werden. Verifizieren Sie das Operatormodell mit dem Befehl ''spl-verify-operator-model''.
es: El tipo del operador de primitiva no se puede determinar a partir del archivo de modelo de operador {0}. Verifique el modelo de operador utilizando el mandato spl-verify-operator-model.
ko: {0} 연산자 모델 파일에서 기본 연산자의 유형을 판별할 수 없습니다. spl-verify-operator-model 명령을 사용하여 연산자 모델을 확인하십시오.
pt_br: O tipo do operador primitivo não pode ser determinado a partir do arquivo de modelo do operador {0}. Verifique o modelo do operador usando o comando spl-verify-operator-model.
zh_tw: 從 {0} 運算子模型檔，無法判定初始運算子的類型。請使用 spl-verify-operator-model 指令來驗證運算子模型。

# CDISP9159E
source: The {0} operator name is not valid. The name must be a valid SPL identifier.
de: Der Operatorname {0} ist nicht gültig. Der Name muss eine gültige SPL-Kennung sein.
es: El nombre de operador {0} no es válido. El nombre debe ser un identificador SPL válido.
ko: {0} 연산자 이름이 유효하지 않습니다. 이 이름은 유효한 SPL ID여야 합니다.
pt_br: O nome do operador {0} não é válido. O nome deve ser um identificador SPL válido.
zh_tw: {0} 運算子名稱無效。該名稱必須是有效的 SPL ID。

# CDISP9160E
source: The type of the hasHeaderLine parameter value is {0}, but either the boolean or uint32 type is expected.
de: Der Typ des Werts des Parameters ''hasHeaderLine'' ist {0}, jedoch wird der Typ boolean oder uint32 erwartet.
es: El tipo del valor de parámetro hasHeaderLine es {0}, pero se espera el tipo booleano o uint32.
ko: hasHeaderLine 매개변수 값의 유형이 {0}이지만 기대된 항목은 boolean 또는 uint32 유형입니다.
pt_br: O tipo do valor do parâmetro hasHeaderLine é {0}, mas o tipo booleano ou uint32 é esperado.
zh_tw: hasHeaderLine 參數值的類型是 {0}，但預期為布林類型或 uint32 類型。

# CDISP9161W
source: The {0} partition eviction policy is ignored.
de: Die Partitionsbereinigungsrichtlinie {0} wird ignoriert.
es: Se ignora la política de desalojo de partición {0}.
ko: {0} 파티션 제거 정책이 무시됩니다.
pt_br: A política de desocupação de partição {0} é ignorada.
zh_tw: 已忽略 {0} 分割區收回原則。

# CDISP9162W
source: The {0} partition eviction selector is not valid. The supported values are: LRU and OperatorDefined.
de: Der Partitionsbereinigungsselektor {0} ist nicht gültig. Unterstützte Werte: LRU und OperatorDefined.
es: El selector de desalojo de partición {0} no es válido. Los valores soportados son: LRU y OperatorDefined.
ko: {0} 파티션 제거 셀렉터가 유효하지 않습니다. 지원되는 값은 LRU 및 OperatorDefined입니다.
pt_br: O seletor de desocupação de partição {0} não é válido. Os valores suportados são: LRUs e OperatorDefined.
zh_tw: {0} 分割區收回選取程式無效。支援的值為：LRU 和 OperatorDefined。

# CDISP9163W
source: WARNING
de: WARNUNG
es: AVISO
ko: 경고
pt_br: AVISO
zh_tw: 警告

# CDISP9164E
source: ERROR
de: FEHLER
ko: 오류
pt_br: ERRO
zh_tw: 錯誤

# CDISP9165E
source: The type of the {0} parameter is {1}, but the list of supported types is: {2}.
de: Der Typ des Parameters {0} ist {1}, die Liste unterstützter Typen ist jedoch: {2}.
es: El tipo del parámetro {0} es {1}, pero la lista de tipos soportados es: {2}.
ko: {0} 매개변수의 유형이 {1}이지만 지원되는 유형의 목록은 {2}입니다.
pt_br: O tipo do parâmetro {0} é {1}, mas a lista de tipos suportados é: {2}.
zh_tw: {0} 參數的類型是 {1}，但支援的類型清單是：{2}。

# CDISP9166E
source: The interface parameter is valid only when the name parameter is specified and the role is server.
de: Der Parameter ''interface'' ist nur gültig, wenn der Parameter ''name'' angegeben ist und wenn für ''role'' die Angabe ''server'' gilt.
es: El parámetro de interfaz solo es válido cuando se especifica el parámetro de nombre y el rol es servidor.
ko: interface 매개변수는 name 매개변수가 지정되고 역할이 서버인 경우에만 유효합니다.
pt_br: O parâmetro de interface é válido somente quando o parâmetro de nome for especificado e a função for servidor.
zh_tw: 僅當指定了 name 參數且 role 是 server 時，interface 參數才有效。

# CDISP9167E
source: For a FileSource operator, the second output port requires one rstring attribute and one int32 attribute only.
de: Bei einem Dateiquellenoperator (FileSource) erfordert der zweite Ausgabeport nur ein rstring-Attribut und ein int32-Attribut.
es: Para un operador FileSource, el segundo puerto de salida solo requiere un atributo rstring y un atributo int32.
ko: FileSource 연산자의 경우, 두 번째 출력 포트는 하나의 rstring 속성과 하나의 int32 속성만을 필요로 합니다.
pt_br: Para um operador FileSource, a segunda porta de saída requer somente um atributo rstring e um atributo int32.
zh_tw: 對於 FileSource 運算子，第二個輸出埠只需要一個 rstring 屬性和一個 int32 屬性。

# CDISP9168E
source: The number of trigger values that are expected is {0}, but the number that was found is {1}.
de: Die Anzahl erwarteter Triggerwerte ist {0}, aber die Anzahl {1} wurde gefunden.
es: El número de valores de desencadenante que se esperan es {0}, pero el número que se ha encontrado es {1}.
ko: 기대되는 트리거 값의 수가 {0}개지만 발견된 값의 수가 {1}개입니다.
pt_br: O número de valores do acionador que são esperados é {0}, mas o número que foi localizado é {1}.
zh_tw: 預期的觸發程式值數目是 {0}，但找到的數目卻是 {1}。

# CDISP9169E
source: An input tuple requires only one attribute if the xmlInput parameter is not specified.
de: Ein Eingabetupel erfordert nur ein Attribut, wenn der Parameter ''xmlInput'' nicht angegeben ist.
es: Una tupla de entrada requiere solo un atributo si el parámetro xmlInput no se ha especificado.
ko: 입력 튜플은 xmlInput 매개변수가 지정되지 않은 경우 하나의 속성만을 필요로 합니다.
pt_br: Uma tupla de entrada requererá um atributo somente se o parâmetro xmlInput não estiver especificado.
zh_tw: 如果未指定 xmlInput 參數，則輸入值組只需要一個屬性。

# CDISP9170E
source: The {0} XML input type is not supported.
de: Der XML-Eingabetyp {0} wird nicht unterstützt.
es: El tipo de entrada XML {0} no está soportado.
ko: {0} XML 입력 유형은 지원되지 않습니다.
pt_br: O tipo de entrada XML {0} não é suportado.
zh_tw: {0} XML 輸入類型不受支援。

# CDISP9171E
source: The type of the {0} attribute must be map<rstring,rstring> without the flatten : attributes parameter.
de: Der Typ des Attributs {0} muss map<rstring,rstring> ohne den Parameter ''flatten : attributes'' sein.
es: El tipo del atributo {0} debe ser map<rstring,rstring> sin la presentación : parámatro de atributos
ko: {0} 속성의 유형은 flatten : attributes 매개변수가 없는 map<rstring,rstring>이어야 합니다.
pt_br: O tipo do atributo {0} deve ser map<rstring,rstring> sem o parâmetro flatten : attributes.
zh_tw: {0} 屬性的類型必須是 map<rstring,rstring>，但不指定 flatten : attributes 參數。

# CDISP9172E
source: The type of the {0} attribute must be rstring without the flatten : elements parameter.
de: Der Typ des Attributs {0} muss rstring ohne den Parameter ''flatten : elements'' sein.
es: El tipo del atributo {0} debe ser rstring sin la presentación : parámetro de elementos.
ko: {0} 속성의 유형은 flatten : elements 매개변수가 없는 rstring이어야 합니다.
pt_br: O tipo do atributo {0} deve ser rstring sem o parâmetro flatten : elements.
zh_tw: {0} 屬性的類型必須是 rstring，但不指定 flatten : elements 參數。

# CDISP9173E
source: The actual size of the bounded list is {0}. The expected value for the {1} type of the {2} attribute is 1.
de: Die tatsächliche Größe der begrenzten Liste ist {0}. Der erwartete Wert für den Typ {1} des Attributs {2} ist 1.
es: El tamaño real de la lista limitada es {0}. El valor esperado para el tipo {1} del atributo {2} es 1.
ko: 유한한 목록의 실제 크기가 {0}입니다. {2} 속성의 {1} 유형에 대해 기대된 값은 1입니다.
pt_br: O tamanho real da lista limitada é {0}. O valor esperado para o tipo {1} do atributo {2} é 1.
zh_tw: 已連結清單的實際大小是 {0}。{2} 屬性之 {1} 類型的預期值是 1。

# CDISP9174E
source: The {0} XML output conversion type is not supported for the {1} attribute.
de: Der XML-Ausgabekonvertierungstyp {0} wird für das Attribut {1} nicht unterstützt.
es: El tipo de conversión de salida XML {0} no está soportado para el atributo {1}.
ko: {0} XML 출력 변환 유형은 {1} 속성에 대해 지원되지 않습니다.
pt_br: O tipo de conversão de saída XML {0} não é suportado para o atributo {1}.
zh_tw: {1} 屬性不支援 {0} XML 輸出轉換類型。

# CDISP9175E
source: The {0} expression for output port number {1} must be a relative XPath.
de: Der Ausdruck {0} für Ausgabeportnummer {1} muss einer relativer XPath sein.
es: La expresión {0} para el número de puerto de salida {1} debe ser una XPath relativa.
ko: 출력 포트 번호 {1}에 대한 {0} 표현식은 상대적 XPath여야 합니다.
pt_br: A expressão {0} para o número da porta de saída {1} deve ser um XPath relativo.
zh_tw: 輸出埠號 {1} 的 {0} 表示式必須是相對 XPath。

# CDISP9176E
source: The ''{0}'' trigger expression for output port number {1} must be an absolute XPath.
de: Der Triggerausdruck ''{0}'' für Ausgabeportnummer {1} muss einer absoluter XPath sein.
es: La expresión de desencadenante ''{0}'' para el número de puerto de salida {1} debe ser una XPath absoluta.
ko: 출력 포트 번호 {1}에 대한 ''{0}'' trigger 표현식은 절대 XPath여야 합니다.
pt_br: O acionador de expressão ''{0}'' para o número da porta de saída {1} deve ser um XPath absoluto.
zh_tw: 輸出埠號 {1} 的 ''{0}'' 觸發程式表示式必須是絕對 XPath。

# CDISP9177E
source: The {0} trigger expression for output port number {1} must not end with a forward slash (/).
de: Der Triggerausdruck {0} für Ausgabeportnummer {1} darf nicht mit einem Schrägstrich (/) enden.
es: La expresión de desencadenante {0} para el número de puerto de salida {1} no debe acabar con una barra diagonal (/).
ko: 출력 포트 번호 {1}에 대한 {0} trigger 표현식은 슬래시(/)로 끝나지 않아야 합니다.
pt_br: A expressão do acionador {0} para o número da porta de saída {1} não deve terminar com uma barra (/).
zh_tw: 輸出埠號 {1} 的 {0} 觸發程式表示式不得以正斜線 (/) 結尾。

# CDISP9178E
source: Double forward slashes (//) are not supported in the {0} XPath expression for output port number {1}.
de: Doppelte Schrägstriche (//) werden im XPath-Ausdruck {0} für Ausgabeportnummer {1} nicht unterstützt.
es: Las barras inclinadas dobles (//) no están soportadas en la expresión XPath {0} para el número de puerto de salida {1}.
ko: 이중 슬래시(//)는 출력 포트 번호 {1}에 대한 {0} XPath 표현식에서 지원되지 않습니다.
pt_br: Barras duplas (//) não são suportadas na expressão XPath {0} para o número da porta de saída {1}.
zh_tw: 在輸出埠號 {1} 的 {0} XPath 表示式中，不支援雙正斜線 (//)。

# CDISP9179E
source: The XPath expression for the {0} tuple attribute must end with ''text()'' or ''@<attributeLabel>'', but the following XPath expression was found: {1}.
de: Der XPath-Ausdruck für das Tupelattribut {0} muss mit ''text()'' oder ''@<attributeLabel>'' enden, jedoch wurde der folgende XPath-Ausdruck gefunden: {1}.
es: La expresión XPath para el atributo de tupla {0} debe acabar con ''text()'' o ''@<attributeLabel>'', pero se ha encontrado la expresión XPath siguiente: {1}.
ko: {0} 튜플 속성에 대한 XPath 표현식은 ''text()'' 또는 ''@<attributeLabel>''로 끝나야 하지만 다음 XPath 표현식을 발견했습니다: {1}.
pt_br: A expressão XPath para o atributo da tupla {0} deve terminar com ''text ()'' ou ''@<attributeLabel>'', mas a expressão XPath a seguir foi localizada: {1}.
zh_tw: {0} 值組屬性的 XPath 表示式必須以 ''text()'' 或 ''@<attributeLabel>'' 結尾，但卻找到下列 XPath 表示式：{1}。

# CDISP9180E
source: The {0} XML output conversion type for the {1} attribute is not supported.
de: Der XML-Ausgabekonvertierungstyp {0} für das Attribut {1} wird nicht unterstützt.
es: El tipo de conversión de salida XML {0} para el atributo {1} no está soportado.
ko: {1} 속성에 대한 {0} XML 출력 변환 유형은 지원되지 않습니다.
pt_br: O tipo de conversão de saída XML {0} para o atributo {1} não é suportado.
zh_tw: {1} 屬性的 {0} XML 輸出轉換類型不受支援。

# CDISP9181E
source: The type of the {0} attribute must be map<rstring,rstring> if the XPath uses @* for output port number {1}.
de: Der Typ des Attributs {0} muss map<rstring,rstring> sein, wenn XPath @* für Ausgabeportnummer {1} verwendet.
es: El tipo del atributo {0} debe ser map<rstring,rstring> si XPath utiliza @* para el número de puerto de salida {1}.
ko: XPath에서 출력 포트 번호 {1}에 대해 @*를 사용하는 경우에는 {0} 속성의 유형이 map<rstring,rstring>이어야 합니다.
pt_br: O tipo do atributo {0} deverá ser map<rstring,rstring>, se o XPath usar @* para o número da porta de saída {1}.
zh_tw: 如果 XPath 將 @* 用於輸出埠號 {1}，則 {0} 屬性的類型必須是 map<rstring,rstring>。

# CDISP9182E
source: The XPathMap output function must be used for the map<rstring,rstring> {0} attribute.
de: Die XPathMap-Ausgabefunktion muss für das Attribut map<rstring,rstring> {0} verwendet werden.
es: La función de salida de XPathMap se debe utilizar para el atributo map<rstring,rstring> {0}.
ko: map<rstring,rstring> {0} 속성에는 XPathMap 출력 함수를 사용해야 합니다.
pt_br: A função de saída XPathMap deve ser usada para o atributo map<rstring,rstring> {0}.
zh_tw: XPathMap 輸出函數必須用於 map<rstring,rstring> {0} 屬性。

# CDISP9183E
source: The use of the XPath expression in the {0} expression for output port number {1} is not valid.
de: Die Verwendung des XPath-Ausdrucks im Ausdruck {0} für Ausgabeportnummer {1} ist nicht gültig.
es: El uso de la expresión XPath en la expresión {0} para el número de puerto de salida {1} no es válido.
ko: 출력 포트 번호 {1}에 대한 {0} 표현식에서의 XPath 표현식 사용은 유효하지 않습니다.
pt_br: O uso da expressão XPath na expressão {0} para o número da porta de saída {1} não é válido.
zh_tw: 在輸出埠號 {1} 的 {0} 表示式中，使用 XPath 表示式是無效動作。

# CDISP9184E
source: The second argument to the {0} function needs to be a tuple literal for output port number {1}.
de: Das zweite Argument für die Funktion {0} muss ein Tupelliteral für Ausgabeportnummer {1} sein.
es: El segundo argumento en la función {0} debe ser un literal de tupla para el número de puerto de salida {1}.
ko: {0} 함수의 두 번째 인수는 출력 포트 번호 {1}에 대한 튜플 리터럴이어야 합니다.
pt_br: O segundo argumento para a função {0} precisa ser um literal de tupla para o número da porta de saída {1}.
zh_tw: {0} 函數的第二個引數需要是輸出埠號 {1} 的值組文字。
