Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLRuntimeMessages_*.xlf
Languages: de, fr

# CDISR5255E
source: The literal value {0} in a filter expression is cannot be cast to floating point type {1} because its absolute value is below the lowest value for its target type, {2}.
de: Der Literalwert {0} in einem Filterausdruck kann nicht in einen Gleitkommatyp {1} umgesetzt werden, weil sein absoluter Wert unter dem niedrigen Wert für seinen Zieltyp {2} liegt.
fr: La valeur littérale {0} présente dans une expression de filtrage ne peut pas être transtypée vers le type virgule flottante {1} car sa valeur absolue est inférieure à la valeur la plus basse pour son type cible, {2}.

# CDISR5256E
source: The literal value {0} in a filter expression cannot be cast to type {1}.
de: Der Literalwert {0} in einem Filterausdruck kann nicht in den Typ {1} umgesetzt werden.
fr: La valeur littérale {0} présente dans une expression de filtrage ne peut pas être transtypée vers le type {1}.

# CDISR5257E
source: The {0} filter expression cannot be parsed.
de: Der Filterausdruck {0} kann nicht geparst werden.
fr: L''expression de filtrage {0} ne peut pas faire l''objet d''une analyse syntaxique.

# CDISR5258E
source: The {0} filter expression cannot be parsed. The parse failed around {1}.
de: Der Filterausdruck {0} kann nicht geparst werden. Das Parsing ist bei {1} fehlgeschlagen.
fr: L''expression de filtrage {0} ne peut pas faire l''objet d''une analyse syntaxique. L''analyse syntaxique a échoué aux environs de {1}.

# CDISR5259E
source: Invalid operation {0} on an attribute of type {1}.
de: Ungültige Operation {0} für ein Attribut des Typs {1}.
fr: Opération {0} non valide sur un attribut du type {1}.

# CDISR5260E
source: Attribute {0} is not boolean.
de: Attribut {0} ist nicht boolesch.
fr: L''attribut {0} n''est pas de type booléen.

# CDISR5261E
source: The input could not be decompressed.
de: Die Eingabe konnte nicht dekomprimiert werden.
fr: L''entrée n''a pas pu être décompressée.

# CDISR5262E
source: The consistent region drain operation could not be completed due to shutdown.
de: Die Bereinigungsoperation der konsistenten Region konnte aufgrund von Beendigung nicht abgeschlossen werden.
fr: Impossible de terminer l''opération DRAIN sur la région cohérente en raison d''un arrêt.

# CDISR5263E
source: The input port at the index {0,number,0} of the {1} operator is not imported.
de: Der Eingabeport im Index {0,number,0} des Operators {1} wird nicht importiert.
fr: Le port d''entrée au niveau de l''index {0,number,0} de l''opérateur {1} n''est pas importé.

# CDISR5264I
source: Standalone SPL Application
de: Eigenständige SPL-Anwendung
fr: Application SPL autonome

# CDISR5265I
source: Size of the queue for each output port
de: Größe der Warteschlange für jeden Ausgabeport
fr: Taille de la file d''attente pour chaque port de sortie

# CDISR5266I
source: Interval to determine the recent largest number of items queued
de: Intervall zum Bestimmen der letzten größten Anzahl Elemente in der Warteschlange
fr: Intervalle permettant de déterminer le plus grand nombre d''éléments récemment en file d''attente

# CDISR5267I
source: Number of items currently queued
de: Anzahl zurzeit in der Warteschlange stehender Elemente
fr: Nombre d''éléments actuellement en file d''attente

# CDISR5268I
source: Largest number of items queued
de: Größte Anzahl Elemente in der Warteschlange
fr: Plus grand nombre d''éléments en file d''attente

# CDISR5269I
source: Recent largest number of items queued
de: Letzte größte Anzahl Elemente in der Warteschlange
fr: Plus grand nombre d''éléments récemment en file d''attente

# CDISR5270I
source: Number of waits due to all queues full
de: Anzahl Wartezyklen, weil alle Warteschlangen voll waren
fr: Nombre d''attentes dû au fait que toutes les files d''attente sont pleines

# CDISR5271E
source: The operation {0} is not a supported operation in an import filter.
de: Die Operation {0} ist keine unterstützt Operation in einem Importfilter.
fr: L''opération {0} n''est pas une opération prise en charge dans un filtre d''importation.

# CDISR5272E
source: The window at the port index {0,number,0} of the {1} operator does not accept a policy of type {2}.
de: Das Fenster an Portindex {0,number,0} des Operators {1} akzeptiert keine Richtlinie des Typs {2}.
fr: La fenêtre au niveau de l''index du port {0,number,0} de l''opérateur {1} n''accepte pas de règle de type {2}.

# CDISR5273E
source: An attempt was made to convert an optional of one type to an optional of another type: optional<{0}>.
de: Es wurde versucht, ein optionales Element eines Typs in ein optionales Element eines anderen Typs zu konvertieren: optional<{0}>.
fr: Tentative de conversion d''un élément ''optional'' d''un certain type vers un autre élément ''optional'' d''un autre type : optional<{0}>.

# CDISR5274E
source: The {0} operator does not have a window.
de: Der Operator {0} hat kein Fenster.
fr: L''opérateur {0} ne dispose pas de fenêtre.

# CDISR5275E
source: The {0} operator does not have an event time window.
de: Der Operator {0} hat kein Ereigniszeitfenster.
fr: L''opérateur {0} n''a pas de fenêtre d''heure d''événement.

# CDISR5276E
source: The getEventTime function was called on a tuple without an event-time attribute.
de: Die getEventTime-Funktion wurde für ein Tupel ohne Ereigniszeitattribut aufgerufen.
fr: La fonction getEventTime a été appelée sur un bloc de données sans attribut event-time.

# CDISR5277E
source: A watermark was received from the unexpected source, the {1,number,0} port of the {0} operator.
de: Eine Grenze wurde aus einer unerwarteten Quelle empfangen: von Port {1,number,0} des Operators {0}.
fr: Une cote d''alerte a été reçue en provenance d''une source inattendue, le port {1,number,0} de l''opérateur {0}.

# CDISR5278E
source: The operation {0} is not supported.
de: Die Operation {0} wird nicht unterstützt.
fr: L''opération {0} n''est pas prise en charge.

# CDISR5279E
source: A watermark {0} was received which was earlier than the operator''s current watermark {1}. The watermark was received from operator {2}, port {3,number,0}.
de: Eine Grenze {0} wurde empfangen, die vor der aktuellen Grenze {1} des Operators liegt. Die Grenze wurde von Operator {2}, Port {3,number,0} empfangen.
fr: Une cote d''alerte {0} antérieure à la cote d''alerte actuelle {1} de l''opérateur a été reçue. Cette cote d''alerte provient de l''opérateur {2}, port {3,number,0}.

# CDISR5280E
source: A value handle representing an optional type was accessed when null.
de: Auf eine Wertkennung, die einen optionalen Typ darstellt, wurde zugegriffen, als sie null war.
fr: Accès à un indicateur de valeur représentant un type facultatif (optional) alors que sa valeur est null.

# CDISR5281W
source: Operator cannot generate watermarks. It has 0 input ports and EventTimeContext watermark mode {0}.
de: Operator kann keine Grenzen generieren. Er hat 0 Eingabeports und EventTimeContext-Grenzmodus {0}.
fr: L''opérateur ne peut pas générer de cote d''alerte. Il dispose de 0 port d''entrée et du mode de cote d''alerte EventTimeContext {0}.

# CDISR5282W
source: Watermark lag ignored for operator annotated with EventTimeContext watermark mode {0}.
de: Grenzverzögerung ignoriert für Operator, der mit EventTimeContext-Grenzmodus {0} mit Annotationen versehen wurde.
fr: Décalage de cote d''alerte ignoré pour l''opérateur annoté avec le mode de cote d''alerte EventTimeContext {0}.
