Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP9001I
source: usage: {0} -h, --help | -t, --type <type> [-o, --output <dir>] [-r, --nsroot <dir>] [-n, --noindex] [--resdir <dir>] <baseName> -h, --help Get (this) usage information -t, --type <type> The type we are generating a code generator for. It must be one of: * EnumerationModel * TupleModel * OperatorInstanceModel * PEModel * StandaloneModel * Script -o, --output <dir> Output directory to use (only used for Script) -r, --nsroot <dir> Root of the namespace directory (only used for Script) -n, --noindex Suppresses generation of the index files --resdir <dir> A directory that contains translatable resource macros (only used for OperatorInstanceModel) <baseName> The name that forms the template when suffixed with .cgt and the code generator when suffixed with .pm or .pl This module generates a code generator from a code generator template.
de: Syntax: {0} -h, --help | -t, --type <Typ> [-o, --output <Verzeichnis>] [-r, --nsroot <Verzeichnis>] [-n, --noindex] [--resdir <Verzeichnis>] <Basisname> -h, --help (Diese) Syntaxinformationen abrufen -t, --type <Typ> Typ, für den ein Codegenerator generiert wird. Er muss einer der folgenden Typen sein: * EnumerationModel * TupleModel * OperatorInstanceModel * PEModel * StandaloneModel * Script -o, --output <Verzeichnis> Zu verwendendes Ausgabeverzeichnis (nur für Script verwendet) -r, --nsroot <Verzeichnis> Root des Namensbereichsverzeichnisses (nur für Script verwendet) -n, --noindex Generierung der indexierten Dateien unterdrücken --resdir <Verzeichnis> Verzeichnis, das übersetzbare Ressourcenmakros enthält (nur für OperatorInstanceModel verwendet) <Basisname> Name, der die Vorlage mit Suffix .cgt und den Codegenerator mit Suffix .pm oder .pl bildet Dieses Modul generiert einen Codegenerator über eine Codegeneratorvorlage.
es: uso: {0} -h, --help | -t, --type <type> [-o, --output <dir>] [-r, --nsroot <dir>] [-n, --noindex] [--resdir <dir>] <baseName> -h, --help Obtener (esta) información de uso -t, --type <type> El tipo para el cual se está generando un generador de código. Debe ser de uno de estos tipos: * EnumerationModel * TupleModel * OperatorInstanceModel * PEModel * StandaloneModel * Script -o, --output <dir> Directorio de salida para utilizar (solo se utiliza para Script) -r, --nsroot <dir> Raíz del directorio del espacio de nombres (solo se utiliza para Script) -n, --noindex Suprime la generación de los archivos de índice --resdir <dir> Un directorio que contiene macros de recurso traducibles (solo se utiliza para OperatorInstanceModel) <baseName> El nombre que forma la plantilla cuando se le añade el sufijo .cgt y el generador de código cuando se le añade el sufijo .pm o .pl Este módulo genera un generador de códigos a partir de una plantilla de generador de códigos.
ko: 사용법: {0} -h, --help | -t, --type <type> [-o, --output <dir>] [-r, --nsroot <dir>] [-n, --noindex] [--resdir <dir>] <baseName> -h, --help 사용법 정보를 가져옵니다. -t, --type <type> 코드 생성 프로그램 생성 대상이 되는 유형입니다. 이는 다음 중 하나여야 합니다: * EnumerationModel * TupleModel * OperatorInstanceModel * PEModel * StandaloneModel * Script -o, --output <dir> 사용할 출력 디렉토리입니다(Script의 경우에만 사용됨). -r, --nsroot <dir> 네임스페이스 디렉토리의 루트입니다(Script의 경우에만 사용됨). -n, --noindex 인덱스 파일의 생성을 제외합니다. --resdir <dir> 변환 가능한 자원 매크로를 포함하는 디렉토리입니다(OperatorInstanceModel의 경우에만 사용됨). <baseName> .cgt로 접미부가 지정된 경우 템플리트, .pm 또는 .pl로 접미부가 지정된 경우 코드 생성 프로그램을 구성하는 데 사용되는 이름입니다. 이 모듈은 코드 생성 프로그램 템플리트로부터 코드 생성 프로그램을 생성합니다.
pt_br: uso: {0} -h, --help | -t, --type <type> [-o, --output <dir>] [-r, --nsroot <dir>] [-n, --noindex] [--resdir <dir>] <baseName> -h, --help obtém (estas) informações de uso -t, --type <type> o tipo a partir do qual um gerador de código está sendo criado. Deve ser um de: * EnumerationModel * TupleModel * OperatorInstanceModel * PEModel * StandaloneModel * Script -o, --output <dir> diretório de saída a ser usado (somente para Script) -r, --nsroot <dir> raiz do diretório de namespace (somente para Script) -n, --noindex suprime a geração dos arquivos de índice --resdir <dir> um diretório que contém macros de recursos passíveis de conversão (somente para OperatorInstanceModel) <baseName> o nome que forma o modelo quando tem o sufixo .cgt e o gerador de código quando tem o sufixo .pm ou .pl Esse módulo cria um gerador de código a partir de um modelo de gerador de código.
zh_tw: 用法：{0} -h, --help | -t, --type <type> [-o, --output <dir>] [-r, --nsroot <dir>] [-n, --noindex] [--resdir <dir>] <baseName> -h, --help 取得（此）用法資訊 -t, --type <type> 正在對其產生程式碼產生器的類型。它必須是下列其中一個： * EnumerationModel * TupleModel * OperatorInstanceModel * PEModel * StandaloneModel * Script -o, --output <dir> 要使用的輸出目錄（僅用於 Script） -r, --nsroot <dir> 名稱空間目錄的根目錄（僅用於 Script） -n, --noindex 暫停產生索引檔 --resdir <dir> 包含可翻譯資源巨集的目錄（僅用於 OperatorInstanceModel） <baseName> 用於構成範本（具有 .cgt 字尾時）和程式碼產生器（具有 .pm 或 .pl 字尾時）的名稱 此模組會從程式碼產生器範本產生程式碼產生器。

# CDISP9002I
source: usage: {0} -h, --help | [--brief-opmodel] [-i, --directory <dir>] [-k, --kind <kind>] [-s, --silent] --brief-opmodel Do not generate sample sections (commented out) in the operator model -h, --help Get (this) usage information -i, --directory <dir> Directory containing the operator artifacts -k, --kind <kind> Generate templates for a specific operator kind. Options are: ''c++'' : A non-generic C++ operator ''generic'' : A generic mixed-mode C++ operator ''java'' : A non-generic Java operator -s, --silent Create skeleton code generator templates for missing artifacts without prompting the user Create code generator modules (<opname>_h.pm and <opname>_cpp.pm) from template files (<opname>_h.cgt and <opname>_cpp.cgt). Offer to create skeleton code generator templates (.cgt files) and a default operator model (.xml file), if they do not already exist.
de: Syntax: {0} -h, --help | [--brief-opmodel] [-i, --directory <Verzeichnis>] [-k, --kind <Art>] [-s, --silent] --brief-opmodel Keine Beispielabschnitte im Operatormodell generieren (auf Kommentar gesetzt) -h, --help (Diese) Syntaxinformationen abrufen -i, --directory <Verzeichnis> Verzeichnis mit Operatorartefakten -k, --kind <Art> Vorlagen für bestimmte Operatorat generieren. Optionen: ''c++'': nicht generischer C++-Operator ''generic'': generischer Mixed-Mode-C++-Operator ''java'': nicht generischer Java-Operator -s, --silent Gerüstcodegeneratorvorlagen für fehlende Artefakte ohne Benutzeraufforderung erstellen Erstellt Codegeneratormodule (<opname>_h.pm und <opname>_cpp.pm) über Vorlagendateien (<opname>_h.cgt und <opname>_cpp.cgt). Angebot zum Erstellen von Gerüstcodegeneratorvorlagen (.cgt-Dateien) und eines Standardoperatormodells (.xml-Datei), sofern noch nicht vorhanden.
es: uso: {0} -h, --help | [--brief-opmodel] [-i, --directory <dir>] [-k, --kind <kind>] [-s, --silent] --brief-opmodel No generar secciones de ejemplo (con comentarios) en el modelo de operador -h, --help Obtener (esta) información de uso -i, --directory <dir> Directorio que contiene los artefactos del operador -k, --kind <kind> Generar plantillas para un tipo de operador específico. Las opciones son: ''c++'' : Un operador C++ no genérico ''generic'' : Un operador C++ de modalidad mixta genérico ''java'' : Un operador Java no genérico -s, --silent Crear plantillas de generador de código de esqueleto para artefactos que faltan sin solicitar nada al usuario Cree módulos de generador de códigos (<opname>_h.pm y <opname>_cpp.pm) a partir de archivos de plantilla (<opname>_h.cgt y <opname>_cpp.cgt). Oferta para crear plantillas de generador de código de esqueleto (archivos .cgt) y un modelo de operador predeterminado (archivo .xml), si todavía no existen.
ko: 사용법: {0} -h, --help | [--brief-opmodel] [-i, --directory <dir>] [-k, --kind <kind>] [-s, --silent] --brief-opmodel 연산자 모델에 샘플 섹션(주석 처리됨)을 생성하지 않습니다. -h, --help 사용법 정보를 가져옵니다. -i, --directory <dir> 연산자 아티팩트를 포함하는 디렉토리입니다. -k, --kind <kind> 특정 연산자 종류의 템플리트를 생성합니다. 옵션은 다음과 같습니다. ''c++'' : 비일반 C++ 연산자 ''generic'' : 일반 혼합 모드 C++ 연산자 ''java'' : 비일반 Java 연산자 -s, --silent 사용자에게 프롬프트를 표시하지 않고 누락된 아티팩트에 대한 윤곽 코드 생성 프로그램 템플리트를 작성합니다. 템플리트 파일(<opname>_h.cgt 및 <opname>_cpp.cgt)로부터 코드 생성 프로그램 모듈(<opname>_h.pm 및 <opname>_cpp.pm)을 작성합니다. 윤곽 코드 생성 프로그램 템플리트(.cgt 파일) 및 기본 연산자 모델(.xml 파일)이 없는 경우에는 이를 작성할 수도 있습니다.
pt_br: uso: {0} -h, --help | [--brief-opmodel] [-i, --directory <dir>] [-k, --kind <kind>] [-s, --silent] --brief-opmodel não gera seções de amostra (comentadas) no modelo do operador -h, --help obtém (estas) informações de uso -i, --directory <dir> diretório contendo os artefatos do operador -k, --kind <kind> gera modelos para um tipo de operador específico. As opções são: ''c++'' : um operador C++ genérico ''generic'' : um operador C++ de modo misto não genérico ''java'' : um operador Java não genérico -s, --silent cria modelos do gerador de código de estrutura básica para artefatos ausentes sem solicitar o usuário Crie módulos de gerador de código (<opname>_h.pm e <opname>_cpp.pm) a partir de arquivos de modelo (<opname>_h.cgt e <opname>_cpp.cgt). Ofereça para criar modelos de geradores de código de estrutura básica (arquivos .cgt) e um modelo do operador padrão (arquivo .xml), se eles ainda não existirem.
zh_tw: 用法：{0} -h, --help | [--brief-opmodel] [-i, --directory <dir>] [-k, --kind <kind>] [-s, --silent] --brief-opmodel 不在運算子模型中產生區段範例（已註銷） -h, --help 取得（此）用法資訊 -i, --directory <dir> 包含運算子構件的目錄 -k, --kind <kind> 對特定的運算子類型產生範本。選項為： ''c++''：非一般 C++ 運算子 ''generic''：一般混合模式 C++ 運算子 ''java''：非一般 Java 運算子 -s, --silent 在不提示使用者的情況下，為遺漏的構件建立架構程式碼產生器範本 從範本檔（<opname>_h.cgt 和 <opname>_cpp.cgt）建立程式碼產生器模組（<opname>_h.pm 和 <opname>_cpp.pm）。 如果架構程式碼產生器範本（.cgt 檔）和預設運算子模型（.xml 檔）都不存在的話，則用於建立這兩者。

# CDISP9005I
source: usage: {0} -h, --help | -f, --file <file> -h, --help Get (this) usage information -f, --file <file> Operator model .xml file Check if the operator model .xml file is well-formed and valid.
de: Syntax: {0} -h, --help | -f, --file <Datei> -h, --help (Diese) Syntaxinformationen abrufen -f, --file <Datei> .xml-Datei des Operatormodells Überprüft, ob die .xml-Datei des Operatormodells korrekt formatiert und gültig ist.
es: uso: {0} -h, --help | -f, --file <file> -h, --help Obtener (esta) información de uso -f, --file <file> Archivo .xml de modelo de operador Compruebe si el archivo .xml del modelo de operador está bien formado y es válido.
ko: 사용법: {0} -h, --help | -f, --file <file> -h, --help 사용법 정보를 가져옵니다. -f, --file <file> 연산자 모델 .xml 파일입니다. 연산자 모델 .xml 파일의 형식이 올바르며 유효한지 확인합니다.
pt_br: usage: {0} -h, --help | -f, --file <file> -h, --help obtém (estas) informações de uso -f, --file <file> arquivo .xml do modelo do operador Verifique se o arquivo .xml de modelo do operador está bem-formado e válido.
zh_tw: 用法：{0} -h, --help | -f, --file <file> -h, --help 取得（此）用法資訊 -f, --file <file> 運算子模型 .xml 檔 檢查運算子模型 .xml 檔的格式是否正確以及是否有效。

# CDISP9006I
source: usage: {0} -h, --help | -f, --file <file> -h, --help Get this usage information -f, --file <file> Function model .xml file Check if the function model .xml file is well formed and valid.
de: Syntax: {0} -h, --help | -f, --file <Datei> -h, --help (Diese) Syntaxinformationen abrufen -f, --file <Datei> .xml-Datei des Funktionsmodells Überprüft, ob die .xml-Datei des Funktionsmodells korrekt formatiert und gültig ist.
es: uso: {0} -h, --help | -f, --file <file> -h, --help Obtener esta información de uso -f, --file <file> Archivo .xml del modelo de función Check if the function model El archivo .xml está bien formado y es válido.
ko: 사용법: {0} -h, --help | -f, --file <file> -h, --help 이 사용법 정보를 가져옵니다. -f, --file <file> 함수 모델 .xml 파일입니다. 함수 모델 .xml 파일의 형식이 올바르며 유효한지 확인합니다.
pt_br: uso: {0} -h, --help | -f, --file <file> -h, --help obtém estas informações de uso -f, --file <file> arquivo .xml de modelo de função Check if the function model o arquivo .xml está bem-formado e é válido.
zh_tw: 用法：{0} -h, --help | -f, --file <file> -h, --help 取得此用法資訊 -f, --file <file> 函數模型 .xml 檔 檢查函數模型 .xml 檔的格式是否正確以及是否有效。

# CDISP9007E
source: The {0} file cannot be opened for writing.
de: Die Datei {0} kann nicht zum Schreiben geöffnet werden.
es: El archivo {0} no se puede abrir para la escritura.
ko: {0} 파일을 쓰기를 위해 열 수 없습니다.
pt_br: O arquivo {0} não pode ser aberto para gravação.
zh_tw: 無法開啟 {0} 檔以進行寫入。

# CDISP9008E
source: The {0} file cannot be opened for reading.
de: Die Datei {0} kann nicht zum Lesen geöffnet werden.
es: El archivo {0} no se puede abrir para la lectura.
ko: {0} 파일을 읽기를 위해 열 수 없습니다.
pt_br: O arquivo {0} não pode ser aberto para leitura.
zh_tw: 無法開啟 {0} 檔以進行讀取。

# CDISP9009E
source: The {0} directory cannot be created.
de: Das Verzeichnis {0} kann nicht erstellt werden.
es: El directorio {0} no se puede crear.
ko: {0} 디렉토리를 작성할 수 없습니다.
pt_br: O diretório {0} não pode ser criado.
zh_tw: 無法建立 {0} 目錄。

# CDISP9010E
source: The {0} separator is not paired correctly.
de: Das Trennzeichen {0} ist nicht ordnungsgemäß paarweise verbunden.
es: El separador {0} no está emparejado correctamente.
ko: {0} 구분자의 쌍이 올바르지 않습니다.
pt_br: O separador {0} não está associado corretamente.
zh_tw: 未正確地配對 {0} 分隔字元。

# CDISP9013E
source: STDOUT could not be duplicated.
de: STDOUT konnte nicht dupliziert werden.
es: STDOUT no se ha podido duplicar.
ko: STDOUT을 복제하지 못했습니다.
pt_br: STDOUT não pôde ser duplicado.
zh_tw: 無法複製 STDOUT。

# CDISP9014E
source: STDOUT could not be restored.
de: STDOUT konnte nicht wiederhergestellt werden.
es: STDOUT no se ha podido restaurar.
ko: STDOUT을 복원하지 못했습니다.
pt_br: STDOUT não pôde ser restaurado.
zh_tw: 無法還原 STDOUT。

# CDISP9015T
source: interface
de: Schnittstelle
es: interfaz
ko: 인터페이스
pt_br: lógica
zh_tw: 介面

# CDISP9016T
source: implementation
de: Implementierung
es: implementación
ko: 구현
zh_tw: 實作

# CDISP9017I
source: Cannot find the {1} generator template file for the {0} operator.
de: Die Generatorvorlagendatei {1} für den Operator {0} kann nicht gefunden werden.
es: No se puede encontrar el archivo de plantilla del generador {1} para el operador {0}.
ko: {0} 연산자의 {1} 생성 프로그램 템플리트 파일을 찾을 수 없습니다.
pt_br: Não é possível localizar o arquivo de modelo do gerador {1} para o operador {0}.
zh_tw: 找不到 {0} 運算子的 {1} 產生器範本檔。

# CDISP9018E
source: The operator name cannot be derived from the directory context.
de: Der Operatorname kann nicht vom Verzeichniskontext abgeleitet werden.
es: El nombre de operador no se puede derivar a partir del contexto de directorio.
ko: 디렉토리 컨텍스트로부터 연산자 이름을 파생할 수 없습니다.
pt_br: O nome do operador não pode ser derivado do contexto de diretório.
zh_tw: 運算子名稱不能衍生自目錄環境定義。

# CDISP9019I
source: The {0} operator model file cannot be found.
de: Die Operatormodelldatei {0} kann nicht gefunden werden.
es: El archivo de modelo de operador {0} no se puede encontrar.
ko: {0} 연산자 모델 파일을 찾을 수 없습니다.
pt_br: O arquivo de modelo do operador {0} não pode ser localizado.
zh_tw: 找不到 {0} 運算子模型檔。

# CDISP9020T
source: Do you want to create the file? [y or n]
de: Wollen Sie die Datei erstellen? [y für ja oder n für nein]
es: ¿Desea crear el archivo? [y o n]
ko: 이 파일을 작성하시겠습니까? [y 또는 n]
pt_br: Deseja criar o arquivo? [y ou n]
zh_tw: 您要建立檔案嗎？[y 或 n]

# CDISP9021E
source: Multiple {0} generator template files were found: {1}<op-name>_{2}.cgt.
de: Mehrere {0}-Generatorvorlagendateien wurden gefunden: {1}<Operatorname>_{2}.cgt.
es: Se han encontrado varios archivos de plantilla de generador {0}: {1}<op-name>_{2}.cgt.
ko: 여러 {0} 생성 프로그램 템플리트 파일을 발견했습니다: {1}<op-name>_{2}.cgt.
pt_br: Múltiplos arquivos de modelo do gerador {0} foram localizados: {1}<op-name>_ {2}.cgt.
zh_tw: 找到多個 {0} 產生器範本檔：{1}<op-name>_{2}.cgt。

# CDISP9022I
source: The {0}.pm file is being generated.
de: Die Datei {0}.pm wird generiert.
es: Se está generando el archivo {0}.pm.
ko: {0}.pm 파일이 생성되는 중입니다.
pt_br: O arquivo {0}.pm está sendo gerado.
zh_tw: 正在產生 {0}.pm 檔。

# CDISP9023E
source: The {0}.pm file cannot be created.
de: Die Datei {0}.pm kann nicht erstellt werden.
es: No se puede crear el archivo {0}.pm.
ko: {0}.pm 파일을 작성할 수 없습니다.
pt_br: O arquivo {0}.pm não pode ser criado.
zh_tw: 無法建立 {0}.pm 檔。

# CDISP9024E
source: The base names of the {0}_h interface generator template and the {1}_cpp implementation generator template are different.
de: Die Basisnamen der Schnittstellengeneratorvorlage {0}_h und der Implementierungsgeneratorvorlage {1}_cpp unterscheiden sich voneinander.
es: Los nombres base de la plantilla del generador de interfaz {0}_h y la plantilla del generador de implementación {1}_cpp son diferentes.
ko: {0}_h 인터페이스 생성 프로그램 템플리트와 {1}_cpp 구현 생성 프로그램 템플리트의 기본 이름이 서로 다릅니다.
pt_br: Os nomes base do modelo de gerador de interface {0}_h e do modelo de gerador de implementação {1}_cpp são diferentes.
zh_tw: {0}_h 介面產生器範本與 {1}_cpp 實作產生器範本的基本名稱不同。

# CDISP9025E
source: The {0} current working directory name does not end with .{1}\n.
de: Der Name {0} des aktuellen Arbeitsverzeichnisses endet nicht mit .{1}\n.
es: El nombre del directorio de trabajo actual {0} no acaba con .{1}\n.
ko: {0} 현재 작업 디렉토리 이름이 .{1}\n(으)로 끝나지 않습니다.
pt_br: O diretório atualmente em funcionamento {0} não termina com .{1}\n.
zh_tw: {0} 現行工作目錄名稱不以 .{1} 結尾。\n

# CDISP9033I
source: {0}: Interruptions are disabled momentarily.
de: {0}: Unterbrechungen sind vorübergehend inaktiviert.
es: {0}: Las interrupciones están inhabilitadas momentáneamente.
ko: {0}: 인터럽션이 잠시 사용 안함으로 설정되었습니다.
pt_br: {0}: as interrupções são desativadas momentaneamente.
zh_tw: {0}：已暫時停用岔斷。

# CDISP9034E
source: The operator model file is not specified.
de: Die Operatormodelldatei wurde nicht angegeben.
es: El archivo de modelo de operador no se ha especificado.
ko: 연산자 모델 파일이 지정되지 않았습니다.
pt_br: O arquivo de modelo do operador não está especificado.
zh_tw: 未指定運算子模型檔。

# CDISP9035E
source: The function model file is not specified.
de: Die Funktionsmodelldatei wurde nicht angegeben.
es: El archivo de modelo de función no se ha especificado.
ko: 함수 모델 파일이 지정되지 않았습니다.
pt_br: O arquivo de modelo da função não está especificado.
zh_tw: 未指定函數模型檔。

# CDISP9036E
source: The {0} include file for the code generator template cannot be processed.
de: Die Include-Datei {0} für die Codegeneratorvorlage kann nicht verarbeitet werden.
es: El archivo de inclusión {0} para la plantilla de generador de código no se puede procesar.
ko: 코드 생성 프로그램 템플리트의 {0} 포함 파일을 처리할 수 없습니다.
pt_br: O arquivo include {0} para o modelo de gerador de código não pode ser processado.
zh_tw: 無法處理程式碼產生器範本的 {0} 併入檔。

# CDISP9037T
source: ERROR
de: FEHLER
ko: 오류
pt_br: ERRO
zh_tw: 錯誤

# CDISP9038T
source: WARNING
de: WARNUNG
es: AVISO
ko: 경고
pt_br: AVISO
zh_tw: 警告

# CDISP9040E
source: An unsupported window configuration was specified on the following input port number: {0,number,0}.
de: Eine nicht unterstützte Fensterkonfiguration wurde für die folgende Eingabeportnummer angegeben: {0,number,0}.
es: Se ha especificado una configuración de ventana no soportada en el número de puerto de entrada siguiente: {0,número,0}.
ko: 지원되지 않는 창 구성이 다음 입력 포트 번호에 지정되었습니다: {0,number,0}.
pt_br: Uma configuração de janela não suportada foi especificada no número da porta de entrada a seguir: {0,number,0}.
zh_tw: 對下列輸入埠號指定的視窗配置不受支援：{0,number,0}。

# CDISP9041E
source: A count-based trigger size of {0} is not valid. The only valid size is 1.
de: Eine anzahlbasierte Triggergröße {0} ist nicht gültig. Die einzige gültige Größe ist 1.
es: Un tamaño de desencadenante basado en recuento de {0} no es válido. El único tamaño válido es 1.
ko: {0}의 개수 기반 트리거 크기가 유효하지 않습니다. 유일하게 유효한 크기는 1입니다.
pt_br: Um tamanho de acionador baseado em contagem de {0} não é válido. O único tamanho válido é 1.
zh_tw: 計數型觸發程式大小 {0} 無效。唯一有效的大小是 1。

# CDISP9042E
source: The {1} parameter is missing. This parameter is mandatory for the {0} operator when a partitioned window is specified.
de: Der Parameter {1} fehlt. Dieser Parameter ist für den Operator {0} obligatorisch, wenn ein partitioniertes Fenster angegeben ist.
es: Falta el parámetro {1}. Este parámetro es obligatorio para el operador {0} cuando se especifica una ventana particionada.
ko: {1} 매개변수가 누락되었습니다. 이 매개변수는 파티션된 창이 지정된 경우 {0} 연산자에서 필수입니다.
pt_br: O parâmetro {1} está ausente. Este parâmetro é obrigatório para o operador {0} quando uma janela particionada é especificada.
zh_tw: 遺漏了 {1} 參數。當指定了已分割的視窗時，此參數是 {0} 運算子的必要項目。

# CDISP9043E
source: The partitioned window modifier is missing. This modifier is mandatory for the {0} operator when a {1} parameter is specified.
de: Der Modifikator des partitionierten Fensters fehlt. Dieser Modifikator ist für den Operator {0} obligatorisch, wenn ein Parameter {1} angegeben ist.
es: Falta el modificador de la ventana particionada. Este modificador es obligatorio para el operador {0} cuando se especifica un parámetro {1}.
ko: 파티션된 창 수정자가 누락되었습니다. 이 수정자는 {1} 매개변수가 지정된 경우 {0} 연산자에서 필수입니다.
pt_br: O modificador de janela particionada está ausente. Este modificador é obrigatório para o operador {0} quando um parâmetro {1} é especificado.
zh_tw: 遺漏了已分割的視窗修飾元。當指定了 {1} 參數時，此修飾元是 {0} 運算子的必要項目。

# CDISP9044E
source: The number of values that is specified for the order parameter is not valid. The expected number of values is: {0,number,0}. The actual number of values found is: {1,number,0}.
de: Die für den Parameter ''order'' angegebene Anzahl Werte ist nicht gültig. Erwartete Anzahl Werte: {0,number,0}. Tatsächliche Anzahl Werte: {1,number,0}.
es: El número de valores que se ha especificado para el parámetro de orden no es válido. El número previsto de valores es: {0,número,0}. El número real de valores encontrados es: {1,número,0}.
ko: order 매개변수에 대해 지정된 값 수가 유효하지 않습니다. 기대된 값 수는 {0,number,0}개입니다. 발견된 실제 값 수는 {1,number,0}개입니다.
pt_br: O número de valores que é especificado para o parâmetro de ordem não é válido. O número esperado de valores é: {0,number,0}. O número real de valores localizados é: {1,number,0}.
zh_tw: 對順序參數指定的值數目無效。預期的值數目為：{0,number,0}。所找到的實際值數目為：{1,number,0}。

# CDISP9045E
source: The type of the {0} sortBy parameter is {1}, which is not an ordered type.
de: Der Typ des Parameters ''sortBy'' in {0} ist {1}, der kein geordneter (ordered) Typ ist.
es: El tipo del parámetro sortBy {0} es {1}, que no es un tipo ordenado.
ko: {0} sortBy 매개변수의 유형이 {1}이며 이는 순서 지정되는 유형이 아닙니다.
pt_br: O tipo do parâmetro sortBy {0} é {1}, que não é um tipo ordenado.
zh_tw: {0} sortBy 參數的類型是 {1}，這不是已排序的類型。

# CDISP9046E
source: The eolMarker parameter is valid for the line format only.
de: Der Parameter ''eolMarker'' ist nur für das Zeilenformat gültig.
es: El parámetro eolMarker es válido solo para el formato de línea.
ko: eolMarker 매개변수는 행 형식에 대해서만 유효합니다.
pt_br: O parâmetro eolMarker é válido somente para o formato de linha.
zh_tw: eolMarker 參數只對行格式是有效的。

# CDISP9047E
source: The blockSize parameter is valid for the block format only.
de: Der Parameter ''blockSize'' ist nur für das Blockformat gültig.
es: El parámetro blockSize es válido solo para el formato de bloque.
ko: blockSize 매개변수는 블록 형식에 대해서만 유효합니다.
pt_br: O parâmetro blockSize é válido somente para o formato de bloco.
zh_tw: blockSize 參數只對區塊格式是有效的。

# CDISP9048E
source: When the format is block, the blockSize parameter must be set.
de: Wenn das Blockformat vorliegt, muss der Parameter ''blockSize'' festgelegt werden.
es: Cuando el formato es de bloque, el parámetro blockSize se debe establecer.
ko: 형식이 블록인 경우에는 blockSize 매개변수를 설정해야 합니다.
pt_br: Quando o formato é bloco, o parâmetro blockSize deve ser configurado.
zh_tw: 當格式為區塊時，必須設定 blockSize 參數。

# CDISP9049E
source: The hasDelayField option is valid with the following formats only: csv, txt, and bin.
de: Die Option ''hasDelayField'' ist nur für die folgende Formate gültig: csv, txt und bin.
es: La opción hasDelayField es válida solo con los formatos siguientes: csv, txt y bin.
ko: hasDelayField 옵션은 csv, txt, 및 bin 형식에 대해서만 유효합니다.
pt_br: A opção hasDelayField é válida somente com os seguintes formatos: csv, txt e bin.
zh_tw: hasDelayField 選項只對下列格式有效：csv、txt 和 bin。
