Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0672W
source: The {0} annotation is not functional in standalone mode. The annotation is ignored.
de: Die Annotation {0} ist im eigenständigen Modus nicht funktional. Die Annotation wird ignoriert.
es: La anotación {0} no es funcional en la modalidad autónoma. Se ignora la anotación.
ko: {0} 어노테이션은 독립형 모드에서 작동하지 않습니다. 이 어노테이션이 무시됩니다.
pt_br: A anotação {0} não é funcional no modo independente. A anotação é ignorada.
zh_tw: {0} 註釋在獨立式模式下不起作用。已忽略該註釋。

# CDISP0673E
source: An error was detected while the function model was loading. The error is: {0}.
de: Beim Laden des Funktionsmodells wurde ein Fehler erkannt. Fehler: {0}.
es: Se ha detectado un error mientras se cargaba el modelo de función. El error es: {0}.
ko: 함수 모델이 로드되는 중에 오류를 발견했습니다. 오류는 {0}입니다.
pt_br: Um erro foi detectado enquanto o modelo de função estava carregando. O erro é: {0}.
zh_tw: 載入函數模型時偵測到錯誤。錯誤為：{0}。

# CDISP0674E
source: An error was detected while the operator model was loading. The error is: {0}.
de: Beim Laden des Operatormodells wurde ein Fehler erkannt. Fehler: {0}.
es: Se ha detectado un error mientras se cargaba el modelo de operador. El error es: {0}.
ko: 연산자 모델이 로드되는 중에 오류를 발견했습니다. 오류는 {0}입니다.
pt_br: Um erro foi detectado enquanto o modelo do operador estava carregando. O erro é: {0}.
zh_tw: 載入運算子模型時偵測到錯誤。錯誤為：{0}。

# CDISP0675E
source: The value for the {0} parameter of the {1} annotation is not valid.
de: Der Wert für den Parameter {0} der Annotation {1} ist nicht gültig.
es: El valor para el parámetro {0} de la anotación {1} no es válido.
ko: {1} 어노테이션의 {0} 매개변수에 대한 값이 유효하지 않습니다.
pt_br: O valor para o parâmetro {0} da anotação {1} não é válido.
zh_tw: {1} 註釋之 {0} 參數的值無效。

# CDISP0676E
source: The {0} annotation requires that one of the following parameters be specified: {1}.
de: Die Annotation {0} erfordert, dass einer der folgenden Parameter angegeben wird: {1}.
es: La anotación {0} requiere que se especifique uno de los parámetros siguientes: {1}.
ko: {0} 어노테이션에서 다음 매개변수 중 하나를 지정할 것을 요구합니다: {1}.
pt_br: A anotação {0} requer que um dos seguintes parâmetros seja especificado: {1}.
zh_tw: {0} 註釋需要指定下列其中一個參數：{1}。

# CDISP0677E
source: The {0} and {1} annotation parameters are mutually exclusive.
de: Die Annotationsparameter {0} und {1} schließen sich gegenseitig aus.
es: Los parámetros de anotación {0} y {1} se excluyen mutuamente.
ko: {0} 및 {1} 어노테이션은 상호 배타적입니다.
pt_br: Os parâmetros de anotação {0} e {1} são mutuamente exclusivos.
zh_tw: {0} 註釋參數與 {1} 註釋參數互斥。

# CDISP0678E
source: The getSubmissionTimeValue intrinsic function is not allowed in the value expression for the {0} parameter of the {1} annotation.
de: Die interne Funktion ''getSubmissionTimeValue'' ist im Wertausdruck für den Parameter {0} der Annotation {1} nicht zulässig.
es: La función intrínseca getSubmissionTimeValue no está permitida en la expresión de valor para el parámetro {0} de la anotación {1}.
ko: getSubmissionTimeValue 내장 함수는 {1} 어노테이션의 {0} 매개변수에 대한 value 표현식에 허용되지 않습니다.
pt_br: A função intrínseca getSubmissionTimeValue não é permitida na expressão de valor para o parâmetro {0} da anotação {1}.
zh_tw: 在 {1} 註釋之 {0} 參數的值表示式中，不容許使用 getSubmissionTimeValue 本質函數。

# CDISP0679I
source: Display the errors for the enhanced operator or function model.
de: Fehler für den erweiterten Operator oder das Funktionsmodell anzeigen.
es: Muestre los errores para el operador o el modelo de función mejorado.
ko: 확장된 연산자 또는 함수 모델의 오류를 표시합니다.
pt_br: Exiba os erros do operador ou do modelo de função aprimorado.
zh_tw: 顯示增強型運算子或函數模型的錯誤。

# CDISP0680E
source: An error was detected while the function model was loading. The error is: {0}.
de: Beim Laden des Funktionsmodells wurde ein Fehler erkannt. Fehler: {0}.
es: Se ha detectado un error mientras se cargaba el modelo de función. El error es: {0}.
ko: 함수 모델이 로드되는 중에 오류를 발견했습니다. 오류는 {0}입니다.
pt_br: Um erro foi detectado enquanto o modelo de função estava carregando. O erro é: {0}.
zh_tw: 載入函數模型時偵測到錯誤。錯誤為：{0}。

# CDISP0681E
source: An error was detected while the operator model was loading. The error is: {0}.
de: Beim Laden des Operatormodells wurde ein Fehler erkannt. Fehler: {0}.
es: Se ha detectado un error mientras se cargaba el modelo de operador. El error es: {0}.
ko: 연산자 모델이 로드되는 중에 오류를 발견했습니다. 오류는 {0}입니다.
pt_br: Um erro foi detectado enquanto o modelo do operador estava carregando. O erro é: {0}.
zh_tw: 載入運算子模型時偵測到錯誤。錯誤為：{0}。

# CDISP0682E
source: The {0} function may not appear in the value expression of an annotation key/value parameter.
de: Die Funktion {0} darf nicht im Wertausdruck eines Annotationsparameters für Schlüssel/Wert vorkommen.
es: La función {0} puede no aparecer en la expresión de valor de un parámetro de clave/valor de anotación.
ko: {0} 함수는 어노테이션 key/value 매개변수의 value 표현식에 포함되지 않아야 합니다.
pt_br: A função {0} pode não aparecer na expressão de valor de um parâmetro de chave/valor de anotação.
zh_tw: {0} 函數不能出現在註釋索引鍵/值參數的值表示式中。

# CDISP0683E
source: The {0} annotation cannot be used on an operator in a parallel region.
de: Die Annotation {0} kann nicht in einem Operator in einer parallelen Region verwendet werden.
es: La anotación {0} no se puede utilizar en un operador en una región paralela.
ko: {0} 어노테이션은 병렬 영역의 연산자에 대해 사용할 수 없습니다.
pt_br: A anotação {0} não pode ser usada em um operador em uma região paralela.
zh_tw: 不能對平行區域中的運算子使用 {0} 註釋。

# CDISP0684E
source: Two consistent regions cannot be merged due to a conflict in submission-time parameter names.
de: Zwei konsistente Regionen können aufgrund eines Konflikts bei den Namen der Übergabezeitparameter nicht zusammengeführt werden.
es: Dos regiones coherentes no se pueden fusionar debido a un conflicto en nombres del parámetro submission-time.
ko: 제출 시간 매개변수 이름의 충돌로 인해 두 일관성 있는 영역을 병합할 수 없습니다.
pt_br: Duas regiões consistentes não podem ser mescladas devido a um conflito nos nomes de parâmetro de tempo de envio.
zh_tw: 由於提交時間參數名稱中的衝突，無法合併兩個一致區域。

# CDISP0685D
source: The other annotation is defined here.
de: Die andere Annotation ist hier definiert.
es: Aquí está definida la otra anotación.
ko: 다른 어노테이션이 여기 정의되어 있습니다.
pt_br: A outra anotação é definida aqui.
zh_tw: 另一個註釋是在這裡定義。

# CDISP0686I
source: A non-relative SAB file include or exclude path is specified in the info.xml file {0}.
de: Ein nicht relativer SAB-Dateipfad für ein Element ''include'' oder ''exclude'' ist in der Datei ''info.xml'' {0} angegeben.
es: Se ha especificado una vía de acceso de inclusión o exclusión de archivo SAB no relativo en el archivo info.xml {0}.
ko: 비상대적 SAB 파일 포함 또는 제외 경로가 info.xml 파일 {0}에 지정되어 있습니다.
pt_br: Um caminho de inclusão ou de exclusão de arquivo SAB não relativo é especificado no arquivo info.xml {0}.
zh_tw: 在 info.xml 檔 {0} 中，指定了非相對 SAB 檔併入或排除路徑。

# CDISP0687E
source: Standalone applications cannot be profiled.
de: Für eigenständige Anwendungen kann kein Profil erstellt werden.
es: No se pueden crear perfiles de aplicaciones autónomas.
ko: 독립형 애플리케이션은 프로파일링할 수 없습니다.
pt_br: Os aplicativos independentes não podem ter o perfil criado.
zh_tw: 無法側寫獨立式應用程式。

# CDISP0688E
source: Operators can not be declared relocatable but not restarable.
de: Operatoren können nicht als verschiebbar, jedoch nicht erneut startbar deklariert werden.
es: Los operadores no se pueden declarar como reubicables, sino como reiniciables.
ko: 연산자는 재배치 가능이면서 재시작 불가능으로 선언할 수 없습니다.
pt_br: Os operadores não podem ser declarados como realocáveis, mas não são reinicializáveis.
zh_tw: 不能將運算子宣告為可重新配置卻不可重新啟動。

# CDISP0689E
source: The getThisCompositeInstanceName function must be called from an operator instance. This requirement excludes static type definitions and the config clause of a composite definition.
de: Die Funktion ''getThisCompositeInstanceName'' muss über eine Operatorinstanz aufgerufen werden. Diese Anforderung schließt Definitionen des Typs ''static'' und die Klausel ''config'' einer Verbunddefinition aus.
es: Se debe llamar a la función getThisCompositeInstanceName desde una instancia de operador. Este requisito excluye definiciones de tipo estático y la cláusula de config de una definición de compuesto.
ko: getThisCompositeInstanceName 함수는 연산자 인스턴스에서 호출해야 합니다. 이 요구사항은 static 유형 정의와 복합 정의의 config 절은 제외합니다.
pt_br: A função getThisCompositeInstanceName deve ser chamada a partir de uma instância do operador. Este requisito exclui definições de tipo estático e a cláusula de configuração de uma definição composta.
zh_tw: 必須從運算子實例呼叫 getThisCompositeInstanceName 函數。此需求排除靜態類型定義和複合項定義的 config 子句。

# CDISP0690E
source: The following attribute is a duplicate: {0}.
de: Das folgende Attribut ist ein Duplikat: {0}.
es: El atributo siguiente es un duplicado: {0}.
ko: 다음 속성이 중복입니다: {0}.
pt_br: O atributo a seguir é uma duplicata: {0}.
zh_tw: 下列屬性重複：{0}。

# CDISP0691E
source: An invalid value {0} was specified for the {1} option.
de: Ungültiger Wert {0} für die Option {1} angegeben.
es: Se ha especificado un valor no válido {0} para la opción {1}.
ko: {1} 옵션에 대해 유효하지 않은 값 {0}이(가) 지정되었습니다.
pt_br: Um valor inválido {0} foi especificado para a opção {1}.
zh_tw: 對 {1} 選項指定的值 {0} 無效。

# CDISP0692I
source: Specifies the default value for operator relocatability. A value of true implies default-restartable=true.
de: Gibt den Standardwert für Operatorverschiebbarkeit an. Der Wert ''true'' impliziert ''default-restartable=true''.
es: Especifica el valor predeterminado para la capacidad de reubicación de operador. Un valor de true implica default-restartable=true.
ko: 연산자 재배치 가능성에 대한 기본값을 지정합니다. true 값은 default-restartable=true를 내포합니다.
pt_br: Especifica o valor padrão para capacidade de realocação do operador. Um valor true significa default-restartable=true.
zh_tw: 指定運算子可重新定位性的預設值。值 true 默示 default-restartable=true。

# CDISP0693I
source: Specifies the default value for operator restartability. A value of false implies default-locatable=false.
de: Gibt den Standardwert für Operatorneustartbarkeit an. Der Wert ''false'' impliziert ''default-locatable=false''.
es: Especifica el valor predeterminado para la capacidad de reinicio del operador. Un valor de false implica default-locatable=false.
ko: 연산자 재시작 가능성에 대한 기본값을 지정합니다. false 값은 default-locatable=false를 내포합니다.
pt_br: Especifica o valor padrão para capacidade de reinicialização do operador. Um valor false significa default-locatable=false.
zh_tw: 指定運算子可重新啟動性的預設值。值 false 默示 default-locatable=false。

# CDISP0694E
source: Both consistent and autonomous annotations cannot be specified on the same operator.
de: Für denselben Operator können nicht sowohl konsistente als auch autonome Annotationen angegeben werden.
es: Se pueden especificar ambas anotaciones, coherente y autónoma, en el mismo operador.
ko: 일관성 있는 어노테이션 및 자율 어노테이션은 동일한 연산자에 둘 다 지정할 수 없습니다.
pt_br: As anotações consistentes e autônomas não podem ser especificadas no mesmo operador.
zh_tw: 不能同時在同一運算子上指定一致註釋與自主註釋。

# CDISP0695E
source: Operator {0} is in a consistent region and has a direct or indirect config checkpoint.
de: Operator {0} ist in einer konsistenten Region und hat eine direkte oder indirekte Klausel ''config checkpoint''.
es: El operador {0} está en una región coherente y tiene un punto de comprobación de config directo o indirecto.
ko: 연산자 {0}은(는) 일관성 있는 영역이며 직접 또는 간접 구성 체크포인트가 있습니다.
pt_br: O operador {0} está em uma região consistente e tem um ponto de verificação de configuração direto ou indireto.
zh_tw: 運算子 {0} 位於一致區域中，並且具有直接或間接配置檢查點。

# CDISP0696E
source: The application has one or more consistent region but has no Job Control Plane operator.
de: Die Anwendung hat mindestens eine konsistente Region, jedoch keinen JCP-Operator.
es: La aplicación tiene una o varias regiones coherentes, pero no tiene ningún operador Plano de control de trabajo.
ko: 애플리케이션에 하나 이상의 일관성 있는 영역이 있으나 Job Control Plane 연산자가 없습니다.
pt_br: O aplicativo tem uma ou mais regiões consistentes, mas não tem o operador Tarefa Control Plane.
zh_tw: 應用程式具有一個以上的一致區域，但卻沒有「工作控制平面」運算子。

# CDISP0697E
source: The {0} operator cannot participate in a consistent region. It must be annotated with the @autonomous annotation.
de: Der Operator {0} kann nicht an einer konsistenten Region mitwirken. Er muss mit der Annotation @autonomous versehen werden.
es: El operador {0} no puede participar en una región coherente. Se debe anotar con la anotación @autonomous.
ko: {0} 연산자는 일관성 있는 영역에 참여할 수 없습니다. 여기에 @autonomous 어노테이션이 있어야 합니다.
pt_br: O operador {0} não pode participar de uma região consistente. Ele deve ser indicado com a anotação @autonomous.
zh_tw: {0} 運算子不能參與一致區域。必須使用 @autonomous 註釋對其進行標註。

# CDISP0698W
source: The {0} option is not supported on this platform and is ignored.
de: Die Option {0} wird auf dieser Plattform nicht unterstützt und wird ignoriert.
es: La opción {0} no está soportada en esta plataforma y se ignora.
ko: {0} 옵션은 이 플랫폼에서 지원되지 않으며 무시됩니다.
pt_br: A opção {0} não é suportada nesta plataforma e é ignorada.
zh_tw: {0} 選項在此平台上不受支援，將予以忽略。

# CDISP0699E
source: An error was detected while the toolkit info model was loading. The error is: {0}.
de: Beim Laden des Toolkitinformationsmodells wurde ein Fehler erkannt. Fehler: {0}.
es: Se ha detectado un error mientras se estaba cargando el modelo de info del kit de herramientas. El error es: {0}.
ko: 툴킷 정보 모델의 로드 중에 오류를 발견했습니다. 오류는 {0}입니다.
pt_br: Um erro foi detectado enquanto o modelo de informações do kit de ferramentas estava carregando. O erro é: {0}.
zh_tw: 載入工具箱資訊模型時偵測到錯誤。錯誤為：{0}。

# CDISP0700E
source: An error was detected while the toolkit info model was loading. The error is: {0}.
de: Beim Laden des Toolkitinformationsmodells wurde ein Fehler erkannt. Fehler: {0}.
es: Se ha detectado un error mientras se estaba cargando el modelo de info del kit de herramientas. El error es: {0}.
ko: 툴킷 정보 모델의 로드 중에 오류를 발견했습니다. 오류는 {0}입니다.
pt_br: Um erro foi detectado enquanto o modelo de informações do kit de ferramentas estava carregando. O erro é: {0}.
zh_tw: 載入工具箱資訊模型時偵測到錯誤。錯誤為：{0}。

# CDISP0701E
source: An error was detected while the toolkit list model was loading. The error is: {0}.
de: Beim Laden des Toolkitlistenmodells wurde ein Fehler erkannt. Fehler: {0}.
es: Se ha detectado un error mientras se estaba cargando el modelo de lista de kits de herramientas. El error es: {0}.
ko: 툴킷 목록 모델이 로드되는 중에 오류를 발견했습니다. 오류는 {0}입니다.
pt_br: Um erro foi detectado enquanto o modelo da lista do kit de ferramentas estava carregando. O erro é: {0}.
zh_tw: 載入工具箱清單模型時偵測到錯誤。錯誤為：{0}。

# CDISP0702E
source: The unknown value {0} was specified for the c++std compiler option.
de: Der unbekannte Wert {0} wurde für die die c++std-Compileroption angegeben.
es: Se ha especificado el valor desconocido {0} para la opción del compilador c++std.
ko: c++std 컴파일러 옵션에 대해 알 수 없는 값 {0}이(가) 지정되었습니다.
pt_br: O valor desconhecido {0} foi especificado para a opção do compilador C++ padrão.
zh_tw: 對 c++std 編譯器選項指定的值 {0} 不明。

# CDISP0703I
source: Specify the language level for the underlying C++ compiles.
de: Sprachebene für den zugrunde liegenden C++-Compiler.
es: Especifique el nivel de lenguaje para las compilaciones de C++ subyacentes.
ko: 기본 C++ 컴파일의 언어 레벨을 지정하십시오.
pt_br: Especifique o nível de linguagem para compilações C++ subjacentes.
zh_tw: 指定基礎 C++ 編譯的語言層次。

# CDISP0704E
source: The {0} SPL annotation is used too many times. The maximum cardinality for the annotation is {1}.
de: Die SPL-Annotation {0} wird zu häufig verwendet. Die maximale Kardinalität für die Annotation ist {1}.
es: La anotación SPL {0} se utiliza demasiadas veces. La cardinalidad máxima para la anotación es {1}.
ko: {0} SPL 어노테이션이 너무 많이 사용되었습니다. 이 어노테이션의 최대 카디널리티는 {1}입니다.
pt_br: A anotação SPL {0} é usada muitas vezes. A cardinalidade máxima para a anotação é {1}.
zh_tw: 使用 {0} SPL 註釋的次數太多。該註釋的基數上限為 {1}。

# CDISP0705D
source: The {0} matching identifier was found in the {1} namespace. If this identifier is the correct matching identifier, make the unqualified name visible by adding a use directive, or qualify the reference.
de: Die übereinstimmende Kennung {0} wurde im Namensbereich {1} gefunden. Wenn diese Kennung die richtige übereinstimmende Kennung ist, machen Sie den nicht qualifizierten Namen sichtbar, indem Sie eine Verwendungsanweisung hinzufügen oder die Referenz qualifizieren.
es: Se ha encontrado el identificador coincidente {0} en el espacio de nombres {1}. Si este identificador es el identificador coincidente correcto, haga que el nombre no calificado sea visible añadiendo una directiva de uso, o cualifique la referencia.
ko: {1} 네임스페이스에서 {0} 일치 ID를 발견했습니다. 이 ID가 올바른 일치 ID인 경우에는 use 지시문을 추가하거나 참조를 규정하여 규정되지 않은 이름이 표시되도록 하십시오.
pt_br: O identificador correspondente {0} foi localizado no namespace {1}. Se este identificador for o identificador correspondente correto, torne o nome não qualificado visível incluindo uma diretiva de uso ou qualifique a referência.
zh_tw: 在 {1} 名稱空間內找到 {0} 相符 ID。如果此 ID 是正確的相符 ID，請透過新增 use 指引來讓不具備資格的名稱可見，或者讓該參照具備資格。

# CDISP0706E
source: The {0} file cannot be opened and read.
de: Die Datei {0} kann nicht geöffnet und gelesen werden.
es: El archivo {0} no se puede abrir y leer.
ko: {0} 파일을 열어 읽을 수 없습니다.
pt_br: O arquivo {0} não pode ser aberto e lido.
zh_tw: 無法開啟和讀取 {0} 檔。

# CDISP0707E
source: The {0} output stream is already set to be viewable.
de: Der Ausgabedatenstrom {0} ist bereits auf ''viewable'' gesetzt.
es: La secuencia de salida {0} ya está establecida para ser visible.
ko: {0} 출력 스트림이 이미 볼 수 있도록 설정되어 있습니다.
pt_br: O fluxo de saída {0} já está configurado para ser visível.
zh_tw: 已將 {0} 輸出串流設定為可檢視。

# CDISP0708E
source: The {0} expression in the config streamViewability clause is not valid.
de: Der Ausdruck {0} in der Klausel ''config streamViewability'' ist nicht gültig.
es: La expresión {0} en la cláusula streamViewability de config no es válida.
ko: config streamViewability 절의 {0} 표현식이 유효하지 않습니다.
pt_br: A expressão {0} na cláusula de configuração streamViewability não é válida.
zh_tw: config streamViewability 子句中的 {0} 表示式無效。

# CDISP0709E
source: A value for the {0} parameter is required by the {1} composite operator, but the value does not exist in the current invocation.
de: Ein Wert für den Parameter {0} ist für den Verbundoperator {1} erforderlich, der Wert ist jedoch im aktuellen Aufruf nicht vorhanden.
es: Un valor para el parámetro {0} es necesario para el operador compuesto {1}, pero el valor no existe en la invocación actual.
ko: {1} 복합 연산자에서 {0} 매개변수의 값을 필요로 하지만 현재 호출에 이 값이 존재하지 않습니다.
pt_br: Um valor para o parâmetro {0} é necessário pelo operador composto {1}, mas o valor não existe na chamada atual.
zh_tw: {1} 複合運算子需要 {0} 參數的一個值，但該值不在現行呼叫中。

# CDISP0710E
source: The {0} output port of the {1} composite operator needs a stream of the {2} type, but the {3} stream of the {4} type is specified.
de: Der Ausgabeport {0} des Verbundoperators {1} benötigt einen Datenstrom des Typs {2}, angegeben wurde jedoch der Datenstrom {3} des Typs {4}.
es: El puerto de salida {0} del operador compuesto {1} necesita una secuencia del tipo {2}, pero se ha especificado la secuencia {3} del tipo {4}.
ko: {1} 복합 연산자의 {0} 출력 포트에서 {2} 유형의 스트림을 필요로 하지만 {4} 유형의 {3} 스트림이 지정되었습니다.
pt_br: A porta de saída {0} do operador composto {1} precisa de um fluxo do tipo {2}, mas o fluxo {3} do tipo {4} foi especificado.
zh_tw: {1} 複合運算子的 {0} 輸出埠需要一個類型為 {2} 的串流，但卻指定了類型為 {4} 的 {3} 串流。

# CDISP0711E
source: The {0} Import operator must generate only one output port.
de: Der Importoperator {0} darf nur einen Ausgabeport generieren.
es: El operador de importación {0} solo debe generar un puerto de salida.
ko: {0} Import 연산자는 하나의 출력 포트만 생성해야 합니다.
pt_br: O operador de importação {0} deve gerar somente uma porta de saída.
zh_tw: {0}「匯入」運算子必須只產生一個輸出埠。

# CDISP0712E
source: The {0} Export operator must accept only one input port.
de: Der Exportoperator {0} darf nur einen Eingabeport akzeptieren.
es: El operador de exportación {0} solo debe aceptar un puerto de entrada.
ko: {0} Export 연산자는 하나의 입력 포트만 허용해야 합니다.
pt_br: O operador de exportação {0} deve aceitar somente uma porta de entrada.
zh_tw: {0}「匯出」運算子必須只接受一個輸入埠。

# CDISP0713W
source: The {0} variable is written in the expression, and then is read or written elsewhere in the same expression.
de: Die Variable {0} wird in den Ausdruck geschrieben und dann an anderer Stelle in demselben Ausdruck gelesen oder geschrieben.
es: La variable {0} se escribe en la expresión y, después, se lee y escribe en cualquier lugar de la misma expresión.
ko: {0} 변수가 표현식에 쓰였으며 그 후 동일한 표현식의 다른 위치에서 읽히거나 쓰였습니다.
pt_br: A variável {0} é gravada na expressão e, em seguida, é lida ou gravada em outro lugar na mesma expressão.
zh_tw: 在表示式中寫入 {0} 變數，然後在同一表示式中的其他位置讀取或寫入該變數。

# CDISP0714W
source: Multiple calls to the following stateful functions exist in the same expression: {0} and {1}.
de: Ein Ausdruck enthält mehrere Aufrufe der folgenden Funktionen mit Statusüberwachung: {0} und {1}.
es: Existen varias llamadas a las funciones con estado siguiente en la misma expresión: {0} y {1}.
ko: 동일한 표현식에 다음 stateful 함수에 대한 여러 호출이 존재합니다: {0} 및 {1}.
pt_br: Múltiplas chamadas para as funções stateful a seguir existem na mesma expressão: {0} e {1}.
zh_tw: 同一表示式中存在對下列有狀態函數的多重呼叫：{0} 和 {1}。

# CDISP0715E
source: The boolean value for the config streamViewability clause is specified multiple times.
de: Der boolesche Wert für die Klausel ''config streamViewability'' ist mehrmals angegeben.
es: El valor booleano para la cláusula streamViewability de config se ha especificado varias veces.
ko: config streamViewability 절에 대한 부울 값이 여러 번 지정되었습니다.
pt_br: O valor booleano para a cláusula de configuração streamViewability é especificado múltiplas vezes.
zh_tw: 指定了 config streamViewability 子句的布林值多次。

# CDISP0716W
source: WARNING: The messages for the {0} locale cannot be loaded. The compiler will continue to load the default messages.
de: WARNUNG: Die Nachrichten für die Locale {0} können nicht geladen werden. Der Compiler lädt die Standardnachrichten.
es: AVISO: Los mensajes para el entorno local {0} no se pueden cargar. El compilador seguirá cargando los mensajes predeterminados.
ko: 경고: {0} 로케일의 메시지를 로드할 수 없습니다. 컴파일러가 계속해서 기본 메시지를 로드합니다.
pt_br: AVISO: as mensagens para o código do idioma {0} não podem ser carregadas. O compilador continuará a carregar as mensagens padrão.
zh_tw: 警告：無法載入 {0} 語言環境的訊息。編譯器將繼續載入預設訊息。

# CDISP0717E
source: The toolkit name must be a string that is not empty.
de: Der Toolkitname muss eine Zeichenfolge sein, die nicht leer ist.
es: El nombre del kit de herramientas debe ser una serie que no esté vacía.
ko: 툴킷 이름은 비어 있지 않은 문자열이어야 합니다.
pt_br: O nome do kit de ferramentas deve ser uma sequência que não esteja vazia.
zh_tw: 工具箱名稱必須是不為空的字串。

# CDISP0718I
source: The SPL compiler is using the {0} toolkit Version {1} in {2}.
de: Der SPL-Compiler verwendet das Toolkit {0} Version {1} in {2}.
es: El compilador SPL está utilizando la versión del kit de herramientas {0} {1} en {2}.
ko: SPL 컴파일러가 {2}에 있는 {0} 툴킷 버전 {1}을(를) 사용하고 있습니다.
pt_br: O compilador de SPL está usando o kit de ferramentas {0} Versão {1} em {2}.
zh_tw: SPL 編譯器正在使用 {2} 中的 {0} 工具箱 {1} 版。

# CDISP0719E
source: An unrecoverable internal compiler error occurred. The signal number is: {0,number,0}. Contact IBM Software Support.
de: Ein nicht behebbarer interner Compilerfehler ist aufgetreten. Signalnummer: {0,number,0}. Wenden Sie sich an den IBM Software Support.
es: Se ha producido un error de compilador interno irrecuperable. El número de señal es: {0,número,0}. Póngase en contacto con el servicio de soporte de software de IBM.
ko: 복구 불가능한 내부 컴파일러 오류가 발생했습니다. 신호 번호는 {0,number,0}입니다. IBM 소프트웨어 지원 센터에 문의하십시오.
pt_br: Um erro do compilador interno irrecuperável ocorreu. O número do sinal é: {0,number,0}. Entre em contato com o Suporte de Software IBM.
zh_tw: 發生無法復原的內部編譯器錯誤。信號號碼是：{0,number,0}。請與「IBM 軟體支援中心」聯絡。
