Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP9224I
source: Usage: {0} -h, --help | [--author [<name>]] [--check-tags] [-c, --clean] [--copy-image-files] [--doc-title <title>] [ -i, --directory <toolkit-dir> ] [--image-format <format>] [--include-all] [--include-composite-operator-diagram] [--include-excluded-artifacts] [--include-function-set-header] [--include-private-artifacts] [--include-source] [--keep-dita-files] [--output-directory <path>] [--suppress-primitive-operator-diagram] [--suppress-reference-docs] [-t, --toolkit-path <toolkit-path>] [-v, --verbose-mode] [--warn-no-comments] [--warn-on-cross-link-error] [-x, --output-format <format>] [<mixed-mode-arguments>] --author [<name>] Include the name of the toolkit author in the documentation. --check-tags Output a warning message for unrecognized SPLDOC annotation tags before skipping them. By default, the command skips those tags and does not provide a warning or error. --copy-image-files Copy embedded image files to output directory. -c, --clean Delete all the documentation artifacts from the output directory. --doc-title <title> Specifies the title used for the documentation. -h, --help Get (this) usage information. -i, --directory <toolkit-dir> Specifies the directory of a single toolkit to be documented. The toolkit is first indexed by running spl-make-toolkit. If neither the "-i" option nor the "-t" option is specified, this is the default mode, with the toolkit directory set to the current directory. --image-format <format> Specifies the format of the diagrams. The following values are valid for <format>: <format>=addjpeg Generate both JPEG and SVG image file formats. <format>=jpegonly Generate only JPEG image file format. <format>=svg Generate only SVG image file format (default). --include-all Include all optional "include" items. --include-composite-operator-diagram Include composite operator graph diagrams. --include-excluded-artifacts Include excluded SPL artifacts. --include-function-set-header Include C++ native function set headers. --include-private-artifacts Include non-public SPL artifacts. --include-source Include SPL source code. --keep-dita-files Do not delete generated DITA files. --output-directory <dir> Output documentation to the specified directory. The default is to the "doc/spldoc" directory in either the toolkit directory, if using the "-i" option, or the current directory, if using the "-t" option. --suppress-primitive-operator-diagram Do not include diagrams showing the primitive operator properties. --suppress-reference-docs Suppress generation of reference documents for the operator and function models. -t, --toolkit-path <toolkit-path> Specifies the directories of the toolkits to be documented. Multiple directories must each be separated with a ":", where each directory may be a toolkit directory, or a directory containing toolkit directories, and each toolkit has already been indexed. This option cannot be used with the "-i" or "mixed-mode-arguments" options. -v, --verbose-mode Emit additional warnings and trace information. --warn-no-comments Output a warning message for the SPL artifacts that do not have comments. --warn-on-cross-link-error Output a warning instead of an error message for a link to an SPL artifact that references a toolkit or namespace that is not in the documentation. -x, --output-format <format> Specifies the format of the documentation. The following values are valid for <format>: <format>=ditaonly Generate only the intermediate DITA files. <format>=xhtml Generate HTML output (default). <mixed-mode-arguments> If using the "-i" option, any remaining arguments are assumed to be mixed-mode arguments and are passed to spl-make-toolkit for toolkit indexing. Generate documentation for the specified toolkit(s).
de: Syntax: {0} -h, --help | [--author [<Name>]] [--check-tags] [-c, --clean] [--copy-image-files] [--doc-title <Titel>] [ -i, --directory <Toolkitverzeichnis> ] [--image-format <Format>] [--include-all] [--include-composite-operator-diagram] [--include-excluded-artifacts] [--include-function-set-header] [--include-private-artifacts] [--include-source] [--keep-dita-files] [--output-directory <Pfad>] [--suppress-primitive-operator-diagram] [--suppress-reference-docs] [-t, --toolkit-path <Toolkitpfad>] [-v, --verbose-mode] [--warn-no-comments] [--warn-on-cross-link-error] [-x, --output-format <Format>] [<Mixed-Mode-Argumente>] --author [<Name>] Namen des Toolkitautors in die Dokumentation einschließen. --check-tags Warnung für nicht erkannte SPLDOC-Annotationstags vor dem Überspringen ausgeben. Der Befehl überspringt standardmäßig diese Tags und stellt keine Warnung oder Fehler bereit. --copy-image-files Integrierte Imagedateien in das Ausgabeverzeichnis kopieren. -c, --clean Alle Dokumentationsartefakte aus dem Ausgabeverzeichnis. --doc-title <Titel> Gibt den für die Dokumentation verwendeten Titel an. -h, --help (Diese) Syntaxinformationen abrufen. -i, --directory <Toolkitverzeichnis> Gibt das Verzeichnis eines einzelnen zu dokumentierenden Toolkits an. Das Toolkit wird zuerst durch die Ausführung von spl-make-toolkit indexiert. Wird weder die Option "-i" noch die Option "-t" angegeben, ist dies der Standardmodus, wobei das Toolkitverzeichnis auf das aktuelle Verzeichnis gesetzt ist. --image-format <Format> Gibt das Format des Diagramms an. Folgende Werte sind für <Format> gültig: <Format>=addjpeg JPEG- und SVG-Imagedateiformate generieren. <Format>=jpegonly Nur JPEG-Imagedateiformate generieren. <Format>=svg Nur SVG--Imagedateiformate generieren (Standardwert). --include-all Alle optionalen "include"-Elemente einschließen. --include-composite-operator-diagram Verbundoperatordiagramme einschließen. --include-excluded-artifacts Ausgeschlossene SPL-Artefakte einschließen. --include-function-set-header Gruppenheader nativer C++-Funktionen einschließen. --include-private-artifacts Nicht öffentliche SPL-Artefakte einschließen. --include-source SPL-Quellcode einschließen. --keep-dita-files Generierte DITA-Dateien nicht löschen. --output-directory <Verzeichnis> Dokumentation in angegebenem Verzeichnis ausgeben. Der Standardwert ist das Verzeichnis "doc/spldoc" im Toolkitverzeichnis, wenn die Option "-i" verwendet wird, oder das aktuelle Verzeichnis, wenn die Option "-t" verwendet wird. --suppress-primitive-operator-diagram Diagramme mit den Eigenschaften primitiver Operatoren nicht einschließen. --suppress-reference-docs Generierung von Referenzdokumenten für Operator- und Funktionsmodelle unterdrücken. -t, --toolkit-path <Toolkitpfad> Gibt die Verzeichnisse der zu dokumentierenden Toolkits an. Mehrere Verzeichnisse müssen durch ":" voneinander getrennt werden. Dabei kann jedes Verzeichnis ein Toolkitverzeichnis oder ein Verzeichnis mit Toolkitverzeichnissen sein und jedes Toolkit muss indexiert worden sein. Diese Option kann nicht mit der Option "-i" oder "mixed-mode-arguments" verwendet werden. -v, --verbose-mode Weitere Warnungen und Traceinformationen ausgeben. --warn-no-comments Warnung für die SPL-Artefakte ausgeben, die keine Kommentare haben. --warn-on-cross-link-error Warnung anstelle einer Fehlernachricht für einen Link zu einem SPL-Artefakt ausgeben, das ein Toolkit oder einen Namensbereich referenziert, das/der nicht in der Dokumentation ist. -x, --output-format <Format> Gibt das Format der Dokumentation an. Folgende Werte sind für <Format> gültig: <Format>=ditaonly Nur die temporären DITA-Dateien generieren. <Format>=xhtml HTML-Ausgabe generieren (Standardwert). <Mixed-Mode-Argumente> Wird die Option "-i" verwendet, wird angenommen, dass alle verbleibenden Argumente Mixed-Mode-Argumente sind, und sie werden zur Toolkitindexierung an ''spl-make-toolkit'' übergeben. Generiert Dokumentation für die angegebenen Toolkits.
es: Uso: {0} -h, --help | [--author [<name>]] [--check-tags] [-c, --clean] [--copy-image-files] [--doc-title <title>] [ -i, --directory <toolkit-dir> ] [--image-format <format>] [--include-all] [--include-composite-operator-diagram] [--include-excluded-artifacts] [--include-function-set-header] [--include-private-artifacts] [--include-source] [--keep-dita-files] [--output-directory <path>] [--suppress-primitive-operator-diagram] [--suppress-reference-docs] [-t, --toolkit-path <toolkit-path>] [-v, --verbose-mode] [--warn-no-comments] [--warn-on-cross-link-error] [-x, --output-format <format>] [<mixed-mode-arguments>] --author [<name>] Incluir el nombre del autor del kit de herramientas en la documentación --check-tags Generar un mensaje de aviso para etiquetas de anotación SPLDOC no reconocidas antes de omitirlas. De forma predeterminada, el mandato omite estas etiquetas y no proporciona un aviso o error. --copy-image-files Copiar archivos de imagen incorporados en directorio de salida. -c, --clean Suprimir todos los artefactos de documentación del directorio de salida. --doc-title <title> Especifica el título utilizado para la documentación. -h, --help Obtener (esta) información de uso. -i, --directory <toolkit-dir> Especifica el directorio de un solo kit de herramientas que se va a documentar. El kit de herramientas primero se indexa ejecutando spl-make-toolkit. Si no se ha especificado ni la opción "-i" ni la opción "-t", esta es la modalidad predeterminada, con el directorio del kit de herramientas establecido en el directorio actual. --image-format <format> Especifica el formato de los diagramas. Son válidos los valores siguientes para <format>: <format>=addjpeg Generar ambos formatos de archivo de imagen, JPEG y SVG. <format>=jpegonly Generar solo el formato de archivo de imagen JPEG. <format>=svg Generar solo el formato de archivo de imagen SVG (predeterminado). --include-all Incluir todos los elementos "de inclusión" opcionales. --include-composite-operator-diagram Incluir diagramas de gráfico de operador compuesto. --include-excluded-artifacts Incluir artefactos SPL excluidos. . --include-function-set-header Incluir cabeceras de conjuntos de funciones nativas C++. --include-private-artifacts Incluir artefactos SPL no públicos. --include-source Incluir código fuente SPL. --keep-dita-files No suprimir archivos DITA generados. --output-directory <dir> Generar documentación en el directorio especificado. El valor predeterminado es el directorio "doc/spldoc" en cualquier directorio de kit de herramientas, si se utiliza la opción "-i", o el directorio actual, si se utiliza la opción "-t". --suppress-primitive-operator-diagram No incluir diagramas que muestren las propiedades del operador de primitiva. --suppress-reference-docs Suprimir la generación de documentos de referencia para el operador y modelos de función. -t, --toolkit-path <toolkit-path> Especifica los directorios de los kits de herramientas que se documentarán. Varios directorios deben estar separados con ":", donde cada directorio puede ser un directorio de kit de herramientas, o un directorio que contenga directorios de kit de herramientas, y cada kit de herramientas ya se ha indexado. Esta opción no se puede utilizar con las opciones "-i" o "mixed-mode-arguments". -v, --verbose-mode Emitir avisos adicionales e información de rastreo. --warn-no-comments Generar un mensaje de aviso para los artefactos SPL que no tienen comentarios. --warn-on-cross-link-error Generar un aviso en lugar de un mensaje de error para un enlace a un artefacto SPL que hace referencia a un kit de herramientas o un espacio de nombres que no está en la documentación. -x, --output-format <format> Especifica el formato de la documentación. Los valores siguientes son válidos para <format>: <format>=ditaonly Generar solo los archivos DITA intermedios. <format>=xhtml Generar salida HTML (valor predeterminado). <mixed-mode-arguments> Si se utiliza la opción "-i", los argumentos restantes se da por supuesto que son argumentos de modalidad mixta y se pasan a spl-make-toolkit para la indexación del kit de herramientas. Generar documentación para los kits de herramientas especificados.
ko: 사용법: {0} -h, --help | [--author [<name>]] [--check-tags] [-c, --clean] [--copy-image-files] [--doc-title <title>] [ -i, --directory <toolkit-dir> ] [--image-format <format>] [--include-all] [--include-composite-operator-diagram] [--include-excluded-artifacts] [--include-function-set-header] [--include-private-artifacts] [--include-source] [--keep-dita-files] [--output-directory <path>] [--suppress-primitive-operator-diagram] [--suppress-reference-docs] [-t, --toolkit-path <toolkit-path>] [-v, --verbose-mode] [--warn-no-comments] [--warn-on-cross-link-error] [-x, --output-format <format>] [<mixed-mode-arguments>] --author [<name>] 문서에 툴킷 작성자의 이름을 포함시킵니다. --check-tags 인식되지 않는 SPLDOC 어노테이션 태그를 건너뛰기 전에 이러한 항목에 대한 경고 메시지를 출력합니다. 기본적으로 이 명령은 이러한 태그를 건너뛰며 경고 또는 오류를 제공하지 않습니다. --copy-image-files 임베디드 이미지 파일을 출력 디렉토리에 복사합니다. -c, --clean 출력 디렉토리에서 모든 문서 아티팩트를 삭제합니다. --doc-title <title> 문서에 대해 사용되는 제목을 지정합니다. -h, --help 사용법 정보를 가져옵니다. -i, --directory <toolkit-dir> 문서에 기록될 단일 툴킷의 디렉토리를 지정합니다. 이 툴킷은 먼저 spl-make-toolkit을 실행하여 인덱스화됩니다. "-i" 옵션 또는 "-t" 옵션이 지정되지 않은 경우에는 이 모드가 기본 모드이며 툴킷 디렉토리가 현재 디렉토리로 설정됩니다. --image-format <format> 다이어그램의 형식을 지정합니다. <format>에 대해 유효한 값은 다음과 같습니다. <format>=addjpeg JPEG 및 SVG 이미지 파일 형식을 둘 다 생성합니다. <format>=jpegonly JPEG 이미지 파일 형식만 생성합니다. <format>=svg SVG 이미지 파일 형식만 생성합니다(기본값). --include-all 모든 선택적 "include" 항목을 포함시킵니다. --include-composite-operator-diagram 복합 연산자 그래프 다이어그램을 포함시킵니다. --include-excluded-artifacts 제외된 SPL 아티팩트를 포함시킵니다. --include-function-set-header C++ 원시(native) 함수 세트 헤더를 포함시킵니다. --include-private-artifacts 비public SPL 아티팩트를 포함시킵니다. --include-source SPL 소스 코드를 포함시킵니다. --keep-dita-files 생성된 DITA 파일을 삭제하지 않습니다. --output-directory <dir> 지정된 디렉토리에 문서를 출력합니다. 기본값은 "-i" 옵션이 사용된 경우에는 툴킷 디렉토리의 "doc/spldoc" 디렉토리, "-t" 옵션이 사용된 경우에는 현재 디렉토리의 "doc/spldoc" 디렉토리입니다. --suppress-primitive-operator-diagram 기본 연산자 특성을 표시하는 다이어그램을 포함시키지 않습니다. --suppress-reference-docs 연산자 및 함수 모델에 대한 참조 문서의 생성을 제외합니다. -t, --toolkit-path <toolkit-path> 툴킷의 디렉토리를 기록하도록 지정합니다. 여러 디렉토리는 각각 ":"으로 구분해야 하고, 여기서 각 디렉토리는 툴킷 디렉토리, 또는 툴킷 디렉토리를 포함하는 디렉토리일 수 있으며, 각 툴킷은 이미 인덱스화되어 있습니다. 이 옵션은 "-i" 또는 "mixed-mode-arguments" 옵션과 함께 사용할 수 없습니다. -v, --verbose-mode 추가 경고 및 추적 정보를 생성합니다. --warn-no-comments 주석이 없는 SPL 아티팩트에 대해 경고 메시지를 출력합니다. --warn-on-cross-link-error 문서에 없는 툴킷 또는 네임스페이스를 참조하는 SPL 아티팩트에 대해 오류 메시지 대신 경고를 출력합니다. -x, --output-format <format> 문서의 형식을 지정합니다. <format>에 대해 유효한 값은 다음과 같습니다. <format>=ditaonly 중간 DITA 파일만 생성합니다. <format>=xhtml HTML 출력을 생성합니다(기본값). <mixed-mode-arguments> "-i" 옵션을 사용하는 경우 나머지 인수는 혼합 모드 인수로 간주되며 툴킷 인덱싱을 위해 spl-make-toolkit에 전달됩니다. 지정된 툴킷에 대한 문서를 생성합니다.
pt_br: Uso: {0} -h, --help | [--author [<name>]] [--check-tags] [-c, --clean] [--copy-image-files] [--doc-title <title>] [ -i, --directory <toolkit-dir> ] [--image-format <format>] [--include-all] [--include-composite-operator-diagram] [--include-excluded-artifacts] [--include-function-set-header] [--include-private-artifacts] [--include-source] [--keep-dita-files] [--output-directory <path>] [--suppress-primitive-operator-diagram] [--suppress-reference-docs] [-t, --toolkit-path <toolkit-path>] [-v, --verbose-mode] [--warn-no-comments] [--warn-on-cross-link-error] [-x, --output-format <format>] [<mixed-mode-arguments>] --author [<name>] Inclui o nome do autor do kit de ferramentas na documentação. --check-tags gera uma mensagem de aviso para tags de anotação SPLDOC não reconhecidas antes de ignorá-las. Por padrão, o comando ignora essas tags e não fornece um aviso ou um erro. --copy-image-files copia arquivos de imagem integrados no diretório de saída. -c, --clean exclui todos os artefatos da documentação a partir do diretório de saída. --doc-title <title> especifica o título usado para a documentação. -h, --help obtém (estas) informações de uso -i, --directory <toolkit-dir> especifica o diretório de um único kit de ferramentas a ser documentado. O kit de ferramentas é primeiramente indexado executando spl-make-toolkit. Se nenhuma das opções "-i" e "-t" for especificada, esse será o modo padrão, com o diretório do kit de ferramentas configurado para o diretório atual. --image-format <format> especifica o formato dos diagramas. Os valores a seguir são válidos para <format>: <format>= addjpeg gera os formatos de arquivo de imagem JPEG e SVG. <format>=jpegonly gera somente o formato de arquivo de imagem JPEG. <format>=svg gera somente o formato de arquivo de imagem SVG (padrão). --include-all inclui todos os itens "include" opcionais. --include-composite-operator-diagram inclui diagramas de gráfico do operador composto --include-excluded-artifacts inclui artefatos SPL excluídos. --include-function-set-header inclui cabeçalhos do conjunto de funções nativas C++ --include-private-artifacts inclui artefatos SPL não públicos. --include-source inclui código-fonte do SPL. --keep-dita-files não exclui arquivos DITA gerados. --output-directory <dir> gera a documentação para o diretório especificado. O padrão é o diretório "doc/spldoc" no diretório de kit de ferramentas, se usando a opção "i" opção, ou o diretório atual, se usando a opção "-t". --suppress-primitive-operator-diagram não inclui diagramas mostrando as propriedades do operador primitivo. --suppress-reference-docs suprime a geração de documentos de referência para os modelos do operador e de função. -t, --toolkit-path <toolkit-path> especifica os diretórios dos kits de ferramentas a serem documentados. Múltiplos diretórios devem ser separados com ":", em que cada diretório pode ser um diretório de kit de ferramentas ou um diretório contendo diretórios do kit de ferramentas e cada kit de ferramentas já deverá ter sido indexado. Esta opção não pode ser usada com as opções "i" ou "mixed-mode-arguments". -v, --verbose-mode emite avisos e informações de rastreio adicionais. --warn-no-comments gera uma mensagem de aviso para os artefatos SPL que não tiverem comentários. --warn-on-cross-link-error gera uma mensagem de aviso em vez de uma mensagem de erro para um link com um artefato SPL que referencia um kit de ferramentas ou um namespace que não estiver na documentação. -x, --output-format <format> especifica o formato da documentação. Os valores a seguir são válidos para <format>: <format>= ditaonly gera somente os arquivos DITA intermediários. <format>=xhtml gera a saída HTML (padrão). <mixed-mode-arguments> se estiver usando a opção "i", quaisquer argumentos restantes serão considerados como argumentos de modo misto e serão transmitidos para spl-make-toolkit para indexação do kit de ferramentas. Gera a documentação para um ou mais kits de ferramentas especificados.
zh_tw: 用法：{0} -h, --help | [--author [<name>]] [--check-tags] [-c, --clean] [--copy-image-files] [--doc-title <title>] [ -i, --directory <toolkit-dir> ] [--image-format <format>] [--include-all] [--include-composite-operator-diagram] [--include-excluded-artifacts] [--include-function-set-header] [--include-private-artifacts] [--include-source] [--keep-dita-files] [--output-directory <path>] [--suppress-primitive-operator-diagram] [--suppress-reference-docs] [-t, --toolkit-path <toolkit-path>] [-v, --verbose-mode] [--warn-no-comments] [--warn-on-cross-link-error] [-x, --output-format <format>] [<mixed-mode-arguments>] --author [<name>] 在說明文件中包括工具箱作者的姓名。 --check-tags 對於無法辨識的 SPLDOC 註釋標籤，先輸出警告訊息，然後再跳過這些標籤。 依預設，指令會跳過那些標籤，並且不提供警告或錯誤。 --copy-image-files 將內嵌的影像檔複製到輸出目錄。 -c, --clean 從輸出目錄中刪除所有說明文件構件。 --doc-title <title> 指定用於說明文件的標題。 -h, --help 取得（此）用法資訊。 -i, --directory <toolkit-dir> 指定要記錄之單一工具箱的目錄。透過執行 spl-make-toolkit 先建立工具箱的索引。如果既未指定 "-i" 選項，也未指定 "-t" 選項，則這是預設模式，並將工具箱目錄設定為現行目錄。 --image-format <format> 指定圖表的格式。下列值適用於 <format>： <format>=addjpeg 產生 JPEG 及 SVG 影像檔案格式。 <format>=jpegonly 僅產生 JPEG 影像檔案格式。 <format>=svg 僅產生 SVG 影像檔案格式（預設值）。 --include-all 包括所有選用的 "include" 項目。 --include-composite-operator-diagram 包括複合運算子圖形圖表。 --include-excluded-artifacts 包括已排除的 SPL 構件。 --include-function-set-header 包括 C++ 原生函數集標頭。 --include-private-artifacts 包括非公用 SPL 構件。 --include-source 包括 SPL 原始碼。 --keep-dita-files 不刪除所產生的 DITA 檔。 --output-directory <dir> 將說明文件輸出到指定的目錄。如果使用 "-i" 選項，則預設值為工具箱目錄中的 "doc/spldoc" 目錄；如果使用 "-t" 選項，則預設值為現行目錄。 --suppress-primitive-operator-diagram 不包括用於顯示初始運算子內容的圖表。 --suppress-reference-docs 暫停產生運算子及函數模型的參照文件。 -t, --toolkit-path <toolkit-path> 指定要記錄之工具箱的目錄。多個目錄必須使用 ":" 與彼此進行區隔，其中，每一個目錄可能是工具箱目錄，也可能是包含工具箱目錄的目錄，並且已經建立每一個工具箱的索引。這個選項不能與 "-i" 或 "mixed-mode-arguments" 選項搭配使用。 -v, --verbose-mode 發出其他警告及追蹤資訊。 --warn-no-comments 對沒有註解的 SPL 構件，輸出警告訊息。 --warn-on-cross-link-error 對於指向 SPL 構件（參照了不在說明文件中的工具箱或名稱空間）的鏈結，輸出警告，而不是錯誤訊息。 -x, --output-format <format> 指定說明文件的格式。下列值適用於 <format>： <format>=ditaonly 僅產生中間 DITA 檔。 <format>=xhtml 產生 HTML 輸出（預設值）。 <mixed-mode-arguments> 如果使用 "-i" 選項，則任何剩餘引數都將假定是混合模式引數，並將傳遞至 spl-make-toolkit 以用於工具箱建立索引作業。 對指定的工具箱產生說明文件。

# CDISP9225E
source: The specified output format is not supported. The output format must be: xhtml or ditaonly.
de: Das angegebene Ausgabeformat wird nicht unterstützt. Das Ausgabeformat muss xhtml oder ditaonly sein.
es: El formato de salida especificado no está soportado. El formato de salida debe ser: xhtml o ditaonly.
ko: 지정된 출력 형식이 지원되지 않습니다. 출력 형식은 xhtml 또는 ditaonly여야 합니다.
pt_br: O formato de saída especificado não é suportado. O formato de saída deve ser: xhtml ou ditaonly.
zh_tw: 指定的輸出格式不受支援。輸出格式必須是：xhtml 或 ditaonly。

# CDISP9226E
source: The specified image file format is not supported. The image file format must be: addjpeg, jpegonly or svg.
de: Das angegebene Imagedateiformat wird nicht unterstützt. Das Imagedateiformat muss addjpeg, jpegonly oder svg sein.
es: El formato del archivo de imagen especificado no está soportado. El formato de archivo de imagen debe ser: addjpeg, jpegonly o svg.
ko: 지정된 이미지 파일 형식이 지원되지 않습니다. 이미지 파일 형식은 addjpeg, jpegonly 또는 svg여야 합니다.
pt_br: O formato de arquivo de imagem especificado não é suportado. O formato de arquivo de imagem deve ser: addjpeg, jpegonly ou svg.
zh_tw: 指定的影像檔案格式不受支援。影像檔案格式必須是：addjpeg、jpegonly 或 svg。

# CDISP9227E
source: The specified directory {0} does not exist or is not a directory.
de: Das angegebene Verzeichnis {0} ist nicht vorhanden oder ist kein Verzeichnis.
es: El directorio especificado {0} no existe o no es un directorio.
ko: 지정된 디렉토리 {0}이(가) 존재하지 않거나 디렉토리가 아닙니다.
pt_br: O diretório especificado {0} não existe ou não é um diretório.
zh_tw: 指定的目錄 {0} 不存在，或者不是目錄。

# CDISP9228E
source: The {1} command run by the {0} command failed. The return code is: {2}.
de: Der Befehl {1}, der vom Befehl {0} ausgeführt wird, ist fehlgeschlagen. Rückgabecode: {2}.
es: El mandato {1} ejecutado por el mandato {0} ha fallado. El código de retorno es {2}.
ko: {0} 명령에 의한 {1} 명령 실행이 실패했습니다. 리턴 코드는 {2}입니다.
pt_br: O comando {1} executado pelo comando {0} falhou. O código de retorno é: {2}.
zh_tw: 由 {0} 指令執行的 {1} 指令失敗。回覆碼為：{2}。

# CDISP9229T
source: The source model is being generated for the toolkit in {0}.
de: Das Quellenmodell wird für das Toolkit in {0} generiert.
es: El modelo de origen se está generando para el kit de herramientas en {0}.
ko: {0}에 있는 툴킷에 대해 소스 모델이 생성되는 중입니다.
pt_br: O modelo de origem está sendo gerado para o kit de ferramentas em {0}.
zh_tw: 正在對 {0} 中的工具箱產生原始檔模型。

# CDISP9230T
source: The {0} output directory is being used.
de: Das Ausgabeverzeichnis {0} wird verwendet.
es: Se está utilizando el directorio de salida {0}.
ko: {0} 출력 디렉토리가 사용 중입니다.
pt_br: O diretório de saída {0} está sendo usado.
zh_tw: 正在使用 {0} 輸出目錄。

# CDISP9231T
source: The documents are being generated.
de: Die Dokumente werden generiert.
es: Se están generando los documentos.
ko: 문서가 생성되는 중입니다.
pt_br: Os documentos estão sendo gerados.
zh_tw: 正在產生文件。

# CDISP9232T
source: The DITA documents are being generated.
de: Die DITA-Dokumente werden generiert.
es: Se están generando los documentos DITA.
ko: DITA 문서가 생성되는 중입니다.
pt_br: Os documentos DITA estão sendo gerados.
zh_tw: 正在產生 DITA 文件。
