Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLCompilerMessages_*.xlf
Languages: de, es, ko, pt_br, zh_tw

# CDISP0404E
source: Division or modulus by 0
de: Division oder Modulus durch 0
es: División o módulo por 0
ko: 0에 의한 나누기 또는 모듈러스
pt_br: Divisão ou módulo por 0
zh_tw: 除數或模數為 0

# CDISP0405E
source: No profiling statistics were gathered
de: Keine Profilerstellungsstatistikdaten zusammengestellt
es: No se han recopilado estadísticas de creación de perfiles
ko: 프로파일링 통계가 수집되지 않음
pt_br: Nenhuma estatística de criação de perfil foi reunida
zh_tw: 未收集側寫統計資料

# CDISP0406E
source: An empty container literal was used in an unknown type context. Did you forget a cast?
de: Ein leeres Containerliteral wurde in einem unbekannten Typkontext verwendet. Haben Sie eine Umsetzung vergessen?
es: Se ha utilizado el literal de contenedor vacío en un contexto de tipo desconocido. ¿Ha olvidado una conversión de tipo de datos?
ko: 알 수 없는 유형 컨텍스트에서 비어 있는 컨테이너 리터럴이 사용되었습니다. 캐스트 작업을 잊지 않았는지 확인하십시오.
pt_br: Um literal de contêiner vazio foi usado em um contexto de tipo desconhecido. Esqueceu-se de uma conversão?
zh_tw: 已在不明類型環境定義中使用了空白儲存器文字。您是否忘記了強制轉型？

# CDISP0407E
source: The {0} checkpoint expression is not valid.
de: Der Prüfpunktausdruck {0} ist nicht gültig.
es: La expresión de punto de comprobación {0} no es válida.
ko: {0} 체크포인트 표현식이 유효하지 않습니다.
pt_br: A expressão de ponto de verificação {0} não é válida.
zh_tw: {0} 檢查點表示式無效。

# CDISP0408E
source: A checkpoint configuration cannot contain both of the following terms: periodic and operatorDriven.
de: Eine Prüfpunktkonfiguration kann nicht die beiden folgenden Begriffe enthalten: ''periodic'' und ''operatorDriven''.
es: Una configuración de punto de comprobación no puede contener ambos de los términos siguientes: periodic y operatorDriven.
ko: 체크포인트 구성은 periodic 및 operatorDriven 항을 둘 다 포함할 수 없습니다.
pt_br: Uma configuração de ponto de verificação não pode conter os seguintes termos: periodic e operatorDriven.
zh_tw: 檢查點配置不能同時包含以下兩個項目：periodic 和 operatorDriven。

# CDISP0409E
source: A function name is expected, but the {0} identifier is found and this identifier is not a function in this scope.
de: Ein Funktionsname wird erwartet, jedoch wurde die Kennung {0} gefunden, die in diesem Bereich keine Funktion ist.
es: Se espera un nombre de función, pero se ha encontrado el identificador {0} y este identificador no es una función en este ámbito.
ko: 함수 이름이 기대되었으나 {0} ID가 발견되었으며 이 ID는 이 범위에 속한 함수가 아닙니다.
pt_br: Um nome da função é esperado, mas o identificador {0} foi localizado, que não é uma função neste escopo.
zh_tw: 預期一個函數名稱，但卻找到 {0} ID，並且此 ID 不是此範圍內的函數。

# CDISP0410E
source: The {0} argument for the checkpoint period must be greater than zero.
de: Das Argument {0} für den Prüfpunktzeitraum muss größer als null sein.
es: El argumento {0} para el periodo del punto de comprobación debe ser mayor que cero.
ko: 체크포인트 기간에 대한 {0} 인수는 영(0)보다 커야 합니다.
pt_br: O argumento {0} para o período de ponto de verificação deve ser maior que zero.
zh_tw: 檢查點時段的 {0} 引數必須大於 0。

# CDISP0411W
source: The error output from the {0} script is: {1}.
de: Fehlernachricht vom Script {0}: {1}.
es: La salida de error del script {0} es: {1}.
ko: {0} 스크립트의 오류 출력은 다음과 같습니다: {1}
pt_br: A saída de erro do script {0} é: {1}.
zh_tw: 來自 {0} Script 的錯誤輸出是：{1}。

# CDISP0412E
source: Only the composite formal identifiers must lead with a dollar sign symbol ($). The {0} identifier is not a valid identifier.
de: Nur bei formalen Verbundkennungen darf ein Dollarzeichen ($) am Anfang stehen. Die Kennung {0} ist keine gültige Kennung.
es: Solo los identificadores formales compuestos deben empezar con un símbolo de signo de dólar ($). El identificador {0} no es una identificador válido.
ko: 복합 정규 ID만 달러 기호($)와 선행해야 합니다. {0} ID는 유효한 ID가 아닙니다.
pt_br: Somente os identificadores formais compostos devem iniciar com um símbolo de cifrão ($). O identificador {0} não é um identificador válido.
zh_tw: 僅複合格式 ID 才必須以錢幣符號 ($) 開頭。{0} ID 不是有效 ID。

# CDISP0413E
source: A return statement with a value is included in a function that returns void.
de: Eine Anweisung ''return'' mit einem Wert ist in eine Funktion eingeschlossen, die ''void'' zurückgibt.
es: Una sentencia de retorno con un valor está incluido en una función que devuelve un nulo.
ko: 값을 포함하는 return문이 void를 리턴하는 함수에 포함되었습니다.
pt_br: Uma instrução de retorno com um valor é incluída em uma função que retorna void.
zh_tw: 某個函數中包括具有某個值的 return 陳述式，該 return 陳述式傳回了 void。

# CDISP0414I
source: Specifies a directory where the application artifacts are placed.
de: Gibt ein Verzeichnis an, in dem die Anwendungsartefakte angeordnet werden.
es: Especifica un directorio donde se colocan los artefactos de la aplicación.
ko: 애플리케이션 아티팩트가 배치되는 디렉토리를 지정합니다.
pt_br: Especifica um diretório no qual os artefatos do aplicativo são colocados.
zh_tw: 指定應用程式構件所在的目錄。

# CDISP0415I
source: Specifies the location of the data directory to use.
de: Gibt die Position des zu verwendenden Datenverzeichnisses an.
es: Especifica la ubicación del directorio de datos para utilizar.
ko: 사용할 데이터 디렉토리의 위치를 지정합니다.
pt_br: Especifica o local do diretório de dados a ser usado.
zh_tw: 指定要使用的 data 目錄位置。

# CDISP0416E
source: The window punctuation port is not in the range of available input ports.
de: Der Fensterpunktuationsport befindet sich außerhalb des Bereichs verfügbarer Eingabeports.
es: El puerto de puntuación de ventana no está dentro del rango de puertos de entrada disponibles.
ko: 창 구두점 포트가 사용 가능한 입력 포트의 범위에 포함되지 않습니다.
pt_br: A porta de pontuação de janela não está no intervalo de portas de entrada disponíveis.
zh_tw: 視窗標點符號埠不在可用的輸入埠範圍內。

# CDISP0417E
source: An operator can specify a window punctuation port only if the operator uses a punctuation preserving output port.
de: Ein Operator kann einen Fensterpunktuationsport nur angeben, wenn der Operator einen Ausgabeport verwendet, der die Punktuation beibehält.
es: Un operador puede especificar un puerto de puntuación de ventana solo si el operador utiliza una puntuación que conserva el puerto de salida.
ko: 연산자는 구두점 유지 출력 포트를 사용하는 경우에만 창 구두점 포트를 지정할 수 있습니다.
pt_br: Um operador poderá especificar uma porta de pontuação de janela somente se o operador usar uma porta de saída que preserva a pontuação.
zh_tw: 僅當運算子使用負責保留輸出埠的標點符號時，該運算子才可以指定視窗標點符號埠。

# CDISP0418I
source: Set the maximum processing element cpu fraction (>= 0). The default is 0.5.
de: Maximalen CPU-Bruchteil des Verarbeitungselements festlegen (>= 0). Der Standardwert ist 0,5.
es: Establezca la fracción máxima de CPU de elemento de proceso (>= 0). El valor predeterminado es 0,5.
ko: 최대 처리 요소 CPU 소수를 설정하십시오(>= 0). 기본값은 0.5입니다.
pt_br: Configure a fração máxima de elemento de processamento de CPU (>= 0). O padrão é 0,5.
zh_tw: 設定上限處理元素 CPU 分數（大於或等於 0）。預設值為 0.5。

# CDISP0420I
source: Clean the compiler generated .pm files and the toolkit.xml file.
de: Vom Compiler generierte .pm-Dateien und die Datei ''toolkit.xml'' bereinigen.
es: Borre los archivos .pm generados por el compilador y el archivo toolkit.xml.
ko: 컴파일러 생성 .pm 파일 및 toolkit.xml 파일을 지웁니다.
pt_br: Limpar os arquivos .pm gerados pelo compilador e o arquivo toolkit.xml.
zh_tw: 清除編譯器產生的 .pm 檔及 toolkit.xml 檔。

# CDISP0421I
source: Description of the toolkit
de: Beschreibung des Toolkits
es: Descripción del kit de herramientas
ko: 툴킷의 설명
pt_br: Descrição do kit de ferramentas
zh_tw: 工具箱的說明

# CDISP0422I
source: Toolkit directory
de: Toolkitverzeichnis
es: Directorio del kit de herramientas
ko: 툴킷 디렉토리
pt_br: Diretório do kit de ferramentas
zh_tw: 工具箱目錄

# CDISP0423I
source: Run the spl-make-operator script on the primitive operators
de: Script ''spl-make-operator'' für die primitiven Operatoren ausführen
es: Ejecute el script spl-make-operator en los operadores de primitivas.
ko: 기본 연산자에서 spl-make-operator 스크립트 실행
pt_br: Execute o script spl-make-operador nos operadores primitivos
zh_tw: 對初始運算子執行 spl-make-operator Script

# CDISP0424I
source: Toolkit name
es: Nombre de kit de herramientas
ko: 툴킷 이름
pt_br: Nome do kit de ferramentas
zh_tw: 工具箱名稱

# CDISP0425I
source: Required product version for the toolkit
de: Erforderliche Produktversion des Toolkits
es: Versión de producto necesaria para el kit de herramientas
ko: 툴킷에 필요한 필수 제품 버전
pt_br: Versão do produto necessária para o kit de ferramentas
zh_tw: 工具箱的所需產品版本

# CDISP0426I
source: Version of the toolkit
de: Version des Toolkits
es: Versión del kit de herramientas
ko: 툴킷의 버전
pt_br: Versão do kit de ferramentas
zh_tw: 工具箱的版本

# CDISP0427I
source: usage: spl-make-toolkit -h, --help | -i, --directory <toolkit-dir> [-c, --clean] [-m, --make-operator] [-s, --silent] \\\n\t[-n, --name <name>] [-d, --description <description>] [-v, --version <version>] \\\n\t[-r, --product-version <required-product-version>] \\\n\t[--no-mixed-mode-processing] [--verbose-model-errors] [<mixed-mode-arguments>]\n\nCreate a toolkit model (toolkit.xml) from the contents of a toolkit directory.
de: Syntax: spl-make-toolkit -h, --help | -i, --directory <Toolkitverzeichnis> [-c, --clean] [-m, --make-operator] [-s, --silent] \\\n\t[-n, --name <Name>] [-d, --description <Beschreibung>] [-v, --version <Version>] \\\n\t[-r, --product-version <erforderliche_Produktversion>] \\\n\t[--no-mixed-mode-processing] [--verbose-model-errors] [<Mixed-Mode-Argumente>]\n\nToolkitmodell (toolkit.xml) aus dem Inhalt eines Toolkitverzeichnisses erstellen.
es: uso: spl-make-toolkit -h, --help | -i, --directory <toolkit-dir> [-c, --clean] [-m, --make-operator] [-s, --silent] \\\n\t[-n, --name <nombre>] [-d, --description <descripción>] [-v, --version <versión>] \\\n\t[-r, --product-version <versión-producto-necesario>] \\\n\t[--no-mixed-mode-processing] [--verbose-model-errors] [<mixed-mode-arguments>]\n\nCree un modelo de kit de herramientas (toolkit.xml) a partir del contenido de un directorio de kit de herramientas.
ko: 사용법: spl-make-toolkit -h, --help | -i, --directory <toolkit-dir> [-c, --clean] [-m, --make-operator] [-s, --silent] \\\n\t[-n, --name <name>] [-d, --description <description>] [-v, --version <version>] \\\n\t[-r, --product-version <required-product-version>] \\\n\t[--no-mixed-mode-processing] [--verbose-model-errors] [<mixed-mode-arguments>]\n\n툴킷 디렉토리의 컨텐츠로부터 툴킷 모델(toolkit.xml)을 작성합니다.
pt_br: uso: spl-make-toolkit -h, --help | -i, --directory <toolkit-dir> [-c, --clean] [-m, --make-operator] [-s, --silent] \\\n\t[-n, --name <name>] [-d, --description <description>] [-v, --version <version>] \\\n\t[-r, --product-version <required-product-version>] \\\n\t[--no-mixed-mode-processing] [--verbose-model-errors] [<mixed-mode-arguments>]\n\nCrie um modelo de kit de ferramentas (toolkit.xml) a partir do conteúdo de um diretório do kit de ferramenta.
zh_tw: 用法：spl-make-toolkit -h, --help | -i, --directory <toolkit-dir> [-c, --clean] [-m, --make-operator] [-s, --silent] \\\n\t[-n, --name <name>] [-d, --description <description>] [-v, --version <version>] \\\n\t[-r, --product-version <required-product-version>] \\\n\t[--no-mixed-mode-processing] [--verbose-model-errors] [<mixed-mode-arguments>]\n\n根據工具箱目錄的內容，建立工具箱模型 (toolkit.xml)。

# CDISP0428I
source: Pass the --silent option to the spl-make-operator script. The silent option is meaningful for the -m value only.
de: Option --silent an das Script ''spl-make-operator'' übergeben. Die Option ''silent'' ist nur für den Wert -m aussagekräftig.
es: Pase la opción --silent al script spl-make-operator. La opción de silencio es significativa solo para el valor -m.
ko: --silent 옵션을 spl-make-operator 스크립트에 전달합니다. silent 옵션은 -m 값에 대해서만 적용됩니다.
pt_br: Transmitir a opção --silent para o script spl-make-operador. A opção silenciosa é significativa somente para o valor -m.
zh_tw: 將 --silent 選項傳遞至 spl-make-operator Script。silent 選項只對 -m 值有意義。

# CDISP0429W
source: A config checkpoint clause has no effect without a config restartable : true clause.
de: Eine Klausel ''config checkpoint'' hat ohne eine Klausel ''config restartable : true'' keine Wirkung.
es: Una cláusula de punto de comprobación de config no tiene ningún efecto sin una config reiniciable : cláusula verdadera.
ko: config checkpoint 절은 config restartable : true 절이 없으면 효과가 없습니다.
pt_br: Uma cláusula de ponto de verificação da configuração não tem efeito sem uma configuração reinicializável: cláusula true.
zh_tw: 如果沒有 config restartable : true 子句，則 config checkpoint 子句沒有效果。

# CDISP0430E
source: The assignment to the {0} slice is not valid.
de: Die Zuweisung zum Slice {0} ist nicht gültig.
es: La asignación a la porción {0} no es válida.
ko: {0} 슬라이스에 대한 지정이 유효하지 않습니다.
pt_br: A designação para a fatia {0} não é válida.
zh_tw: 對 {0} 截塊的指派無效。

# CDISP0431E
source: The assignment to the {0} string subscript is not valid.
de: Die Zuweisung zum Zeichenfolgenindex {0} ist nicht gültig.
es: La asignación al subscript de serie {0} no es válida.
ko: {0} 문자열 서브스크립트에 대한 지정이 유효하지 않습니다.
pt_br: A designação para o subscrito de sequência {0} não é válida.
zh_tw: 對 {0} 字串下標的指派無效。

# CDISP0434I
source: The toolkit directory is missing.
de: Das Toolkitverzeichnis fehlt.
es: Falta el directorio del kit de herramientas.
ko: 툴킷 디렉토리가 누락되었습니다.
pt_br: O diretório do kit de ferramentas está ausente.
zh_tw: 遺漏了工具箱目錄。

# CDISP0435E
source: The {0} namespace that is defined in the {1} SPL file does not match the {2} namespace that is derived from the following directory path: {3}.
de: Der Namensbereich {0}, der in der SPL-Datei {1} definiert ist, stimmt nicht mit dem Namensbereich {2} überein, der vom folgenden Verzeichnispfad abgeleitet ist: {3}.
es: El espacio de nombres {0} que está definido en el archivo SPL {1} no coincide con el espacio de nombres {2} que se ha derivado de la vía de acceso de directorio siguiente: {3}.
ko: {1} SPL 파일에 정의된 {0} 네임스페이스가 다음 디렉토리 경로로부터 파생된 {2} 네임스페이스와 일치하지 않습니다: {3}.
pt_br: O namespace {0} que está definido no arquivo SPL {1} não corresponde ao namespace {2} que é derivado do caminho de diretório a seguir: {3}.
zh_tw: {1} SPL 檔中定義的 {0} 名稱空間，與衍生自下列目錄路徑的 {2} 名稱空間不符：{3}。

# CDISP0436E
source: The {0} toolkit version number is not expected to be in the following format: d[.d[.d[.alnum].
de: Die Versionsnummer {0} des Toolkits darf nicht im folgenden Format vorliegen: d[.d[.d[.alnum].
es: El número de versión del kit de herramientas {0} no se espera que tenga el formato siguiente: d[.d[.d[.alnum].
ko: {0} 툴킷 버전 번호는 다음 형식이 아니어야 합니다: d[.d[.d[.alnum].
pt_br: O número da versão do kit de ferramentas {0} não deve estar no seguinte formato: d[.d[.d[.alnum].
zh_tw: 未預期 {0} 工具箱版本號碼採用以下格式：d[.d[.d[.alnum]。

# CDISP0437E
source: The following product version range is not valid: {0}.
de: Der folgende Produktversionsbereich ist nicht gültig: {0}.
es: El rango de versiones del producto siguiente no es válido: {0}.
ko: 다음 제품 버전 범위가 유효하지 않습니다: {0}.
pt_br: O intervalo de versão do produto a seguir não é válido: {0}.
zh_tw: 以下產品版本範圍無效：{0}。

# CDISP0438E
source: Only the static type definitions can be accessed with dot notation, but the {0} type is not static.
de: Mit Punktschreibweise kann nur auf Definitionen des Typs ''static'' zugegriffen werden, der Typ {0} ist jedoch nicht ''static''.
es: Solo se puede acceder a definiciones de tipo estático con la notación de puntos, pero el tipo {0} no es estático.
ko: static 유형 정의만 점 표기법을 사용하여 액세스할 수 있지만 {0} 유형은 static이 아닙니다.
pt_br: Somente as definições de tipo estático podem ser acessadas com a notação de ponto, mas o tipo {0} não é estático.
zh_tw: 使用帶點表示法只能存取靜態類型定義，但 {0} 類型卻不是靜態的。

# CDISP0439E
source: The {0} typeName, which is not static, cannot be used to define the following static typeName: {1}.
de: Der Typname {0} ist nicht vom Typ ''static'' und kann daher nicht zum Definieren des folgenden statischen Typnamen verwendet werden: {1}.
es: El {0} typeName, que no es estático, no se puede utilizar para definir el typeName estático siguiente: {1}.
ko: static이 아닌 {0} typeName은 다음 static typeName을 정의하는 데 사용할 수 없습니다: {1}.
pt_br: O typeName {0}, que não é estático, não pode ser usado para definir o typeName estático a seguir: {1}.
zh_tw: 不能使用非靜態 {0} typeName 來定義以下靜態 typeName：{1}。

# CDISP0440E
source: The {0} main composite cannot be found in the following file: {1}. The composite expansion will not occur.
de: Das Hauptverbundelement {0} kann in der folgenden Datei nicht gefunden werden: {1}. Die Verbundelementerweiterung wird nicht durchgeführt.
es: El compuesto principal {0} no se puede encontrar en el archivo siguiente: {1}. No se producirá la expansión de compuesto.
ko: {0} 기본 복합을 다음 파일에서 찾을 수 없습니다: {1}. 복합 확장이 발생하지 않습니다.
pt_br: O composto principal {0} não pode ser localizado no seguinte arquivo: {1}. A expansão composta não ocorrerá.
zh_tw: 在下列檔案中找不到 {0} 主要複合項：{1}。將不進行複合項擴充。

# CDISP0441E
source: Dot notation can be used to access only the static shared variables, but {0} is not static.
de: Mit Punktschreibweise kann nur auf statische gemeinsame Variablen zugegriffen werden. {0} ist jedoch nicht statisch.
es: La notación de puntos se puede utilizar solo para acceder a las variables compartidas estáticas, pero {0} no es estática.
pt_br: A notação de ponto pode ser usada para acessar somente as variáveis compartilhadas estáticas, mas {0} não é estático.
zh_tw: 帶點表示法只能用於存取靜態共用變數，但 {0} 卻不是靜態的。

# CDISP0442E
source: Input port number {1,number,0} in the {0} operator, which expects punctuation, is potentially connected to multiple streams due to an upstream import.
de: Eingabeport mit der Nummer {1,number,0} im Operator {0}, der Punktuation erwartet, ist aufgrund eines vorgeschalteten Imports potenziell mit mehreren Datenströmen verbunden.
es: El número de puerto de entrada {1,número,0} en el operador {0}, que espera puntuación, posiblemente está conectado a varias secuencias debido a una importación en sentido ascendente.
ko: 구두점을 기대하는 {0} 연산자의 입력 포트 번호 {1,number,0}이(가) 업스트림 임포트로 인해 잠재적으로 여러 스트림에 연결되어 있습니다.
pt_br: O número da porta de entrada {1,number,0} no operador {0}, que espera a pontuação, está potencialmente conectado a múltiplos fluxos devido a uma importação de envio de dados.
zh_tw: 由於上游匯入，{0} 運算子中的輸入埠號 {1,number,0}（預期標點符號）可能已連接至多個串流。

# CDISP0448E
source: The {0} property name is duplicated in the export property expression.
de: Der Eigenschaftsname {0} ist im Exporteigenschaftsausdruck dupliziert.
es: El nombre de propiedad {0} está duplicado en la expresión de propiedad de exportación.
ko: 익스포트 특성 표현식에서 {0} 특성 이름이 중복되어 있습니다.
pt_br: O nome da propriedade {0} está duplicado na expressão de propriedade de exportação.
zh_tw: {0} 內容名稱在匯出內容表示式中重複。

# CDISP0449E
source: Errors were generated during the instantiation of the {0} composite operator.
de: Während der Instanziierung des Verbundoperators {0} wurden Fehler generiert.
es: Se han generado errores durante la instanciación del operador compuesto {0}.
ko: {0} 복합 연산자의 인스턴스 생성 중에 오류가 발생했습니다.
pt_br: Erros foram gerados durante a instanciação do operador composto {0}.
zh_tw: 在實例化 {0} 複合運算子期間，產生錯誤。

# CDISP0450D
source: The operator was expanded from the {0} composite operator.
de: Der Operator wurde vom Verbundoperator {0} erweitert.
es: El operador se ha ampliado desde el operador compuesto {0}.
ko: 연산자가 {0} 복합 연산자에서 확장되었습니다.
pt_br: O operador foi expandido do operador composto {0}.
zh_tw: 該運算子擴充自 {0} 複合運算子。

# CDISP0456I
source: Print the source code after expanding all the composite operators.
de: Quellcode nach der Erweiterung aller Verbundoperatoren drucken.
es: Imprima el código fuente tras ampliar todos los operadores compuestos.
ko: 모든 복합 연산자를 확장한 후 소스 코드를 인쇄합니다.
pt_br: Imprima o código-fonte após expandir todos os operadores compostos.
zh_tw: 在擴充所有複合運算子之後，列印原始碼。

# CDISP0457E
source: The {0} input port of the {1} composite operator expects a stream of the {2} type, but found the {3} stream of the {4} type.
de: Der Eingabeport {0} des Verbundoperators {1} erwartet einen Datenstrom des Typs {2}, gefunden wurde jedoch der Datenstrom {3} des Typs {4}.
es: El puerto de entrada {0} del operador compuesto {1} espera una secuencia del tipo {2}, pero se ha encontrado la secuencia {3} del tipo {4}.
ko: {1} 복합 연산자의 {0} 입력 포트에서 {2} 유형의 스트림을 기대했으나 {4} 유형의 {3} 스트림을 발견했습니다.
pt_br: A porta de entrada {0} do operador composto {1} espera um fluxo do tipo {2}, mas localizou o fluxo {3} do tipo {4}.
zh_tw: {1} 複合運算子的 {0} 輸入埠預期一個類型為 {2} 的串流，但卻找到類型為 {4} 的 {3} 串流。

# CDISP0458E
source: The {0} clause is not permitted on a composite operator invocation.
de: Die Klausel {0} ist im Aufruf eines Verbundoperators nicht zulässig.
es: La cláusula {0} no está permitida en una invocación de operador compuesto.
ko: {0} 절은 복합 연산자 호출에서 허용되지 않습니다.
pt_br: A cláusula {0} não é permitida em uma chamada do operador composto.
zh_tw: 不容許對複合運算子呼叫使用 {0} 子句。

# CDISP0459E
source: The invocation of the {0} composite operator is recursive.
de: Der Aufruf des Verbundoperators {0} ist rekursiv.
es: La invocación del operador compuesto {0} es recursiva.
ko: {0} 복합 연산자의 호출이 반복적입니다.
pt_br: A chamada do operador composto {0} é recursiva.
zh_tw: {0} 複合運算子的呼叫是遞迴的。

# CDISP0460E
source: The actual parameter for the {0} formal parameter with the {1} expression mode is not valid.
de: Der tatsächliche Parameter für den formalen Parameter {0} mit dem Ausdrucksmodus {1} ist nicht gültig.
es: El parámetro real para el parámetro formal {0} con la modalidad de expresión {1} no es válido.
ko: 표현식 모드가 {1}인 {0} 정규 매개변수의 실제 매개변수는 유효하지 않습니다.
pt_br: O parâmetro real para o parâmetro formal {0} com o modo de expressão {1} não é válido.
zh_tw: 表示式模式為 {1} 之 {0} 格式參數的實際參數無效。

# CDISP0462E
source: The execution of the spl-make-operator script failed during the toolkit indexing process.
de: Die Ausführung des Scripts ''spl-make-operator'' ist während des Indexierungsprozesses für das Toolkit fehlgeschlagen.
es: La ejecución del script spl-make-operator ha fallado durante el proceso de indexación de kit de herramientas.
ko: 툴킷 인덱싱 프로세스 중에 spl-make-operator 스크립트 실행이 실패했습니다.
pt_br: A execução do script spl-make-operator falhou durante o processo de indexação do kit de ferramentas.
zh_tw: 在工具箱建立索引程序期間，spl-make-operator Script 的執行失敗。

# CDISP0463E
source: The following output directory path exists, but the path does not point to a directory: {0}.
de: Der folgende Ausgabeverzeichnispfad ist vorhanden, der Pfad verweist jedoch nicht auf ein Verzeichnis: {0}.
es: Existe la vía de acceso de directorio de salida siguiente, pero la vía de acceso no señala a un directorio {0}.
ko: 다음 출력 디렉토리 경로가 존재하지만 이 경로가 디렉토리를 가리키지 않습니다: {0}.
pt_br: O caminho do diretório de saída a seguir existe, mas não aponta para um diretório: {0}.
zh_tw: 以下輸出目錄路徑存在，但該路徑不指向一個目錄：{0}。

# CDISP0464E
source: The following data directory path exists, but the path does not point to a directory: {0}.
de: Der folgende Datenverzeichnispfad ist vorhanden, der Pfad verweist jedoch nicht auf ein Verzeichnis: {0}.
es: Existe la vía de acceso de directorio de datos siguiente, pero la vía de acceso no apunta a un directorio {0}.
ko: 다음 데이터 디렉토리 경로가 존재하지만 이 경로가 디렉토리를 가리키지 않습니다: {0}.
pt_br: O caminho do diretório de dados a seguir existe, mas não aponta para um diretório: {0}.
zh_tw: 以下 data 目錄路徑存在，但該路徑不指向一個目錄：{0}。

# CDISP0465E
source: The following checkpoint directory path exists, but the path does not point to a directory: {0}.
de: Der folgende Prüfpunktverzeichnispfad ist vorhanden, der Pfad verweist jedoch nicht auf ein Verzeichnis: {0}.
es: Existe la vía de acceso de directorio de punto de comprobación siguiente, pero la vía de acceso no apunta a un directorio {0}.
ko: 다음 체크포인트 디렉토리 경로가 존재하지만 이 경로가 디렉토리를 가리키지 않습니다: {0}.
pt_br: O caminho do diretório de ponto de verificação a seguir existe, mas não aponta para um diretório: {0}.
zh_tw: 以下檢查點目錄路徑存在，但該路徑不指向一個目錄：{0}。
