Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLRuntimeMessages_*.xlf
Languages: de, fr

# CDISR5082E
source: The {0,number,0} output port of the processing element is not active. The SPL runtime is dropping the tuple or the punctuation.
de: Der Ausgabeport {0,number,0} des Verarbeitungselements ist nicht aktiv. Die SPL-Laufzeit löscht das Tupel oder die Punktuation.
fr: Le port de sortie {0,number,0} de l''élément de traitement n''est pas actif. Le module d''exécution SPL supprime le bloc de données ou la ponctuation.

# CDISR5083E
source: The following regular expression cannot be compiled: {0}.
de: Der folgende reguläre Ausdruck kann nicht kompiliert werden: {0}.
fr: Impossible de compiler l''expression régulière suivante : {0}.

# CDISR5084E
source: The following regular expression, which is used for substitution, could not be compiled: {0}.
de: Der folgende reguläre Ausdruck, der für Ersetzung verwendet wird, konnte nicht kompiliert werden: {0}.
fr: Impossible de compiler l''expression régulière suivante, qui est utilisée pour la substitution : {0}.

# CDISR5085E
source: The following metric was not found: {0}.
de: Die folgende Metrik wurde nicht gefunden: {0}.
fr: La métrique suivante est introuvable : {0}.

# CDISR5087E
source: The conversion from {0} to {1} is not supported.
de: Die Konvertierung von {0} in {1} wird nicht unterstützt.
fr: La conversion de {0} en {1} n''est pas prise en charge.

# CDISR5088E
source: A multibyte sequence that is not valid was encountered during the conversion from {0} to {1}.
de: Eine Mehrbytesequenz, die nicht gültig ist, trat während der Konvertierung von {0} in {1} auf.
fr: Une séquence multioctet non valide a été détectée lors de la conversion de {0} en {1}.

# CDISR5089E
source: The NativeByteBuffer cannot convert the pointer to a {0,number,0}-bit pointer.
de: NativeByteBuffer kann den Zeiger nicht in einen {0,number,0}-Bit-Zeiger konvertieren.
fr: La mémoire tampon d''octets native ne peut pas convertir le pointeur en un pointeur {0,number,0} bits.

# CDISR5090E
source: An object of the {0} class cannot be created from the C++ type T={1}.
de: Ein Objekt der Klasse {0} kann nicht vom C++-Typ T={1} erstellt werden.
fr: Un objet de la classe {0} ne peut pas être créé à partir du type C++ T={1}.

# CDISR5091E
source: The conversion to type {0} from a value handle that contains a value of type {1} is not valid.
de: Die Konvertierung in den Typ {0} von einer Wertkennung, die einen Wert des Typs {1} enthält, ist nicht gültig.
fr: La conversion en type {0} à partir d''un indicateur de valeur contenant une valeur de type {1} n''est pas valide.

# CDISR5092E
source: A tuple of type {0} cannot be assigned from a tuple of type {1}.
de: Ein Tupel des Typs {0} kann nicht von einem Tupel des Typs {1} zugewiesen werden.
fr: Un bloc de données du type {0} ne peut pas être affecté à partir d''un bloc de données du type {1}.

# CDISR5093E
source: A tuple of type {0} cannot be swapped with a tuple of type {1}.
de: Ein Tupel des Typs {0} kann nicht mit einem Tupel des Typs {1} ausgetauscht werden.
fr: Un bloc de données du type {0} ne peut pas être permuté avec un bloc de données du type {1}.

# CDISR5094E
source: The following set cannot be created from the collection: set<{0}>.
de: Die folgende Gruppe kann nicht aus der Objektgruppe erstellt werden: set<{0}>.
fr: L''ensemble suivant ne peut pas être créé à partir de la collection : set<{0}>.

# CDISR5095E
source: When the {0} operator was saving the checkpoint in the getCheckpoint routine, the operator encountered the following exception: {1}.
de: Als der Operator {0} den Prüfpunkt in der getCheckpoint-Routine speicherte, stellte der Operator die folgende Ausnahmebedingung fest: {1}.
fr: Lorsque l''opérateur {0} sauvegardait le point de contrôle dans la routine getCheckpoint, il a détecté l''exception suivante : {1}.

# CDISR5096E
source: The {0} operator failed because the keys of the maps are not identical.
de: Der Operator {0} ist fehlgeschlagen, weil die Schlüssel der Maps nicht identisch sind.
fr: L''opérateur {0} a échoué car les clés des mappes ne sont pas identiques.

# CDISR5097E
source: The following map cannot be created from the collection: map<{0},{1}>
de: Die folgende Map kann nicht aus der Objektgruppe erstellt werden: map<{0},{1}>
fr: La mappe suivante ne peut pas être créée à partir de la collection : map<{0},{1}>

# CDISR5098E
source: The {0} map index cannot be found.
de: Der Mapindex {0} kann nicht gefunden werden.
fr: L''index de mappe {0} est introuvable.

# CDISR5099E
source: The following list cannot be created from the collection: list<{0}>
de: Die folgende Liste kann nicht aus der Objektgruppe erstellt werden: list<{0}>.
fr: La liste suivante ne peut pas être créée à partir de la collection : list<{0}>.

# CDISR5100E
source: The lower bound {0,number,0} of the slice is greater than the size of the list, which is {1,number,0}.
de: Die Untergrenze {0,number,0} des Slice ist größer als die Größe der Liste, die {1,number,0} ist.
fr: La limite inférieure de la tranche, {0,number,0}, est supérieure à la taille de la liste, qui est égale à {1,number,0}.

# CDISR5101E
source: The {0} constant that was assigned to an Enum object is not correct.
de: Die Konstante {0}, die einem Aufzählungsobjekt zugewiesen war, ist nicht richtig.
fr: La constante {0} qui a été affectée à un objet Enum n''est pas correcte.

# CDISR5102E
source: An Enum object of type {0} cannot be assigned from an Enum object of type {1}.
de: Ein Aufzählungsobjekt des Typs {0} kann nicht von einem Aufzählungsobjekt des Typs {1} zugewiesen werden.
fr: Un objet Enum du type {0} ne peut pas être affecté à partir d''un objet Enum du type {1}.

# CDISR5103E
source: An Enum object of type {0} cannot be swapped with an Enum object of type {1}.
de: Ein Aufzählungsobjekt des Typs {0} kann nicht mit einem Aufzählungsobjekt des Typs {1} ausgetauscht werden.
fr: Un objet Enum du type {0} ne peut pas être permuté avec un objet Enum du type {1}.

# CDISR5104E
source: The following index is not valid: {0,number,0}. The valid range for the index is [0..{1,number,0}].
de: Der folgende Index ist nicht gültig: {0,number,0}. Der gültige Bereich für den Index ist [0..{1,number,0}].
fr: L''index suivant n''est pas valide : {0,number,0}. La plage valide pour l''index est [0..{1,number,0}].

# CDISR5105E
source: The lower bound of the slice is {0,number,0}, and the lower bound is greater than the size of the blob, which is {1,number,0}.
de: Die Untergrenze des Slice ist {0,number,0} und die Untergrenze ist größer als die Größe des großen Binärobjekts, die {1,number,0} ist.
fr: La limite inférieure de la tranche, {0,number,0}, est supérieure à la taille de l''objet BLOB, qui est égale à {1,number,0}.

# CDISR5106E
source: The following bounded map cannot be created from the collection: bmap<{0},{1},{2,number,0}>
de: Die folgende begrenzte Map kann nicht aus der Objektgruppe erstellt werden: bmap<{0},{1},{2,number,0}>
fr: La mappe limitée suivante ne peut pas être créée à partir de la collection : bmap<{0},{1},{2,number,0}>

# CDISR5107E
source: The following bounded map cannot be created from the collection: blist<{0},{1,number,0}>
de: Die folgende begrenzte Map kann nicht aus der Objektgruppe erstellt werden: blist<{0},{1,number,0}>
fr: La mappe limitée suivante ne peut pas être créée à partir de la collection : blist<{0},{1,number,0}>

# CDISR5108E
source: The front routine cannot be called on an empty list, which has no element at index 0.
de: Die Routine ''front'' kann nicht für eine Liste ohne Inhalt aufgerufen werden, die kein Element im Index 0 aufweist.
fr: La routine frontale ne peut pas être appelée sur une liste vide, qui ne comporte aucun élément au niveau de l''index 0.

# CDISR5109E
source: The back routine cannot be called on an empty list. The list has no element at index -1.
de: Die Routine ''back'' kann nicht für eine Liste ohne Inhalt aufgerufen werden. Die Liste weist kein Element im Index -1 auf.
fr: La routine précédente ne peut pas être appelée sur une liste vide. La liste ne comporte aucun élément au niveau de l''index -1.

# CDISR5110E
source: The following bounded string cannot be created from the collection: bstring<{0,number,0}>
de: Die folgende begrenzte Zeichenfolge kann nicht aus der Objektgruppe erstellt werden: bstring<{0,number,0}>
fr: La chaîne limitée suivante ne peut pas être créée à partir de la collection : bstring<{0,number,0}>

# CDISR5111E
source: The application is trying to resize the external buffer. The current size is {0,number,0}. The buffer requires {1,number,0} bytes.
de: Die Anwendung versucht, die Größe des externen Puffers zu ändern. Aktuelle Größe: {0,number,0}. Der Puffer erfordert {1,number,0} Byte.
fr: L''application tente de redimensionner la mémoire tampon externe. La taille en cours est {0,number,0}. La mémoire tampon requiert {1,number,0} octets.

# CDISR5112E
source: The attempt to resize the external buffer will result in a size that is greater than the maximum allowed size. The current size is {0,number,0}. The buffer requires {1,number,0} bytes, but the maximum allowed growth is {2,number,0}.
de: Der Versuch, die Größe des externen Puffers zu ändern, führt zu einer Größe, die die maximal zulässige Größe überschreitet. Aktuelle Größe: {0,number,0}. Der Puffer erfordert {1,number,0} Byte, der maximal zulässige Zuwachs ist jedoch {2,number,0}.
fr: La tentative de redimensionnement de la mémoire tampon externe va générer une taille supérieure à la taille maximale autorisée. La taille en cours est {0,number,0}. La mémoire tampon requiert {1,number,0} octets, mais la croissance maximale autorisée est {2,number,0}.

# CDISR5113E
source: The NetworkByteBuffer cannot convert a pointer to a {0,number,0}-bit pointer.
de: NetworkByteBuffer kann einen Zeiger nicht in einen {0,number,0}-Bit-Zeiger konvertieren.
fr: La mémoire tampon d''octets de réseau ne peut pas convertir un pointeur en un pointeur {0,number,0} bits.

# CDISR5114E
source: The {0} directory does not exist.
de: Das Verzeichnis {0} ist nicht vorhanden.
fr: Le répertoire {0} n''existe pas.

# CDISR5115E
source: The {0} pathname is not a directory.
de: Der Pfadname {0} ist kein Verzeichnis.
fr: Le nom de chemin {0} ne correspond pas à un répertoire.

# CDISR5116E
source: An internal error occurred at input port ID {0,number,0} of the processing element.
de: Ein interner Fehler ist bei Eingabeport-ID {0,number,0} des Verarbeitungselements aufgetreten.
fr: Une erreur interne s''est produite au niveau de l''ID de port d''entrée {0,number,0} de l''élément de traitement.

# CDISR5117E
source: An internal error occurred at output port ID {0,number,0} of the processing element.
de: Ein interner Fehler ist bei Ausgabeport-ID {0,number,0} des Verarbeitungselements aufgetreten.
fr: Une erreur interne s''est produite au niveau de l''ID de port de sortie {0,number,0} de l''élément de traitement.

# CDISR5118E
source: An internal error occurred at input port number {0,number,0} of the processing element.
de: Ein interner Fehler ist bei Eingabeportnummer {0,number,0} des Verarbeitungselements aufgetreten.
fr: Une erreur interne s''est produite au niveau du numéro de port d''entrée {0,number,0} de l''élément de traitement.

# CDISR5119E
source: The {0,number,0} output port index is not part of this processing element.
de: Der Ausgabeportindex {0,number,0} ist nicht Teil dieses Verarbeitungselements.
fr: L''index de port de sortie {0,number,0} ne fait pas partie de cet élément de traitement.

# CDISR5120E
source: An internal error occurred at operator index: {0,number,0}.
de: Ein interner Fehler ist im Operatorindex aufgetreten: {0,number,0}.
fr: Une erreur interne s''est produite au niveau de l''index d''opérateur : {0,number,0}.

# CDISR5121E
source: The multibyte sequence that was detected during the encoding from UTF-8 is not valid.
de: Die Mehrbytesequenz, die während der Codierung aus UTF-8 festgestellt wurde, ist nicht gültig.
fr: La séquence multioctet qui a été détectée lors du codage à partir de UTF-8 n''est pas valide.

# CDISR5122E
source: A multibyte sequence that is not valid was detected during the encoding to UTF-8.
de: Eine Mehrbytesequenz, die nicht gültig ist, wurde während der Codierung in UTF-8 festgestellt.
fr: Une séquence multioctet non valide a été détectée lors du codage en UTF-8.

# CDISR5123E
source: The {1} operator encountered an exception during the execution of the getCheckpoint routine. Processing element number {0,number,0} is terminating.
de: Der Operator {1} stellte während der Ausführung der getCheckpoint-Routine eine Ausnahmebedingung fest. Verarbeitungselement mit der Nummer {0,number,0} wird beendet.
fr: L''opérateur {1} a détecté une exception lors de l''exécution de la routine getCheckpoint. L''élément de traitement {0,numéro,0} est en cours d''arrêt.

# CDISR5124E
source: The {1} operator encountered an exception during the execution of restoreCheckpoint routine. Processing element number {0,number,0} is terminating.
de: Der Operator {1} stellte während der Ausführung der restoreCheckpoint-Routine eine Ausnahmebedingung fest. Verarbeitungselement mit der Nummer {0,number,0} wird beendet.
fr: L''opérateur {1} a détecté une exception lors de l''exécution de la routine restoreCheckpoint. L''élément de traitement {0,numéro,0} est en cours d''arrêt.

# CDISR5125E
source: The {0} metric already exists.
de: Die Metrik {0} ist bereits vorhanden.
fr: La métrique {0} existe déjà.

# CDISR5126E
source: A Java exception occurred at {0} during the JavaOp invocation.
de: Während des Aufrufs von JavaOp ist bei {0} eine Java-Ausnahmebedingung aufgetreten.
fr: Une exception Java s''est produite au niveau de {0} lors de l''appel JavaOp.

# CDISR5127E
source: Duplicate values were provided for the submission time parameter. The duplicate values are: {0} and {1}.
de: Für den Übergabezeitparameter wurden doppelte Werte angegeben. Die doppelten Werte sind: {0} und {1}.
fr: Des valeurs en double ont été indiquées pour le paramètre d''heure de soumission. Valeurs en double : {0} et {1}.

# CDISR5128E
source: Only a list<uint8> can be cast to a blob.
de: Nur list<uint8> kann in ein großes Binärobjekt umgesetzt werden.
fr: Seule une liste de type list<uint8> peut être transtypée en un objet BLOB.

# CDISR5129E
source: An error occurred while the dynamic shared object was loaded for the {0} processing element from the {1} file. The error is: {2}.
de: Beim Laden des dynamischen gemeinsam genutzten Objekts für das Verarbeitungselement {0} aus der Datei {1} ist ein Fehler aufgetreten. Fehler: {2}.
fr: Une erreur s''est produite lors du chargement de l''objet dynamique partagé pour l''élément de traitement {0} à partir du fichier {1}. Erreur : {2}.

# CDISR5130E
source: The cast to a complex value from the list value of {0} is not valid.
de: Die Umsetzung vom Listenwert {0} in einen komplexen Wert ist nicht gültig.
fr: Le transtypage vers une valeur complexe à partir de la valeur de liste {0} n''est pas valide.

# CDISR5131E
source: The input port at the index {0,number,0} of the {1} operator is not imported by subscription.
de: Der Eingabeport im Index {0,number,0} des Operators {1} wird von der Subskription nicht importiert.
fr: Le port d''entrée au niveau de l''index {0,number,0} de l''opérateur {1} n''est pas importé par un abonnement.

# CDISR5132E
source: The input port at index {0,number,0} of the {1} operator is not exported by properties.
de: Der Eingabeport im Index {0,number,0} des Operators {1} wird von den Eigenschaften nicht exportiert.
fr: Le port d''entrée au niveau de l''index {0,number,0} de l''opérateur {1} n''est pas exporté par des propriétés.

# CDISR5133E
source: The following tuple index is out of bounds: {0,number,0}. The valid range is 0..{1,number,0}.
de: Der folgende Tupelindex befindet sich außerhalb des gültigen Bereichs: {0,number,0}. Der gültige Bereich ist 0..{1,number,0}.
fr: L''index de blocs de données suivant est en dehors des limites : {0,number,0}. La plage valide est 0..{1,number,0}.

# CDISR5134E
source: The {0} attribute does not exist in the tuple.
de: Das Attribut {0} ist im Tupel nicht vorhanden.
fr: L''attribut {0} n''existe pas dans le bloc de données.

# CDISR5135E
source: The following input port index is outside the valid range: {0,number,0}. The valid range is [0..{1,number,0}).
de: Der folgende Eingabeportindex liegt außerhalb des gültigen Bereichs: {0,number,0}. Der gültige Bereich ist [0..{1,number,0}).
fr: L''index de port d''entrée suivant se situe en dehors de la plage valide : {0,number,0}. La plage valide est [0..{1,number,0}).

# CDISR5136E
source: An error occurred while parsing the XML string {0}. The error was: {1}.
de: Beim Parsing der XML-Zeichenfolge {0} ist ein Fehler aufgetreten. Fehler: {1}.
fr: Une erreur s''est produite lors de l''analyse syntaxique de la chaîne XML {0}. Erreur : {1}.

# CDISR5137E
source: An internal error occurred while the SPL runtime was searching for the {0} stream property.
de: Beim Suchen nach der Datenstromeigenschaft {0} durch die SPL-Laufzeit ist ein interner Fehler aufgetreten.
fr: Une erreur interne s''est produite alors que le module d''exécution SPL recherchait la propriété de flux {0}.

# CDISR5138E
source: The nested list in the conversion to the ublas matrix is not valid.
de: Die verschachtelte Liste in der Konvertierung in die ublas-Matrix ist nicht gültig.
fr: La liste imbriquée dans la conversion vers la matrice ublas n''est pas valide.

# CDISR5139E
source: The string length of {0,number,0} is too long to encode on a TCP connection to InfoSphere Streams Version 1.
de: Die Zeichenfolgelänge {0,number,0} ist zu groß, um für eine TCP-Verbindung zu InfoSphere Streams Version 1 codiert werden zu können.
fr: La longueur de chaîne {0,number,0} est trop élevée pour permettre le codage sur une connexion TCP vers InfoSphere Streams version 1.

# CDISR5140E
source: The pipe system call failed. The error is: {0}.
de: Der Pipesystemaufruf ist fehlgeschlagen. Fehler: {0}.
fr: Echec de l''appel système de canal. Erreur : {0}.

# CDISR5141E
source: The fork system call failed. The error is: {0}.
de: Der Verzweigungssystemaufruf ist fehlgeschlagen. Fehler: {0}.
fr: Echec de l''appel système de bifurcation. Erreur : {0}.

# CDISR5142E
source: The copy of the {0} file to the {1} file failed. The error is: {2}.
de: Das Kopieren der Datei {0} in die Datei {1} ist fehlgeschlagen. Fehler: {2}.
fr: La copie du fichier {0} dans le fichier {1} a échoué. Erreur : {2}.

# CDISR5143E
source: The SO_REUSEADDR option cannot be set on the socket. The error is: {0}.
de: Die Option SO_REUSEADDR kann für das Socket nicht festgelegt werden. Fehler: {0}.
fr: Impossible de définir l''option SO_REUSEADDR sur le socket. Erreur : {0}.

# CDISR5144E
source: The {0} operator failed because of a list size mismatch.
de: Der Operator {0} ist aufgrund einer Diskrepanz in der Listengröße fehlgeschlagen.
fr: L''opérateur {0} a échoué en raison d''une non concordance de taille de liste.

# CDISR5145E
source: The JavaOp operator cannot start the Java Virtual Machine. The JNI error codes are: {0,number,0} and {1,number,0}.
de: Der Operator ''JavaOp'' kann die Java Virtual Machine nicht starten. JNI-Fehlercodes: {0,number,0} und {1,number,0}.
fr: L''opérateur JavaOp ne peut pas démarrer la machine virtuelle Java. Codes d''erreur JNI : {0,number,0} et {1,number,0}.

# CDISR5146I
source: The {1} metric of the {0} operator has a value of {2,number,0} at exit.
de: Die Metrik {1} des Operators {0} hat beim Exit den Wert {2,number,0}.
fr: La valeur de la métrique {1} de l''opérateur {0} est {2,number,0} en sortie.

# CDISR5147I
source: The {0} metric of the processing element has a value of {1,number,0} at exit.
de: Die Metrik {0} des Verarbeitungselements hat beim Exit den Wert {1,number,0}.
fr: La valeur de la métrique {0} de l''élément de traitement est {1,number,0} en sortie.

# CDISR5148I
source: The required arguments are: {0}.
de: Erforderliche Argumente: {0}.
fr: Les arguments requis sont : {0}.

# CDISR5149I
source: The optional arguments are: {0}.
de: Optionale Argumente: {0}.
fr: Les arguments facultatifs sont : {0}.

# CDISR5150I
source: The {0} signal occurred during the application execution. The application is shutting down.
de: Das Signal {0} ist während der Anwendungsausführung aufgetreten. Die Anwendung wird beendet.
fr: Le signal {0} a été généré lors de l''exécution d''application. L''application est en cours d''arrêt.

# CDISR5151I
source: The {0} signal is trapped for the second time. The application is stopping.
de: Das Signal {0} wird ein zweites Mal abgefangen. Die Anwendung wird gestoppt.
fr: Le signal {0} est intercepté pour la seconde fois. L''application est en cours d''arrêt.

# CDISR5152I
source: Display this help and exit.
de: Diese Hilfe anzeigen und beenden.
fr: Afficher l''aide et fermer le programme.

# CDISR5153W
source: The messages for the {0} locale cannot be loaded. The default text of the messages will be used.
de: Die Nachrichten für die Locale {0} können nicht geladen werden. Es wird der Standardtext der Nachrichten verwendet.
fr: Impossible de charger les messages pour l''environnement local {0}. Le texte par défaut des messages sera utilisé.

# CDISR5154E
source: An error occurred during the processing of the {0} file. The error is: {1}.
de: Während der Verarbeitung der Datei {0} ist ein Fehler aufgetreten. Fehler: {1}.
fr: Une erreur s''est produite lors du traitement du fichier {0}. Erreur : {1}.

# CDISR5155E
source: An error occurred during the processing of tuple {0,number,0} in the {1} file. The error is: {2}.
de: Während der Verarbeitung des Tupels {0,number,0} in der Datei {1} ist ein Fehler aufgetreten. Fehler: {2}.
fr: Une erreur s''est produite lors du traitement du bloc de données {0,number,0} dans le fichier {1}. Erreur : {2}.

# CDISR5156E
source: An error occurred while the SPL runtime processing the XML string {0}.
de: Während der Verarbeitung der XML-Zeichenfolge {0} durch die SPL-Laufzeit ist ein Fehler aufgetreten.
fr: Une erreur s''est produite lors du traitement par le module d''exécution SPL de la chaîne XML {0}.

# CDISR5157E
source: An exception occurred during the execution of the application. The error is: {0}.
de: Während der Ausführung der Anwendung ist eine Ausnahmebedingung aufgetreten. Fehler: {0}.
fr: Une exception s''est produite lors de l''exécution de l''application. Erreur : {0}.

# CDISR5158E
source: An unknown exception occurred during the execution of the application.
de: Während der Ausführung der Anwendung ist eine unbekannte Ausnahmebedingung aufgetreten.
fr: Une exception inconnue s''est produite lors de l''exécution de l''application.

# CDISR5159W
source: The TCPSink operator lost the connection.
de: Der Operator ''TCPSink'' hat die Verbindung verloren.
fr: L''opérateur TCPSink a perdu la connexion.

# CDISR5160E
source: The system did not rename the {0} file to be the {1} file. The error is: {2}.
de: Das System hat die Datei {0} nicht in die Datei {1} umbenannt. Fehler: {2}.
fr: Le système n''a pas renommé le fichier {0} en fichier {1}. Erreur : {2}.

# CDISR5161E
source: The {0} parameter name was not found.
de: Der Parametername {0} wurde nicht gefunden.
fr: Le nom de paramètre {0} est introuvable.

# CDISR5162E
source: The value of the parameter is not a ConstValueHandle object.
de: Der Wert des Parameters ist kein ConstValueHandle-Objekt.
fr: La valeur du paramètre n''est pas un objet ConstValueHandle.

# CDISR5163E
source: The serialized XML for the {0} attribute is not the {1} type.
de: Das serialisierte XML für das Attribut {0} hat nicht den Typ {1}.
fr: Les données XML sérialisées pour l''attribut {0} ne sont pas du type {1}.
