Repository: IBMStreams/OSStreams
Catalog: src/cpp/SPL/message/StreamsSPLRuntimeMessages_*.xlf
Languages: de, fr

# CDISR5164E
source: The serialized tuple XML cannot be parsed. The error is: {0}.
de: Das serialisierte Tupel-XML kann nicht geparst werden. Fehler: {0}.
fr: Impossible de faire une analyse syntaxique des données XML de bloc de données sérialisées. Erreur : {0}.

# CDISR5165E
source: An error occurred during a conversion from the {0} value to the {1} type.
de: Während einer Konvertierung vom Wert {0} in den Typ {1} ist ein Fehler aufgetreten.
fr: Une erreur s''est produite lors d''une conversion de la valeur {0} en type {1}.

# CDISR5166E
source: The serialized XML for the {0} attribute is missing.
de: Das serialisierte XML für das Attribut {0} fehlt.
fr: Les données XML sérialisées pour l''attribut {0} sont manquantes.

# CDISR5167E
source: The serialized XML for the {0} type is missing.
de: Das serialisierte XML für den Typ {0} fehlt.
fr: Les données XML sérialisées pour le type {0} sont manquantes.

# CDISR5168E
source: The SPL runtime cannot parse the serialized tuple XML. An unknown exception occurred.
de: Die SPL-Laufzeit kann das serialisierte Tupel-XML nicht parsen. Eine unbekannte Ausnahmebedingung ist aufgetreten.
fr: Le module d''exécution SPL ne peut pas faire une analyse syntaxique des données XML de bloc de données sérialisées. Une exception inconnue s''est produite.

# CDISR5170E
source: The XML is not valid. The error is: {0}.
de: XML ist nicht gültig. Fehler: {0}.
fr: Les données XML ne sont pas valides. Erreur : {0}.

# CDISR5171E
source: The following XML schema cannot be loaded: {0}.
de: Das folgende XML-Schema kann nicht geladen werden: {0}.
fr: Impossible de charger le schéma XML suivant : {0}.

# CDISR5172E
source: The value of the operand of the modulus or division operator is zero, which is not valid.
de: Der Wert des Operanden des Modulus- oder Divisionsoperators ist Null, was nicht gültig ist.
fr: La valeur de l''opérande de l''opérateur modulo ou division est zéro, ce qui n''est pas valide.

# CDISR5173E
source: The {0} clause does not contain a modulo divisor.
de: Die Klausel {0} enthält keinen Modulo-Divisor.
fr: La clause {0} ne contient pas de diviseur de modulo.

# CDISR5174E
source: The {1} pattern of the {0} Filesink file parameter is not formed correctly.
de: Das Muster {1} des Dateiparameters ''Filesink'' {0} ist nicht ordnungsgemäß geformt.
fr: Le modèle {1} du paramètre de fichier Filesink {0} n''est pas correctement mis en forme.

# CDISR5175E
source: The Filesink file parameter generated an empty string.
de: Der Dateiparameter ''FileSink'' hat eine leere Zeichenfolge generiert.
fr: Le paramètre de fichier Filesink a généré une chaîne vide.

# CDISR5176E
source: An uninitialized XML value cannot be read.
de: Ein nicht initialisierter XML-Wert kann nicht gelesen werden.
fr: Une valeur XML non initialisée ne peut pas être lue.

# CDISR5177T
source: Log level: 0 - ERROR, 1 - WARN, 2 - INFO.
de: Protokollebene: 0 - FEHLER, 1 - WARNUNG, 2 - INFO.
fr: Niveau de journalisation : 0 - ERREUR, 1 - AVERT, 2 - INFO.

# CDISR5178T
source: Trace level: 0 - OFF, 1 - ERROR, 2 - WARN, 3 - INFO, 4 - DEBUG, 5 - TRACE.
de: Tracestufe: 0 - AUS, 1 - FEHLER, 2 - WARNUNG, 3 - INFO, 4 - DEBUG, 5 - TRACE.
fr: Niveau de trace : 0 - HF, 1 - ERREUR, 2 - AVERT, 3 - INFO, 4 - DEBOG, 5 - TRACE.

# CDISR5179E
source: An error occurred when a file was moved. The error is: {0}.
de: Beim Versetzen einer Datei ist ein Fehler aufgetreten. Fehler: {0}.
fr: Une erreur s''est produite lors du déplacement d''un fichier. Erreur : {0}.

# CDISR5180E
source: The write to the {0} file did not succeed.
de: In die Datei {0} konnte nicht geschrieben werden.
fr: L''écriture dans le fichier {0} n''a pas abouti.

# CDISR5181E
source: The following binary format type character is not recognized: {0}.
de: Das folgende Zeichen im Binärformat wird nicht erkannt: {0}.
fr: Le caractère de type de format binaire suivant n''est pas reconnu : {0}.

# CDISR5182E
source: The value of the step parameter to the range function is zero, which is not valid.
de: Der Wert des Schrittparameters für die Bereichsfunktion ist null, was nicht gültig ist.
fr: La valeur du paramètre d''étape vers la fonction de plage est égale à zéro, ce qui n''est pas valide.

# CDISR5183E
source: An error occurred in the following xquery expression: {0}. The error is: {1}.
de: Im folgenden XQuery-Ausdruck ist ein Fehler aufgetreten: {0}. Fehler: {1}.
fr: Une erreur s''est produite dans l''expression xquery suivante : {0}. Erreur : {1}.

# CDISR5184E
source: An error occurred when the following xquery was executed: {0}. The error is: {1}
de: Beim Ausführen der folgenden XQuery ist ein Fehler aufgetreten: {0}. Fehler: {1}
fr: Une erreur s''est produite lorsque l''expression xquery suivante a été exécutée : {0}. Erreur : {1}

# CDISR5185E
source: An unknown exception occurred during the xquery processing.
de: Während der XQuery-Verarbeitung ist eine unbekannte Ausnahmebedingung aufgetreten.
fr: Une exception inconnue s''est produite lors du traitement de l''expression xquery.

# CDISR5186E
source: The {0} attribute was not found in the tuple.
de: Das Attribut {0} wurde im Tupel nicht gefunden.
fr: L''attribut {0} est introuvable dans le bloc de données.

# CDISR5187E
source: The attribute type must be an integer type, a floating-point type, an rstring, or a boolean.
de: Der Attributtyp muss ein ganzzahliger Typ, Gleitkommatyp, rstring-Typ oder boolescher Typ sein.
fr: Le type d''attribut doit être un entier, une virgule flottante, une chaîne rstring ou une valeur booléenne.

# CDISR5188E
source: The attribute type of a list must be a list of an integer type, a floating-point type, rstring, or boolean.
de: Der Attributtyp einer Liste muss eine Liste eines ganzzahligen Typs, Gleitkommatyps, rstring-Typs oder booleschen Typs sein.
fr: Le type d''attribut d''une liste doit être un entier, une virgule flottante, une chaîne rstring ou une valeur booléenne.

# CDISR5189E
source: The left and right expressions have different types.
de: Die linken und rechten Ausdrücke habe unterschiedliche Typen.
fr: Les expressions gauche et droit ont des types différents.

# CDISR5190E
source: The attribute must have an integral type to use any arithmetic operation.
de: Das Attribut muss einen Integraltyp haben, um beliebige Rechenoperationen verwenden zu können.
fr: L''attribut doit avoir un type intégral pour utiliser une opération arithmétique.

# CDISR5191T
source: Run this utility from the source tree.
de: Dieses Dienstprogramm von der Quellenbaumstruktur ausführen.
fr: Exécutez cet utilitaire à partir de l''arbre source.

# CDISR5192I
source: The message ID that is used to retrieve the message (required).
de: Die Nachrichten-ID, mit der die Nachricht abgerufen wird (erforderlich).
fr: ID message utilisé pour extraire le message. (Obligatoire)

# CDISR5193I
source: The name of the resource bundle. If the name is not specified, it will be inferred by the prefix of the message ID. (optional)
de: Der Name des Ressourcenbundles. Wird der Name nicht angegeben, wird er vom Präfix der Nachrichten-ID abgeleitet. (optional)
fr: Nom du bundle de ressources. Si le nom n''est pas spécifié, il est induit par le préfixe de l''ID message. (Facultatif)

# CDISR5194I
source: The locale to use when the message is retrieved. The default is the system locale. (optional)
de: Die beim Abrufen der Nachricht zu verwendende Locale. Der Standardwert ist die Systemlocale. (optional)
fr: Environnement local à utiliser lorsque le message est extrait. L''environnement local de système est utilisé par défaut. (Facultatif)

# CDISR5195I
source: Do not output a new line character when the message is written. The default is to append a newline. (optional)
de: Kein Zeilenvorschubzeichen ausgeben, wenn die Nachricht geschrieben wird. Der Standardwert ist das Anhängen eines Zeilenumbruchs. (optional)
fr: Ne pas ajouter un caractère de retour à la ligne lors de l''écriture du message. Par défaut, un retour à la ligne est ajouté. (Facultatif)

# CDISR5196I
source: Do not prefix the message text with the message identifier. By default, the message prefix is be prepended. (optional)
de: Dem Nachrichtentext keine Nachrichten-ID voranstellen. Das Nachrichtenpräfix wird standardmäßig vorangestellt. (optional)
fr: Ne pas ajouter en préfixe l''ID message au texte de message. Par défaut, l''ID message est ajouté en préfixe. (Facultatif)

# CDISR5197I
source: The path to the bundle when the path is not in the default location. (optional)
de: Der Pfad zum Bundle, wenn der Pfad nicht an der Standardposition angegeben wird. (optional)
fr: Chemin d''accès au bundle lorsqu''il ne se trouve pas à l''emplacement par défaut. (Facultatif)

# CDISR5198I
source: Enable the debug mode. (optional)
de: Den Debugmodus aktivieren. (optional)
fr: Activer le mode débogage. (Facultatif)

# CDISR5199I
source: usage: st-getmsg -h | -m message [-b bundle] [-l locale] [-n] [-p] [-D] [argList]
de: Syntax: st-getmsg -h | -m Nachricht [-b Bundle] [-l Locale] [-n] [-p] [-D] [Argumentliste]
fr: Syntaxe : st-getmsg -h | -m message [-b bundle] [-l locale] [-n] [-p] [-D] [argList]

# CDISR5200I
source: The requested message is from a user application. The default is false. (optional)
de: Die angeforderte Nachricht kommt von einer Benutzeranwendung. Der Standardwert ist falsch. (optional)
fr: Le message demandé provient d''une application utilisateur. La valeur par défaut est false. (Facultatif)

# CDISR5201E
source: A message identifier must be specified.
de: Eine Nachrichten-ID muss angegeben werden.
fr: Un ID message doit être spécifié.

# CDISR5202E
source: The path must be specified for the user messages.
de: Der Pfad muss für die Benutzernachrichten angegeben werden.
fr: Le chemin doit être spécifié pour les messages utilisateur.

# CDISR5203E
source: The bundle name for the user messages must be specified.
de: Der Bundlename für die Benutzernachrichten muss angegeben werden.
fr: Le nom de bundle des messages utilisateur doit être spécifié.

# CDISR5204E
source: The {0} prefix does not match the {1} prefix of the specified bundle.
de: Das Präfix {0} stimmt nicht mit dem Präfix {1} des angegebenen Bundles überein.
fr: Le préfixe {0} ne correspond pas au préfixe {1} du bundle spécifié.

# CDISR5205I
source: The name of the toolkit that owns the resource bundle that contains the message.
de: Der Name des Toolkits, das der Eigner des Ressourcenbundles ist, das die Nachricht enthält.
fr: Nom du kit d''outils qui possède le bundle de ressources contenant le message.

# CDISR5206I
source: The locale in which the default text is specified. (optional)
de: Die Locale, in der der Standardtext angegeben ist. (optional)
fr: Environnement local dans lequel le texte par défaut est spécifié. (Facultatif)

# CDISR5207I
source: The default text for the message, which is used when the default locale matches the execution locale. (optional)
de: Der Standardtext für die Nachricht, die verwendet wird, wenn die Standardlocale mit der Ausführungslocale übereinstimmt. (optional)
fr: Texte par défaut du message, qui est utilisé lorsque l''environnement local par défaut correspond à l''environnement local d''exécution. (Facultatif)

# CDISR5208E
source: The following substitution argument is not valid: {0}.
de: Das folgende Ersetzungsargument ist nicht gültig: {0}.
fr: L''argument de substitution suivant n''est pas valide : {0}.

# CDISR5209E
source: The toolkit name must be specified for the user messages.
de: Der Toolkitname muss für die Benutzernachrichten angegeben werden.
fr: Le nom de kit d''outils doit être spécifié pour les messages utilisateur.

# CDISR5210E
source: The type of the substitution attribute with the {0} name is not a supported type. The type must be one of the following types: rstring, integral, or binary floating point.
de: Der Typ des Substitutionsattributs mit dem Namen {0} ist kein unterstützter Typ. Der Typ muss einer der folgenden Typen sein: rstring, Integral oder binäres Gleitkomma.
fr: Le type de l''attribut de substitution portant le nom {0} n''est pas pris en charge. Le type doit être l''un des suivants : rstring, intégral ou point en virgule flottante binaire.

# CDISR5211E
source: The {0} resource bundle cannot be found. The default messages will be used.
de: Das Ressourcenbundle {0} kann nicht gefunden werden. Es werden die Standardnachrichten verwendet.
fr: Le bundle de ressources {0} est introuvable. Les messages par défaut seront utilisés.

# CDISR5212E
source: An error occurred during the invocation of the {0} Java native function in namespace {1}. The error is: {2}.
de: Während des Aufrufs der nativen Java-Funktion {0} im Namensbereich {1} ist ein Fehler aufgetreten. Fehler: {2}.
fr: Une erreur s''est produite lors de l''appel de la fonction native Java {0} dans l''espace de nom {1}. Erreur : {2}.

# CDISR5213E
source: {0}: The wire format confirmation failed. The write operation failed at step {1,number,0}.
de: {0}: Sendeformatbestätigung fehlgeschlagen. Die Schreiboperation ist in Schritt {1,number,0} fehlgeschlagen.
fr: {0} : La confirmation de format WF a échoué. L''opération d''écriture a échoué à l''étape {1,number,0}.

# CDISR5214E
source: {0}: The wire format confirmation failed. The magic number is incorrect: {1,number,0}.
de: {0}: Sendeformatbestätigung fehlgeschlagen. Der Dateitypanzeiger ist falsch: {1,number,0}.
fr: {0} : La confirmation de format WF a échoué. Le nombre magique est incorrect : {1,number,0}.

# CDISR5215E
source: {0}: The wire format confirmation failed. The read operation timed out at step {1,number,0}.
de: {0}: Sendeformatbestätigung fehlgeschlagen. Das zulässige Zeitlimit der Leseoperation wurde in Schritt {1,number,0} überschritten .
fr: {0} : La confirmation de format WF a échoué. Un dépassement de délai d''attente s''est produit pour l''opération d''écriture à l''étape {1,number,0}.

# CDISR5216E
source: {0}: The wire format confirmation failed. The response at the following step is unknown: {1,number,0}.
de: {0}: Sendeformatbestätigung fehlgeschlagen. Die Antwort im folgenden Schritt ist unbekannt: {1,number,0}.
fr: {0} : La confirmation de format WF a échoué. La réponse saisie à l''étape suivante est inconnue : {1,number,0}.

# CDISR5217E
source: {0}: The wire format confirmation failed. The protocol cannot allocate a buffer of size {1,number,0} at step {2,number,0}.
de: {0}: Sendeformatbestätigung fehlgeschlagen. Das Protokoll kann einen Puffer der Größe {1,number,0} in Schritt {2,number,0} nicht zuordnen.
fr: {0} : La confirmation de format WF a échoué. Le protocole ne peut pas attribuer une mémoire tampon de taille {1,number,0} à l''étape {2,number,0}.

# CDISR5218E
source: {0}: The wire format confirmation failed. The error is: {1}
de: {0}: Sendeformatbestätigung fehlgeschlagen. Fehler: {1}
fr: {0} : La confirmation de format WF a échoué. Erreur : {1}

# CDISR5219I
source: {0}: The wire format confirmation succeeded: {1}.
de: {0}: Sendeformatbestätigung erfolgreich: {1}.
fr: {0} : La confirmation de format WF a abouti : {1}.

# CDISR5220E
source: {0}: The wire format confirmation failed. The XML of the wire format is not valid. The error is: {1}.
de: {0}: Sendeformatbestätigung fehlgeschlagen. XML des Sendeformats ist nicht gültig. Fehler: {1}.
fr: {0} : La confirmation de format WF a échoué. Les données XML du format WF ne sont pas valides. Erreur : {1}.

# CDISR5221W
source: A format mismatch exists. The mismatched formats are: {0} and {1}.
de: Es liegt eine Formatabweichung vor. Abweichende Formate: {0} und {1}.
fr: Non concordance de format. Formats non concordants : {0} et {1}.

# CDISR5222W
source: A data compression type mismatch exists. The mismatched compression types are: {0} and {1}.
de: Es liegt eine Abweichung bei den Datenkomprimierungstypen vor. Abweichende Komprimierungstypen: {0} und {1}.
fr: Non concordance de type de compression de données. Types de compression non concordants : {0} et {1}.

# CDISR5223W
source: An encoding mismatch exists. The mismatched encoding types are: {0} and {1}.
de: Es liegt eine Codierungsabweichung vor. Abweichenden Codierungstype: {0} und {1}.
fr: Non concordance de codage. Types de codage non concordants : {0} et {1}.

# CDISR5224W
source: The tuple schemas are not both present or are not both missing.
de: Die Tupelschemas sind beide nicht vorhanden oder beide fehlen nicht.
fr: Les deux schémas de bloc de données sont manquants ou présents.

# CDISR5225W
source: The tuple schemas are not identical.
de: Die Tupelschemas sind nicht identisch.
fr: Les schémas de bloc de données ne sont pas identiques.

# CDISR5226W
source: A mismatch of the includesPunctuations parameter settings exists. The mismatched parameter settings are: {0} and {1}.
de: Es liegt eine Abweichung der includesPunctuations-Parametereinstellungen vor. Abweichende Parametereinstellungen: {0} und {1}.
fr: Non concordance des valeurs de paramètre includesPunctuations. Valeurs de paramètre non concordantes : {0} et {1}.

# CDISR5227W
source: A mismatch of the hasDelay parameter settings exists. The mismatched parameter settings are: {0} and {1}.
de: Es liegt eine Abweichung der hasDelay-Parametereinstellungen vor. Abweichende Parametereinstellungen: {0} und {1}.
fr: Non concordance des valeurs de paramètre hasDelay. Valeurs de paramètre non concordantes : {0} et {1}.

# CDISR5233E
source: Processing element number {0,number,0} is unable to resolve the {1} TCP hostname or to resolve port number {2} from the {3} operator.
de: Verarbeitungselement mit der Nummer {0,number,0} kann den TCP-Hostnamen {1} oder die Portnummer {2} vom Operator {3} nicht auflösen.
fr: L''élément de traitement {0,number,0} est dans l''incapacité de résoudre le nom d''hôte TCP {1} ou le numéro de port {2} à partir de l''opérateur {3}.

# CDISR5234E
source: Processing element number {0,number,0} is unable to resolve the {1} UDP hostname or to resolve port number {2} from the {3} operator.
de: Verarbeitungselement mit der Nummer {0,number,0} kann den UDP-Hostnamen {1} oder die Portnummer {2} vom Operator {3} nicht auflösen.
fr: L''élément de traitement {0,number,0} est dans l''incapacité de résoudre le nom d''hôte UDP {1} ou le numéro de port {2} à partir de l''opérateur {3}.

# CDISR5235W
source: A processing element ignored signal number {0,number,0}.
de: Ein Verarbeitungselement hat die Signalnummer {0,number,0} ignoriert.
fr: Un élément de traitement a ignoré le numéro de signal {0,number,0}.

# CDISR5236E
source: The {0} argument to the keepAlive parameter is negative.
de: Das Argument {0} des Parameters keepAlive ist negativ.
fr: L''argument {0} indiqué pour le paramètre keepAlive est négatif.

# CDISR5237E
source: The TCP listen operation failed. The error is: {0}.
de: Die TCP-Überwachungsoperation ist fehlgeschlagen. Fehler: {0}.
fr: L''opération d''écoute via TCP a échoué. Erreur : {0}.

# CDISR5238E
source: The TCP poll operation failed. The error is: {0}.
de: Die TCP-Abfrageoperation ist fehlgeschlagen. Fehler: {0}.
fr: L''opération d''interrogation via TCP a échoué. Erreur : {0}.

# CDISR5239E
source: A control plane operation failed. The error is: {0}.
de: Eine Operation auf der Steuerebene ist fehlgeschlagen. Fehler: {0}.
fr: Une opération de plan de contrôle a échoué. Erreur : {0}.

# CDISR5240E
source: Invalid combination of arguments in control method invocation: passing {0} arguments, while the argument types vector is NULL.
de: Ungültige Kombination von Argumenten im Steuermethodenaufruf: {0} Argumente übergeben, der Vektor der Argumenttypen ist jedoch NULL.
fr: Combinaison non valide d''arguments dans l''appel de méthode de contrôle : {0} arguments ont été transmis alors que le vecteur de type d''argument est NULL.

# CDISR5241E
source: Invalid combination of arguments in control method invocation: passing {0} arguments and {1} argument types.
de: Ungültige Kombination von Argumenten im Steuermethodenaufruf: {0} Argumente und {1} Argumenttypen übergeben.
fr: Combinaison non valide d''arguments dans l''appel de méthode de contrôle : {0} arguments et {1} types d''argument ont été transmis.

# CDISR5242E
source: Unsupported type {0} in control method invocation.
de: Nicht unterstützter Typ {0} in Steuermethodenaufruf.
fr: Type non pris en charge, {0}, dans l''appel de méthode de contrôle.

# CDISR5243E
source: An operator was attempting to access the data directory and no data directory has been specified.
de: Ein Operator versuchte, auf das Datenverzeichnis zuzugreifen, und es wurde kein Datenverzeichnis angegeben.
fr: Un opérateur a tenté d''accéder au répertoire de données, or, aucun répertoire de données n''a été spécifié.

# CDISR5244E
source: The SPL Runtime got error when manipulating checkpoint data for {0} operator: {1}, received exception: {2}.
de: Die SPL-Laufzeit empfing beim Bearbeiten von Prüfpunktdaten für Operator {0} einen Fehler: {1}, empfangene Ausnahmebedingung: {2}.
fr: Une erreur s''est produite alors que le module d''exécution SPL était en train de manipuler les données de point de contrôle pour l''opérateur {0} : {1}, exception reçue : {2}.

# CDISR5245E
source: The read of the {0} attribute failed for the following tuple number: {1,number,0}.
de: Das Lesen des Attributs {0} ist für die folgende Tupelnummer fehlgeschlagen: {1,number,0}.
fr: La lecture de l''attribut {0} a échoué pour le numéro de bloc de données suivant : {1,number,0}.

# CDISR5246E
source: Environment variable {0} is undefined.
de: Umgebungsvariable {0} nicht definiert.
fr: La variable d''environnement {0} n''est pas définie.

# CDISR5247E
source: The system cannot find a Java installation.
de: Das System kann keine Java-Installation finden.
fr: Le système ne parvient pas à trouver une installation Java.

# CDISR5248E
source: The system failed to start the Java Virtual Machine. Function JNI_CreateJavaVM returned {0} and function JNI_GetCreatedJavaVMs returned {1}.
de: Das System konnte die Java Virtual Machine nicht starten. Funktion JNI_CreateJavaVM gab {0} und Funktion JNI_GetCreatedJavaVMs gab {1} zurück.
fr: Le système n''a pas réussi à démarrer la machine virtuelle java. La fonction JNI_CreateJavaVM a renvoyé {0} et la fonction JNI_GetCreatedJavaVMs a renvoyé {1}.

# CDISR5249E
source: The system failed to load the Java Virtual Machine library because of error in: {0}. dlerror() returned: {1}.
de: Das System konnte die Bibliothek der Java Virtual Machine aufgrund eines Fehlers in {0} nicht laden. dlerror() gab {1} zurück.
fr: Le système n''a pas réussi à charger la bibliothèque de machine virtuelle Java en raison de l''erreur décrite dans : {0}. dlerror() a renvoyé : {1}.

# CDISR5250E
source: The system failed to create a PE model.
de: Das System konnte kein PE-Modell erstellen.
fr: Le système n''a pas réussi à créer un modèle d''élément de traitement.

# CDISR5251E
source: The system failed to parse the PE model.
de: Das System konnte das PE-Modell nicht parsen.
fr: Le système n''a pas réussi à faire une analyse syntaxique du modèle d''élément de traitement.

# CDISR5252E
source: The subscript in a filter expression must be positive.
de: Der Index im Filterausdruck muss positiv sein.
fr: L''indice présent dans une expression de filtrage doit être positif.

# CDISR5253E
source: The literal value {0} in a filter expression is outside the allowed range of {1} - {2}.
de: Der Literalwert {0} in einem Filterausdruck befindet sich außerhalb des zulässigen Bereichs von {1} - {2}.
fr: La valeur littérale {0} présente dans une expression de filtrage est en dehors de la plage de valeurs admises, {1} - {2}.

# CDISR5254E
source: The literal value {0} in a filter expression is cannot be cast to an integer.
de: Der Literalwert {0} in einem Filterausdruck kann nicht in einen Integer umgesetzt werden.
fr: La valeur littérale {0} présente dans une expression de filtrage ne peut pas être transtypée vers un entier.
