Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA0123I
source: The {0} application configuration was removed successfully for the following instance: {1}
de: Die Anwendungskonfiguration {0} wurde erfolgreich für die folgende Instanz entfernt: {1}
ja: 次のインスタンスの {0} アプリケーション構成が正常に削除されました: {1}。
ru: Конфигурация приложения {0} успешно удалена из следующего экземпляра: {1}.
zh_cn: 已成功移除 {1} 实例的 {0} 应用程序配置

# CDISA0124I
source: The {0} application configuration was updated successfully for the following instance: {1}
de: Die Anwendungskonfiguration {0} wurde erfolgreich für die folgende Instanz aktualisiert: {1}
ja: 次のインスタンスの {0} アプリケーション構成が正常に更新されました: {1}。
ru: Конфигурация приложения {0} успешно обновлена для следующего экземпляра: {1}.
zh_cn: 已成功更新 {1} 实例的 {0} 应用程序配置

# CDISA0125I
source: The {0} domain was upgraded to version {1}.
de: Für die Domäne {0} wurde ein Upgrade auf Version {1} durchgeführt.
ja: {0} ドメインはバージョン {1} にアップグレードされました。
ru: Домен {0} обновлен до версии {1}.
zh_cn: {0} 域已升级到 V{1}。

# CDISA0126I
source: The {0} instance was upgraded to version {1}.
de: Für die Instanz {0} wurde ein Upgrade auf Version {1} durchgeführt.
ja: {0} インスタンスはバージョン {1} にアップグレードされました。
ru: Экземпляр {0} обновлен до версии {1}.
zh_cn: {0} 实例已升级到 V{1}。

# CDISA0127I
source: The command history for the following device type was cleared: {0}.
de: Das Befehlsprotokoll für den folgenden Einheitentyp wurde gelöscht: {0}.
ja: 次のデバイス・タイプのコマンド履歴がクリアされました: {0}。
ru: Хронология команд для следующего типа устройств очищена: {0}.
zh_cn: 已清除 {0} 设备类型的命令历史记录。

# CDISA0128I
source: The {0} instance.startAsVersion property was set to the following version: {1}.
de: Die Eigenschaft instance.startAsVersion von {0} wurde auf die folgende Version gesetzt: {1}.
ja: {0} の instance.startAsVersion プロパティーが次のバージョンに設定されました: {1}。
ru: Для свойства {0} instance.startAsVersion задана следующая версия: {1}.
zh_cn: {0} 的 instance.startAsVersion 属性已设置为 V{1}。

# CDISA0129I
source: IBM Streams is running version: {2}. The {0} instance will start at version: {1}.
de: IBM Streams führt Version {2} aus. Die Instanz {0} startet bei Version {1}.
ja: IBM Streams が次のバージョンで実行されています: {2}。{0} インスタンスは次のバージョンで開始します: {1}。
ru: IBM Streams работает в версии: {2}. Экземпляр {0} запустится с использованием версии {1}.
zh_cn: IBM Streams 正在运行 V{2}。{0} 实例将以 V{1} 启动。

# CDISA0130I
source: The {0} application configuration description was updated successfully for the following domain: {1}
de: Die Anwendungskonfigurationsbeschreibung {0} wurde erfolgreich für die folgende Domäne aktualisiert: {1}
ja: 次のドメインの {0} アプリケーション構成記述が正常に更新されました: {1}。
ru: Описание конфигурации приложения {0} успешно обновлена для следующего домена: {1}.
zh_cn: 已成功更新 {1} 域的 {0} 应用程序配置描述

# CDISA0131I
source: The {0} application configuration description was updated successfully for the following instance: {1}
de: Die Anwendungskonfigurationsbeschreibung {0} wurde erfolgreich für die folgende Instanz aktualisiert: {1}
ja: 次のインスタンスの {0} アプリケーション構成記述が正常に更新されました: {1}。
ru: Описание конфигурации приложения {0} успешно обновлена для следующего экземпляра: {1}.
zh_cn: 已成功更新 {1} 实例的 {0} 应用程序配置描述

# CDISA0132I
source: The {0} domain is upgrading to version {1}.
de: Für die Domäne {0} wird ein Upgrade auf Version {1} durchgeführt.
ja: {0} ドメインをバージョン {1} にアップグレードしています。
ru: Домен {0} обновляется до версии {1}.
zh_cn: {0} 域正在升级到 V{1}。

# CDISA0133I
source: The {0} instance is upgrading to version {1}.
de: Für die Instanz {0} wird ein Upgrade auf Version {1} durchgeführt.
ja: {0} インスタンスをバージョン {1} にアップグレードしています。
ru: Экземпляр {0} обновляется до версии {1}.
zh_cn: {0} 实例正在升级到 V{1}。

# CDISA0134I
source: The {0} build resource is updating the toolkit installation package for the following domain: {1}. This may take a few minutes to complete.
de: Die Buildressource {0} aktualisiert das Toolkitinstallationspaket für die folgende Domäne: {1}. Dies kann einige Minuten dauern.
ja: {0} ビルド・リソースが次のドメインのツールキット・インストール・パッケージを更新しています: {1}。これが完了するまで、数分かかる場合があります。
ru: Ресурс сборки {0} обновляет пакет установки инструментария для следующего домена: {1}. Это может занять несколько минут.
zh_cn: {0} 构建资源正在更新 {1} 域的工具箱安装软件包。这可能需要几分钟时间才能完成。

# CDISA0135I
source: The {0} build was submitted to the following build resource: {1}.
de: Der Build {0} wurde an die folgende Buildressource übergeben: {1}.
ja: {0} ビルドが次のビルド・リソースにサブミットされました: {1}。
ru: Сборка {0} передана в следующий ресурс сборки: {1}.
zh_cn: 已将 {0} 构建提交给 {1} 构建资源。

# CDISA0136I
source: The {0} build completed successfully for the following domain: {1}.
de: Der Build {0} wurde erfolgreich für die folgende Domäne abgeschlossen: {1}.
ja: 次のドメインの {0} ビルドが正常に完了しました: {1}。
ru: Сборка {0} успешно завершена для следующего домена: {1}.
zh_cn: {1} 域的 {0} 构建已成功完成。

# CDISA0137I
source: The {0} build was canceled for the following domain: {1}.
de: Der Build {0} wurde für die folgende Domäne abgebrochen: {1}.
ja: 次のドメインの {0} ビルドがキャンセルされました: {1}。
ru: Сборка {0} отменена для следующего домена: {1}.
zh_cn: 已取消 {1} 域的 {0} 构建。

# CDISA0138I
source: The {0} build was removed from the following domain: {1}.
de: Der Build {0} wurde aus der folgenden Domäne entfernt: {1}.
ja: {0} ビルドが次のドメインから削除されました: {1}。
ru: Сборка {0} удалена из следующего домена: {1}.
zh_cn: 已从 {1} 域中移除 {0} 构建。

# CDISA0139I
source: The restricted configuration properties were updated successfully for the following domain: {0}
de: Die Eigenschaften der eingeschränkten Konfiguration wurden für die folgende Domäne erfolgreich aktualisiert: {0}
ja: 次のドメインの制限構成プロパティーが正常に更新されました: {0}
ru: Свойства ограниченной конфигурации успешно обновлены для следующего домена: {0}.
zh_cn: 已对以下域成功更新受限制的配置属性：{0}

# CDISA0140I
source: The restricted configuration properties were removed successfully for the following domain: {0}
de: Die Eigenschaften der eingeschränkten Konfiguration wurden für die folgende Domäne erfolgreich entfernt: {0}
ja: 次のドメインの制限構成プロパティーが正常に削除されました: {0}
ru: Свойства ограниченной конфигурации успешно удалены для следующего домена: {0}.
zh_cn: 已对以下域成功移除受限制的配置属性：{0}

# CDISA0141I
source: The restricted configuration properties were updated successfully for the following instance: {0}
de: Die Eigenschaften der eingeschränkten Konfiguration wurden für die folgende Instanz erfolgreich aktualisiert: {0}
ja: 次のインスタンスの制限構成プロパティーが正常に更新されました: {0}
ru: Свойства ограниченной конфигурации успешно обновлены для следующего экземпляра: {0}.
zh_cn: 已对以下实例成功更新受限制的配置属性：{0}

# CDISA0142I
source: The restricted configuration properties were removed successfully for the following instance: {0}
de: Die Eigenschaften der eingeschränkten Konfiguration wurden für die folgende Instanz erfolgreich entfernt: {0}
ja: 次のインスタンスの制限構成プロパティーが正常に削除されました: {0}
ru: Свойства ограниченной конфигурации успешно удалены для следующего экземпляра: {0}.
zh_cn: 已对以下实例成功移除受限制的配置属性：{0}

# CDISA0143I
source: The sam and srm services must run on the same resource for the following instance: {0}. Both of these services were moved to the following resource: {1}.
de: Die Services sam und srm müssen für die folgende Instanz in derselben Ressource ausgeführt werden: {0}. Beide Services wurden in die folgende Ressource versetzt: {1}.
ja: 次のインスタンスで、sam サービスと srm サービスが同じリソース上で実行されなければなりません: {0}。これらの両方のサービスは、次のリソースに移動されました: {1}。
ru: Службы SAM и SRM должны работать на одном и том же ресурсе для следующего экземпляра: {0}. Обе эти службы перемещены на следующий ресурс: {1}.
zh_cn: sam 服务和 srm 服务必须在以下实例的同一资源上运行：{0}。这两项服务都已移至以下资源：{1}。

# CDISA0144I
source: The {0} service was moved from {1} to {2} for the following domain: {3}.
de: Der Service {0} wurde für die folgende Domäne von {1} nach {2} versetzt: {3}.
ja: 次のドメインで、{0} サービスが {1} から {2} に移動されました: {3}。
ru: Служба {0} перемещена с {1} на {2} для следующего домена: {3}.
zh_cn: 对于以下域，已将 {0} 服务从 {1} 移至 {2}：{3}。

# CDISA0145I
source: The {0} service was moved from {1} to {2} for the following instance: {3}.
de: Der Service {0} wurde für die folgende Instanz von {1} nach {2} versetzt: {3}.
ja: 次のインスタンスで、{0} サービスが {1} から {2} に移動されました: {3}。
ru: Служба {0} перемещена с {1} на {2} для следующего экземпляра: {3}.
zh_cn: 对于以下实例，已将 {0} 服务从 {1} 移至 {2}：{3}。

# CDISA0146I
source: The {0} service metrics were reset for the {1} resource in the following domain: {2}.
de: Die Metriken des Service {0} wurden für die Ressource {1} in der folgenden Domäne zurückgesetzt: {2}.
ja: 次のドメインで、{1} リソースの {0} サービスのメトリックがリセットされました: {2}。
ru: Показатели службы {0} сброшены для ресурса {1} в следующем домене: {2}.
zh_cn: 对于以下域中的 {1} 资源，已重置 {0} 服务指标：{2}。

# CDISA0147I
source: The {0} service metrics were reset for the {1} resource in the following instance: {2}.
de: Die Metriken des Service {0} wurden für die Ressource {1} in der folgenden Instanz zurückgesetzt: {2}.
ja: 次のインスタンスで、{1} リソースの {0} サービスのメトリックがリセットされました: {2}。
ru: Показатели службы {0} сброшены для ресурса {1} на следующем экземпляре: {2}.
zh_cn: 对于以下实例中的 {1} 资源，已重置 {0} 服务指标：{2}。

# CDISA0148I
source: The following tags were restricted for the {0} instance: {1}.
de: Die folgenden Tags wurden für die Instanz {0} eingeschränkt: {1}.
ja: {0} インスタンスの次のタグは制限されました: {1}。
ru: Следующие теги ограничены для экземпляра {0}: {1}.
zh_cn: 下列标记仅限用于 {0} 实例：{1}。

# CDISA0149I
source: The following tags were unrestricted for the {0} instance: {1}.
de: Die Einschränkung der folgenden Tags wurde für die Instanz {0} aufgehoben: {1}.
ja: {0} インスタンスの次のタグは制限が解除されました: {1}。
ru: Следующие теги не ограничены для экземпляра {0}: {1}.
zh_cn: 对于 {0} 实例，下列标记不受限制：{1}。

# CDISA3000W
source: Error contacting the {0} resource for the following domain: {1}. Data such as log files will not be removed.
de: Fehler beim Kontaktieren der Ressource {0} für die folgende Domäne: {1}. Daten wie Protokolldateien werden nicht entfernt.
ja: 次のドメインの {0} リソースへの接触中にエラーが発生しました: {1}。ログ・ファイルなどのデータは削除されません。
ru: Ошибка при попытке связаться с ресурсом {0} для следующего домена: {1}. Такие данные, как файлы журналов, не будут удалены.
zh_cn: 与 {1} 域的 {0} 资源联系时出错。将不会移除日志文件之类的数据。

# CDISA3001W
source: SUSE Linux Enterprise Server (SLES) uses the PAM UNIX2 backend on the following resource: {0}. This may prevent user authentication by password.
de: SUSE Linux Enterprise Server (SLES) verwendet das PAM-UNIX2-Backend in der folgenden Ressource: {0}. Dies verhindert möglicherweise die Benutzerauthentifizierung über Kennwörter.
ja: 次のリソースで SUSE Linux Enterprise Server (SLES) が PAM UNIX2 バックエンドを使用しています: {0}。これが原因で、パスワードによるユーザー認証ができなくなることがあります。
ru: SUSE Linux Enterprise Server (SLES) использует внутреннюю систему PAM UNIX2 на следующем ресурсе: {0}. Это может воспрепятствовать аутентификации пользователей на основе пароля.
zh_cn: 在 {0} 资源上，SUSE Linux Enterprise Server (SLES) 使用 PAM UNIX2 后端。这可能会阻止通过密码进行用户认证。

# CDISA3002W
source: The {0} resource running on the {1} host was revoked by the following resource manager: {2}.
de: Die Ressource {0}, die auf dem Host {1} ausgeführt wird, wurde durch den folgenden Ressourcenmanager entzogen: {2}.
ja: {1} ホスト上で実行されている {0} リソースが次のリソース・マネージャーによって取り消されました: {2}。
ru: Ресурс {0}, работающий на хосте {1}, отозван следующим менеджером ресурсов: {2}.
zh_cn: {2} 资源管理器已撤销正在 {1} 主机上运行的 {0} 资源。

# CDISA3003W
source: The following domain started with warnings: {0}. The domain is operational.
de: Die folgende Domäne wurde mit Warnungen gestartet: {0}. Die Domäne ist betriebsbereit.
ja: 次のドメインが開始しましたが、警告が出されました: {0}。ドメインは作動可能です。
ru: Следующий домен запущен с предупреждениями: {0}. Домен в рабочем состоянии.
zh_cn: 已启动 {0} 域，但存在警告。该域正常运行。

# CDISA3004W
source: The {0} instance started with warnings for the following domain: {1}. The instance is operational.
de: Die Instanz {0} wurde mit Warnungen für die folgende Domäne gestartet: {1}. Die Instanz ist betriebsbereit.
ja: 次のドメインの {0} インスタンスが開始しましたが、警告が出されました: {1}。インスタンスは作動可能です。
ru: Экземпляр {0} запущен с предупреждениями для следующего домена: {1}. Экземпляр в рабочем состоянии.
zh_cn: 已针对 {1} 域启动 {0} 实例，但存在警告。该实例正常运行。

# CDISA3005W
source: The following domain is operational: {0}. Some services did not start as configured.
de: Die folgende Domäne ist betriebsbereit: {0}. Einige Services wurden nicht wie konfiguriert gestartet.
ja: 次のドメインは作動可能です: {0}。一部のサービスが構成どおりに開始しませんでした。
ru: Следующий домен в рабочем состоянии: {0}. Некоторые службы не запущены, как сконфигурировано.
zh_cn: {0} 域正常运行。某些服务未按配置的那样启动。

# CDISA3006W
source: The {0} instance is operational for the following domain: {1}. Some services did not start as configured.
de: Die Instanz {0} ist für die folgende Domäne betriebsbereit: {1}. Einige Services wurden nicht wie konfiguriert gestartet.
ja: 次のドメインの {0} インスタンスは作動可能です: {1}。一部のサービスが構成どおりに開始しませんでした。
ru: Экземпляр {0} в рабочем состоянии для следующего домена: {1}. Некоторые службы не запущены, как сконфигурировано.
zh_cn: {1} 域的 {0} 实例正常运行。某些服务未按配置的那样启动。

# CDISA3007W
source: The {0} system service symbolic link for the {1} service cannot be removed.
de: Der symbolische System-Service-Link {0} für den Service {1} kann nicht entfernt werden.
ja: {1} サービスの {0} システム・サービスのシンボリック・リンクを削除できません。
ru: Удалить символьную ссылку системной службы {0} для службы {1} нельзя.
zh_cn: 无法移除 {1} 服务的 {0} 系统服务符号链接。

# CDISA3008W
source: The {0} directory for the {1} system service cannot be removed.
de: Das Verzeichnis {0} für den Systemservice {1} kann nicht entfernt werden.
ja: {1} システム・サービスの {0} ディレクトリーを削除できません。
ru: Удалить каталог {0} для системной службы {1} нельзя.
zh_cn: 无法移除 {1} 系统服务的 {0} 目录。

# CDISA3009W
source: The {0} file for the {1} system service cannot be removed.
de: Die Datei {0} für den Systemservice {1} kann nicht entfernt werden.
ja: {1} システム・サービスの {0} ファイルを削除できません。
ru: Удалить файл {0} для системной службы {1} нельзя.
zh_cn: 无法移除 {1} 系统服务的 {0} 文件。

# CDISA3010W
source: The controller trace files in the {0} directory for the {1} system service cannot be removed.
de: Die Controller-Trace-Dateien im Verzeichnis {0} für den Systemservice {1} können nicht entfernt werden.
ja: {1} システム・サービスの {0} ディレクトリー内のコントローラー・トレース・ファイルを削除できません。
ru: Удалить файлы трассировки контроллера в каталоге {0} для системной службы {1} нельзя.
zh_cn: 无法移除 {1} 系统服务的 {0} 目录中的控制器跟踪文件。

# CDISA3011W
source: The following domain does not exist: {0}. Processing will continue.
de: Die folgende Domäne ist nicht vorhanden: {0}. Die Verarbeitung wird fortgesetzt.
ja: 次のドメインは存在しません: {0}。処理は続行します。
ru: Следующий домен не существует: {0}. Обработка продолжается.
zh_cn: {0} 域不存在。将继续进行处理。

# CDISA3012W
source: The {0} resource is not available for the following domain: {1}.
de: Die Ressource {0} ist für die folgende Domäne nicht verfügbar: {1}.
ja: 次のドメインの {0} リソースは使用可能でありません: {1}。
ru: Ресурс {0} недоступен для следующего домена: {1}.
zh_cn: {0} 资源不可用于 {1} 域。

# CDISA3013W
source: No resources with the application tag are available in the {1} instance for the following domain: {2}. Using {0} as an application resource.
de: In der Instanz {1} für die folgende Domäne sind keine Ressourcen mit dem Anwendungstag verfügbar: {2}. {0} wird als Anwendungsressource verwendet.
ja: 次のドメインの {1} インスタンスで使用可能な、アプリケーション・タグを持つリソースがありません: {2}。{0} をアプリケーション・リソースとして使用します。
ru: В экземпляре {1} для указанного ниже домена нет ресурсов с тегом приложения: {2}. {0} используется как ресурс приложения.
zh_cn: 在 {2} 域的 {1} 实例中没有带有应用程序标记的可用资源。正在使用 {0} 作为应用程序资源。

# CDISA3014W
source: Lost connection to the following resource manager: {0}. The resource manager was running on host={1} and port={2}.
de: Die Verbindung zum folgenden Ressourcenmanager ist verloren gegangen: {0}. Der Ressourcenmanager wurde auf dem Host {1} an Port {2} ausgeführt.
ja: 次のリソース・マネージャーへの接続が失われました: {0}。リソース・マネージャーは、ホスト={1}、ポート={2} で実行されていました。
ru: Прервалось соединение со следующим менеджером ресурсов: {0}. Менеджер ресурсов работал на хосте {1} и порту {2}.
zh_cn: 与 {0} 资源管理器的连接已断开。该资源管理器是在主机 {1} 端口 {2} 上运行。

# CDISA3015W
source: The {0} ZooKeeper connection is not active.
de: Die ZooKeeper-Verbindung {0} ist nicht aktiv.
ja: {0} ZooKeeper 接続はアクティブでありません。
ru: Соединение ZooKeeper {0} не активно.
zh_cn: ZooKeeper 连接 {0} 未处于活动状态。

# CDISA3016W
source: The {0} system service cannot be stopped on the following resource: {1}. The resource is allocated to the following domain: {2}. Error is: {3}. The unregister request continued.
de: Der Systemservice {0} kann in der folgenden Ressource nicht gestoppt werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}. Fehler: {3}. Die Anforderung zum Zurücknehmen der Registrierung wurde fortgesetzt.
ja: 次のリソースで {0} システム・サービスを停止できません: {1}。リソースは次のドメインに割り振られています: {2}。エラー: {3}。登録抹消要求は続行しました。
ru: Системную службу {0} невозможно остановить на следующем ресурсе: {1}. Ресурс выделен домену {2}. Ошибка: {3}. Выполнение требования дерегистрации продолжится.
zh_cn: 无法在 {1} 资源上停止 {0} 系统服务。该资源已分配到 {2} 域。错误如下：{3}。注销请求已继续。

# CDISA3017W
source: The {0} system service cannot be removed from the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} kann aus der folgenden Ressource nicht entfernt werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソースから {0} システム・サービスを削除できません: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системную службу {0} невозможно удалить со следующего ресурса: {1}. Ресурс выделен домену {2}.
zh_cn: 无法从 {1} 资源中移除 {0} 系统服务。该资源已分配到 {2} 域。

# CDISA3018W
source: Allocated {0} of {1} resources for the following specification: {2}. The specification is allocated to the {3} instance for the following domain: {4}.
de: {0} von {1} Ressource wurden für die folgende Spezifikation zugeordnet: {2}. Die Spezifikation ist der Instanz {3} für die folgende Domäne zugeordnet: {4}.
ja: 次の仕様の {1} 個のリソースのうち {0} 個を割り振りました: {2}。仕様は次のドメインの {3} インスタンスに割り振られています: {4}。
ru: Выделены ресурсы в количестве {0} из {1} для следующей спецификации: {2}. Спецификация выделена экземпляру {3} для следующего домена {4}.
zh_cn: 已为 {2} 规范分配 {0} 个（共 {1} 个）资源。该规范已分配到 {4} 域的 {3} 实例。

# CDISA3019W
source: No resources with the management tag are available in the {1} instance for the following domain: {2}. Using {0} as a management resource.
de: In der Instanz {1} für die folgende Domäne sind keine Ressourcen mit dem Management-Tag verfügbar: {2}. {0} wird als Managementressource verwendet.
ja: 次のドメインの {1} インスタンスで使用可能な、管理タグを持つリソースがありません: {2}。{0} を管理リソースとして使用します。
ru: В экземпляре {1} для указанного ниже домена нет ресурсов с тегом управления: {2}. {0} используется как ресурс управления.
zh_cn: 在 {2} 域的 {1} 实例中没有带有管理标记的可用资源。正在使用 {0} 作为管理资源。

# CDISA3020W
source: Additonal resources should be tagged for application in the {1} instance for the following the domain: {2}. Using {0} as an application resource.
de: Zusätzliche Ressourcen sollten in der Instanz {1} für die folgende Domäne mit Tags für die Anwendung versehen werden: {2}. {0} wird als Anwendungsressource verwendet.
ja: 次のドメインの {1} インスタンスでアプリケーション用に追加リソースをタグ付けする必要があります: {2}。{0} をアプリケーション・リソースとして使用します。
ru: Дополнительные ресурсы должны быть помечены тегами для приложения в экземпляре {1} для следующего домена: {2}. {0} используется как ресурс приложения.
zh_cn: 应该为 {2} 域的 {1} 实例中的应用程序标记其他资源。正在使用 {0} 作为应用程序资源。

# CDISA3021W
source: High availability count is {0} for the following domain: {1}. The {2} service was placed evenly across {3} resources.
de: Hochverfügbarkeitsanzahl ist {0} für die folgende Domäne: {1}. Der Service {2} wurde gleichmäßig auf {3} Ressourcen verteilt.
ja: 次のドメインの高可用性カウントは {0} です: {1}。{2} サービスは {3} 個のリソースに均等に配置されました。
ru: Величина высокой доступности равна {0} для следующего домена: {1}. Служба {2} размещена равномерно по ресурсам {3}.
zh_cn: {1} 域的高可用性计数为 {0}。{2} 服务已均匀放置在 {3} 个资源上。

# CDISA3022W
source: High availability count is {0} for the {1} instance in the following domain: {2}. Management services were placed evenly across {3} resources.
de: Hochverfügbarkeitsanzahl ist {0} für die Instanz {1} in der folgenden Domäne: {2}. Die Management-Services wurden gleichmäßig auf {3} Ressourcen verteilt.
ja: 次のドメイン内の {1} インスタンスの高可用性カウントは {0} です: {2}。管理サービスは {3} 個のリソースに均等に配置されました。
ru: Величина высокой доступности равна {0} для экземпляра {1} в следующем домене: {2}. Службы управления размещены равномерно по ресурсам {3}.
zh_cn: {2} 域中的 {1} 实例的高可用性计数为 {0}。管理服务已均匀放置在 {3} 个资源上。

# CDISA3023W
source: The {0} unit configuration file for the {1} service cannot be removed.
de: Die Einheitenkonfigurationsdatei {0} für den Service {1} kann nicht entfernt werden.
ja: {1} サービスの {0} ユニット構成ファイルを削除できません。
ru: Удалить файл конфигурации модуля {0} для службы {1} нельзя.
zh_cn: 无法移除 {1} 服务的 {0} 单元配置文件。

# CDISA3024W
source: The following domain was removed with warnings: {0}.
de: Die folgende Domäne wurde mit Warnungen entfernt: {0}.
ja: 次のドメインが削除されましたが、警告が出されました: {0}。
ru: Следующий домен удален с предупреждениями: {0}.
zh_cn: 已移除 {0} 域，但存在警告。

# CDISA3025W
source: The following domain stopped with warnings: {0}.
de: Die folgende Domäne wurde mit Warnungen gestoppt: {0}.
ja: 次のドメインが停止しましたが、警告が出されました: {0}。
ru: Следующий домен остановлен с предупреждениями: {0}.
zh_cn: 已停止 {0} 域，但存在警告。

# CDISA3026W
source: The {0} instance was removed with warnings for the following domain: {1}.
de: Die Instanz {0} wurde mit Warnungen für die folgende Domäne entfernt: {1}.
ja: 次のドメインの {0} インスタンスが削除されましたが、警告が出されました: {1}。
ru: Экземпляр {0} удален с предупреждениями для следующего домена: {1}.
zh_cn: 已移除 {1} 域的 {0} 实例，但存在警告。

# CDISA3027W
source: The {0} instance was stopped with warnings for the following domain: {1}.
de: Die Instanz {0} wurde mit Warnungen für die folgende Domäne gestoppt: {1}.
ja: 次のドメインの {0} インスタンスが停止されましたが、警告が出されました: {1}。
ru: Экземпляр {0} остановлен с предупреждениями для следующего домена: {1}.
zh_cn: 已针对 {1} 域停止 {0} 实例，但存在警告。

# CDISA3028W
source: The {0} service failed to start on the following resource: {1}. The SSH exit code is {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. SSH-Exit-Code: {2}.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。SSH 終了コード: {2}。
ru: Не удалось запустить службу {0} на ресурсе {1}. Код выхода SSH - {2}.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。SSH 退出码为 {2}。

# CDISA3029W
source: The {0} service timed out while stopping on the following resource: {1}. The service has the following process id: {2}.
de: Der Service {0} hat beim Stoppen in der folgenden Ressource das zulässige Zeitlimit überschritten: {1}. Der Service hat die folgende Prozess-ID: {2}.
ja: {0} サービスが次のリソース上で停止中にタイムアウトになりました: {1}。サービスのプロセス ID は {2} です。
ru: Тайм-аут службы {0} во время остановки на ресурсе {1}. ID процесса службы: {2}.
zh_cn: 在 {1} 资源上停止 {0} 服务时发生超时。该服务具有进程标识 {2}。

# CDISA3030W
source: The {0} service timed out while stopping on the following resource: {1}. Attempting to kill the following process id: {2}.
de: Der Service {0} hat beim Stoppen in der folgenden Ressource das zulässige Zeitlimit überschritten: {1}. Es wird versucht, den Prozess mit der folgenden ID abzubrechen: {2}.
ja: {0} サービスが次のリソース上で停止中にタイムアウトになりました: {1}。次のプロセス ID の強制終了を試行します: {2}。
ru: Тайм-аут службы {0} во время остановки на ресурсе {1}. Попытка уничтожить следующий ID процесса: {2}.
zh_cn: 在 {1} 资源上停止 {0} 服务时发生超时。正在尝试终止进程标识 {2}。

# CDISA3031W
source: The {0} service failed to stop on the following resource: {1}. The service has the following process id: {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestoppt werden: {1}. Der Service hat die folgende Prozess-ID: {2}.
ja: 次のリソース上で {0} サービスの停止に失敗しました: {1}。サービスのプロセス ID は {2} です。
ru: Не удалось запустить службу {0} на ресурсе: {1}. ID процесса службы: {2}.
zh_cn: 无法在 {1} 资源上停止 {0} 服务。该服务具有进程标识 {2}。
