Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5214E
source: {0} is not a valid host and port specification.
de: {0} ist keine gültige Host- und Portspezifikation.
ja: {0} は、ホストおよびポートの無効な指定です。
ru: {0} не является допустимой спецификацией хоста и порта.
zh_cn: {0} 是无效主机和端口规范。

# CDISA5215E
source: The {0} user is not authorized to access data for the following job group: {1}.
de: Der Benutzer {0} ist nicht zum Zugriff auf Daten für die folgende Jobgruppe berechtigt: {1}.
ja: {0} ユーザーには、次のジョブ・グループのデータにアクセスする権限がありません: {1}。
ru: Пользователю {0} не разрешено получать доступ к данным для следующей группы заданий: {1}.
zh_cn: {0} 用户无权访问 {1} 作业组的数据。

# CDISA5216E
source: Key cannot be generated for the following domain: {0}.
de: Für die folgende Domäne kann ein Schlüssel nicht generiert werden: {0}.
ja: 次のドメインの鍵を生成できません: {0}。
ru: Невозможно сгенерировать ключ для следующего домена: {0}.
zh_cn: 无法为 {0} 域生成密钥。

# CDISA5217E
source: The {0} user is not authorized to show or edit properties for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Anzeigen oder Bearbeiten von Eigenschaften für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのプロパティーを表示および編集する権限がありません: {1}。
ru: Пользователю {0} не разрешено выводить на экран или изменять свойства для следующего домена: {1}.
zh_cn: {0} 用户无权显示或编辑 {1} 域的属性。

# CDISA5218E
source: An error occured updating the following domain: {0}.
de: Beim Aktualisieren der folgenden Domäne ist ein Fehler aufgetreten: {0}.
ja: 次のドメインの更新中にエラーが発生しました: {0}。
ru: Произошла ошибка при обновлении следующего домена: {0}.
zh_cn: 更新 {0} 域时发生错误。

# CDISA5219E
source: The following tag can not be removed: {0}. The tag is used by the following resource specification: {1}. The resource specification is allocated to the {2} instance for the following domain: {3}.
de: Der folgende Tag kann nicht entfernt werden: {0}. Der Tag wird von der folgenden Ressourcenspezifikation verwendet: {1}. Die Ressourcenspezifikation ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: 次のタグを削除できません: {0}。このタグは次のリソース仕様によって使用されています: {1}。リソース仕様は次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Следующий тег невозможно удалить: {0}. Тег используется следующей спецификацией ресурса: {1}. Спецификация ресурса выделена экземпляру {2} для следующего домена: {3}.
zh_cn: 无法移除 {0} 标记。此标记已由 {1} 资源规范使用。该资源规范已分配到 {3} 域的 {2} 实例。

# CDISA5220E
source: Remove host {0} from instance {1} in domain {2} timed out.
de: Beim Entfernen des Hosts {0} aus der Instanz {1} in der Domäne {2} wurde das zulässige Zeitlimit überschritten.
ja: ドメイン {2} 内のインスタンス {1} からのホスト {0} の削除がタイムアウトになりました。
ru: Произошел тайм-аут при удалении хоста {0} из экземпляра {1} в домене {2}.
zh_cn: 从域 {2} 的实例 {1} 中移除主机 {0} 时发生超时。

# CDISA5221I
source: View annotation {0} for job {1} has been added for the {2} instance in the following domain: {3}.
de: Die Ansichtsannotation {0} für den Job {1} wurde für die Instanz {2} in der folgenden Domäne hinzugefügt: {3}.
ja: 次のドメイン内の {2} インスタンスでジョブ {1} のビュー・アノテーション {0} が追加されました: {3}。
ru: Аннотация представления {0} для задания {1} добавлена для экземпляра {2} в следующем домене: {3}.
zh_cn: 已为 {3} 域中的 {2} 实例添加作业 {1} 的视图注释 {0}。

# CDISA5222I
source: View annotation {0} for job {1} has been removed from the {2} instance in the following domain: {3}.
de: Die Ansichtsannotation {0} für den Job {1} wurde aus der Instanz {2} in der folgenden Domäne entfernt: {3}.
ja: 次のドメイン内の {2} インスタンスからジョブ {1} のビュー・アノテーション {0} が削除されました: {3}。
ru: Аннотация представления {0} для задания {1} удалена из экземпляра {2} в следующем домене: {3}.
zh_cn: 已从 {3} 域的 {2} 实例中移除作业 {1} 的视图注释 {0}。

# CDISA5223E
source: View annotation {0} does not exist for the {1} instance in the following domain: {2}. The application may not be submitted.
de: Die Ansichtsannotation {0} für die Instanz {1} in der folgenden Domäne ist nicht vorhanden: {2}. Die Anwendung darf nicht übergeben werden.
ja: 次のドメイン内の {1} インスタンスにビュー・アノテーション {0} は存在しません: {2}。アプリケーションをサブミットできません。
ru: Аннотация представления {0} не существует для экземпляра {1} в следующем домене: {2}. Приложение не может быть передано.
zh_cn: {2} 域中的 {1} 实例的视图注释 {0} 不存在。可能未提交该应用程序。

# CDISA5224E
source: Internal error - user token not specified.
de: Interner Fehler - Benutzertoken nicht angegeben.
ja: 内部エラー - ユーザー・トークンが指定されていません。
ru: Внутренняя ошибка - не задан маркер пользователя.
zh_cn: 内部错误 - 未指定用户令牌。

# CDISA5225E
source: Internal error - view ID not specified.
de: Interner Fehler - Ansichts-ID nicht angegeben.
ja: 内部エラー - ビュー ID が指定されていません。
ru: Внутренняя ошибка - не задан ID представления.
zh_cn: 内部错误 - 未指定视图标识。

# CDISA5226E
source: Internal error - job ID {0} is not valid.
de: Interner Fehler - Job-ID {0} ist nicht gültig.
ja: 内部エラー - ジョブ ID {0} は無効です。
ru: Внутренняя ошибка - неправильный ID задания {0}.
zh_cn: 内部错误 - 作业标识 {0} 无效。

# CDISA5227E
source: Internal error - job ID not specified.
de: Interner Fehler - Job-ID nicht angegeben.
ja: 内部エラー - ジョブ ID が指定されていません。
ru: Внутренняя ошибка - не указан ID задания.
zh_cn: 内部错误 - 未指定作业标识。

# CDISA5228E
source: The {0} user is not authorized to modify permissions for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Modifizieren von Berechtigungen für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインの許可を変更する権限がありません: {1}。
ru: Пользователю {0} не разрешено изменять полномочия для следующего домена: {1}.
zh_cn: {0} 用户无权修改 {1} 域的许可权。

# CDISA5229E
source: The {0} user is not authorized to modify permissions on instance object: instance {2}, object {1}.
de: Der Benutzer {0} ist nicht zum Modifizieren von Berechtigungen für das folgende Instanzobjekt berechtigt: Instanz {2}, Objekt {1}.
ja: {0} ユーザーには、次のインスタンス・オブジェクトでの許可を変更する権限がありません: インスタンス {2}、オブジェクト {1}。
ru: Пользователю {0} не разрешено изменять разрешения для объекта экземпляра: экземпляр {2}, объект {1}.
zh_cn: {0} 用户无权修改对以下实例对象的许可权：实例 {2}，对象 {1}。

# CDISA5230E
source: The following job ID does not exist: {0}. The job may be cancelled.
de: Die folgende Job-ID ist nicht vorhanden: {0}. Möglicherweise wurde der Job abgebrochen.
ja: 次のジョブ ID は存在しません: {0}。ジョブはキャンセルされる可能性があります。
ru: Следующий ID задания не существует: {0}. Возможно, задание отменено.
zh_cn: 作业标识 {0} 不存在。可能已取消该作业。

# CDISA5231E
source: The {0} user is not authorized to access the following job: {1}.
de: Der Benutzer {0} ist nicht zum Zugriff auf den folgenden Job berechtigt: {1}.
ja: {0} ユーザーには、次のジョブにアクセスする権限がありません: {1}。
ru: Пользователю {0} не разрешено получать доступ к следующему заданию: {1}.
zh_cn: {0} 用户无权访问 {1} 作业。

# CDISA5232E
source: The {0} tag is in use by PEs {1} on the following resource: {2}. The resource is allocated to the {3} instance for the following domain: {4}. The tag can be modified or removed if the PEs are stopped.
de: Der Tag {0} wird in den Verarbeitungselementen {1} in der folgenden Ressource verwendet: {2}. Die Ressource ist der Instanz {3} für die folgende Domäne zugeordnet: {4}. Der Tag kann modifiziert oder entfernt werden, wenn die Verarbeitungselemente gestoppt sind.
ja: {0} タグは次のリソースで PE {1} によって使用中です: {2}。リソースは次のドメインの {3} インスタンスに割り振られています: {4}。PE を停止した場合、タグを変更または削除できます。
ru: Тег {0} используется элементами обработки (PE) {1} на следующем ресурсе: {2}. Ресурс выделен экземпляру {3} для домена {4}. Если PE остановлены, тег можно изменить или удалить.
zh_cn: 资源 {2} 上的 PE {1} 正在使用 {0} 标记。该资源已分配到 {4} 域的 {3} 实例。如果停止这些 PE，那么可以修改或移除此标记。

# CDISA5233E
source: Add host {0} to instance {1} in domain {2} timed out.
de: Beim Hinzufügen des Hosts {0} zur Instanz {1} in der Domäne {2} wurde das zulässige Zeitlimit überschritten.
ja: ドメイン {2} 内のインスタンス {1} へのホスト {0} の追加がタイムアウトになりました。
ru: Произошел тайм-аут при добавлении хоста {0} в экземпляр {1} в домене {2}.
zh_cn: 将主机 {0} 添加到域 {2} 中的实例 {1} 时发生超时。

# CDISA5234E
source: The {0} dynamic view does not exist for instance {1} in the following domain: {2}. The application may be cancelled.
de: Die dynamische Ansicht {0} für die Instanz {1} in der folgenden Domäne ist nicht vorhanden: {2}. Die Anwendung kann abgebrochen werden.
ja: 次のドメイン内のインスタンス {1} に {0} 動的ビューは存在しません: {2}。アプリケーションはキャンセルされる可能性があります。
ru: Динамическое представление {0} не существует для экземпляра {1} в следующем домене: {2}. Приложение может быть отменено.
zh_cn: 域 {2} 中的实例 {1} 的 {0} 动态视图不存在。可能已取消该应用程序。

# CDISA5235E
source: Internal error - Streams could not get reference resource OS and Architecture information for checkhost.
de: Interner Fehler - Streams konnte keine Informationen zum Betriebssystem und zur Architektur der Referenzressource für checkhost abrufen.
ja: 内部エラー - Streams が、checkhost 用の参照リソース OS およびアーキテクチャー情報を取得できませんでした。
ru: Внутренняя ошибка - Потоки не смогли получить информацию об ОС ссылочного ресурса и архитектуре для контрольного хоста.
zh_cn: 内部错误 - Streams 无法获取要用于 checkhost 的参考资源操作系统和体系结构信息。

# CDISA5236E
source: Internal error - view name not specified.
de: Interner Fehler - Ansichtsname nicht angegeben.
ja: 内部エラー - ビュー名が指定されていません。
ru: Внутренняя ошибка - имя представления не задано.
zh_cn: 内部错误 - 未指定视图名称。

# CDISA5237E
source: Internal error - job name not specified.
de: Interner Fehler - Jobname nicht angegeben.
ja: 内部エラー - ジョブ名が指定されていません。
ru: Внутренняя ошибка - не указано имя задания.
zh_cn: 内部错误 - 未指定作业名。

# CDISA5238E
source: View annotation for view name {0} job name {1} does not exist for instance {2} in domain {3}. The application may not be submitted.
de: Die Ansichtsannotation für Ansichtsname {0} und Jobname {1} ist für Instanz {2} in Domäne {3} nicht vorhanden. Die Anwendung darf nicht übergeben werden.
ja: ドメイン {3} 内のインスタンス {2} 用のビュー名 {0}、ジョブ名 {1} のビュー・アノテーションが存在しません。アプリケーションをサブミットできません。
ru: Аннотация представления для имени представления {0} имени задания {1} не существует для экземпляра {2} в домене {3}. Приложение не может быть передано.
zh_cn: 域 {3} 中实例 {2} 的视图名称 {0} 作业名 {1} 的视图注释不存在。可能未提交该应用程序。

# CDISA5239E
source: {0} is not a valid locale.
de: {0} ist keine gültige Locale.
ja: {0} は有効なロケールでありません。
ru: {0} - недопустимая локаль.
zh_cn: {0} 是无效语言环境。

# CDISA5240E
source: {0} is not a supported encoding. Encoding must be UTF-8.
de: {0} ist keine unterstützte Codierung. Die Codierung muss UTF-8 sein.
ja: {0} はサポートされるエンコード方式でありません。エンコード方式は UTF-8 でなければなりません。
ru: {0} - не поддерживаемая кодировка. Кодировка должна быть UTF-8.
zh_cn: {0} 不是受支持的编码。编码必须为 UTF-8。

# CDISA5241E
source: The controller service is terminating on the {0} resource for the following domain: {1}. The {2} architecture of the domain does not match the {3} architecture of the resource.
de: Der Controller-Service wird in der Ressource {0} für die folgende Domäne beendet: {1}. Die {2}-Architektur der Domäne stimmt nicht mit der {3}-Architektur der Ressource überein.
ja: 次のドメインの {0} リソースでコントローラー・サービスが終了します: {1}。ドメインの {2} アーキテクチャーがリソースの {3} アーキテクチャーに一致していません。
ru: Служба контроллера прекращает работу на ресурсе {0} для следующего домена: {1}. Архитектура {2} домена не соответствует архитектуре {3} ресурса.
zh_cn: {1} 域的 {0} 资源上的控制器服务正在终止。该域的 {2} 体系结构与该资源的 {3} 体系结构不匹配。

# CDISA5242E
source: The controller service is terminating on the resource {0} for the following domain: {1}. The domain is running at version {2}; which is not supported on the {3} operating system at {4} version.
de: Der Controller-Service wird in der Ressource {0} für die folgende Domäne beendet: {1}. Die Domäne wird für Version {2} ausgeführt; diese wird unter dem Betriebssystem {3} für Version {4} nicht unterstützt.
ja: 次のドメインのリソース {0} でコントローラー・サービスが終了します: {1}。ドメインはバージョン {2} で実行されていますが、これは {3} オペレーティング・システム ({4} バージョン) でサポートされません。
ru: Служба контроллера прекращает работу на ресурсе {0} для следующего домена: {1}. Домен работает на уровне версии {2}, которая не поддерживается в операционной системе {3} версии {4}.
zh_cn: {1} 域的 {0} 资源上的控制器服务正在终止。该域正在以 V{2} 运行；此版本在 {3} 操作系统 V{4} 上不受支持。

# CDISA5243E
source: The controller service is terminating on the resource {0} for the following domain: {1}. The domain is running at version {2}; which is not supported on the {3} operating system.
de: Der Controller-Service wird in der Ressource {0} für die folgende Domäne beendet: {1}. Die Domäne wird für Version {2} ausgeführt; diese wird unter dem Betriebssystem {3} nicht unterstützt.
ja: 次のドメインのリソース {0} でコントローラー・サービスが終了します: {1}。ドメインはバージョン {2} で実行されていますが、これは {3} オペレーティング・システムでサポートされません。
ru: Служба контроллера прекращает работу на ресурсе {0} для следующего домена: {1}. Домен работает на уровне версии {2}, которая не поддерживается в операционной системе {3}.
zh_cn: {1} 域的 {0} 资源上的控制器服务正在终止。该域正在以 V{2} 运行，此版本在 {3} 操作系统上不受支持。

# CDISA5244E
source: The controller service is terminating on the resource {0} for the following domain: {1}. The {2} operating system and {3} architecture, are not supported by the domain.
de: Der Controller-Service wird in der Ressource {0} für die folgende Domäne beendet: {1}. Das Betriebssystem {2} und die Architektur {3} werden von der Domäne nicht unterstützt.
ja: 次のドメインのリソース {0} でコントローラー・サービスが終了します: {1}。{2} オペレーティング・システムおよび {3} アーキテクチャーはドメインでサポートされません。
ru: Служба контроллера прекращает работу на ресурсе {0} для следующего домена: {1}. Операционная система {2} и архитектура {3} не поддерживаются доменом.
zh_cn: {1} 域的 {0} 资源上的控制器服务正在终止。该域不支持 {2} 操作系统和 {3} 体系结构。

# CDISA5245E
source: Unexpected error trying to read metric metatdata for the following instance: {0}.
de: Unerwarteter Fehler beim Lesen von Metrikmetatdaten für die folgende Instanz: {0}.
ja: 次のインスタンスのメトリック・メタデータを読み取ろうとしているときに予期しないエラーが発生しました: {0}。
ru: Неожиданная ошибка при попытке прочитать метаданные показателей для следующего экземпляра: {0}.
zh_cn: 尝试读取 {0} 实例的指标元数据时发生意外错误。

# CDISA5246E
source: {0} is not a valid job name. Either its size is longer than 1024 characters or it includes some invalid characters.
de: {0} ist kein gültiger Jobname. Er ist entweder länger als 1024 Zeichen oder er enthält ungültige Zeichen.
ja: {0} は有効なジョブ名でありません。サイズが 1024 文字より長いか、無効文字が含まれています。
ru: {0} - недопустимое имя задания. Либо длина превышает 1024 символов, либо содержатся какие-то недопустимые символы.
zh_cn: {0} 是无效作业名。此名称的长度超过 1024 个字符，或者它包含一些无效字符。

# CDISA5247E
source: Failed to restore annotated views for job {0} in instance {1} domain {2}. Cause: {3}
de: Die Wiederherstellung von Ansichten mit Annotationen ist für Job {0} in Instanz {1}, Domäne {2} fehlgeschlagen. Ursache: {3}
ja: インスタンス {1} (ドメイン {2}) 内のジョブ {0} のアノテーションが付けられたビューの復元に失敗しました。原因: {3}
ru: Не удалось восстановить аннотированные представления для задания {0} в экземпляре {1} домена {2}. Причина: {3}
zh_cn: 无法复原域 {2} 实例 {1} 中的作业 {0} 的带注释视图。原因：{3}

# CDISA5248E
source: Failed to restart view {0} for domain {2} instance {1}, job {3}, operator {4} port {5}. Cause: {6}
de: Der Neustart der Ansicht {0} für Domäne {2}, Instanz {1}, Job {3}, Operator {4}, Port {5} ist fehlgeschlagen. Ursache: {6}
ja: ドメイン {2}、インスタンス {1}、ジョブ {3}、オペレーター {4}、ポート {5} のビュー {0} の再始動に失敗しました。原因: {6}
ru: Не удалось перезапустить представление {0} для экземпляра {1} домена {2}, задание {3}, оператор {4} порт {5}. Причина: {6}
zh_cn: 无法重新启动域 {2} 实例 {1} 的视图 {0}，作业为 {3}，操作程序为 {4} 端口为 {5}。原因：{6}

# CDISA5249E
source: Failed to retrieve dynamic views for domain {0} instance {1}. Cause: {2}
de: Dynamische Ansichten für Domäne {0}, Instanz {1} konnten nicht abgerufen werden. Ursache: {2}
ja: ドメイン {0}、インスタンス {1} の動的ビューの取得に失敗しました。原因: {2}
ru: Не удалось получить динамические представления для экземпляра {1} домена {0}. Причина: {2}
zh_cn: 无法检索域 {0} 实例 {1} 的动态视图。原因：{2}

# CDISA5250E
source: Failed to restart view {0} for domain {2} instance {1}. Cause: {3}
de: Der Neustart der Ansicht {0} für Domäne {2}, Instanz {1} ist fehlgeschlagen. Ursache: {3}
ja: ドメイン {2}、インスタンス {1} のビュー {0} の再始動に失敗しました。原因: {3}
ru: Не удалось перезапустить представление {0} для домена {2} экземпляра {1}. Причина: {3}
zh_cn: 无法重新启动域 {2} 实例 {1} 的视图 {0}。原因：{3}

# CDISA5251E
source: Add resource specification {0} to instance {1} in domain {2} timed out.
de: Beim Hinzufügen der Ressourcenspezifikation {0} zur Instanz {1} in der Domäne {2} wurde das zulässige Zeitlimit überschritten.
ja: ドメイン {2} 内のインスタンス {1} へのリソース仕様 {0} の追加がタイムアウトになりました。
ru: Произошел тайм-аут при добавлении спецификации ресурса {0} в экземпляр {1} в домене {2}.
zh_cn: 将资源规范 {0} 添加到域 {2} 中的实例 {1} 时发生超时。

# CDISA5252E
source: Invalid value for bootstrap property ''{0}''. For embedded ZooKeeper the value must specify the hostname for the local host. Found: {1}. Use ''streamtool setbootproperty'' to update the property value.
de: Ungültiger Wert für Bootstrap-Eigenschaft ''{0}''. Für den integrierten ZooKeeper-Service muss der Wert den Hostnamen für den lokalen Host angeben. Gefunden {1}. Verwenden Sie ''streamtool setbootproperty'', um den Eigenschaftswert zu aktualisieren.
ja: ブートストラップ・プロパティー「{0}」の値が無効です。組み込み ZooKeeper の場合、この値にはローカル・ホストのホスト名を指定する必要があります。見つかった値: {1}。「streamtool setbootproperty」を使用してプロパティー値を更新してください。
ru: Недопустимое значение для свойства начальной загрузки ''{0}''. В случае встроенного компонента ZooKeeper значение должно задавать имя локального хоста. Найдено: {1}. Используйте ''streamtool setbootproperty'', чтобы обновить значение свойства.
zh_cn: 引导属性“{0}”的值无效。对于嵌入式 ZooKeeper，该值必须指定本地主机的主机名。已找到：{1}。请使用“streamtool setbootproperty”更新该属性值。

# CDISA5253E
source: The {0} user is not authorized to create the {3} jobgroup for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Erstellen der Jobgruppe {3} für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスの {3} ジョブ・グループを作成する権限がありません: {2}。
ru: Пользователю {0} не разрешено создавать группу заданий {3} для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权为 {2} 域中的 {1} 实例创建 {3} 作业组。

# CDISA5254E
source: The {0} user is not authorized to view the instance configuration for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Anzeigen der Instanzkonfiguration für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのインスタンス構成を表示する権限がありません: {2}。
ru: Пользователю {0} не разрешено просматривать конфигурацию экземпляра для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权查看 {2} 域中的 {1} 实例的实例配置。

# CDISA5255E
source: The {0} user is not authorized to view a host and its services for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Anzeigen eines Hosts und der zugehörigen Services für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのホストおよびそのサービスを表示する権限がありません: {2}。
ru: Пользователю {0} не разрешено просматривать хост и его службы для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权查看 {2} 域中的 {1} 实例的主机及其服务。

# CDISA5256E
source: The {0} user is not authorized to change the attributes of a host for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Ändern der Attribute eines Hosts für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのホストの属性を変更する権限がありません: {2}。
ru: Пользователю {0} не разрешено изменять атрибуты хоста для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权更改 {2} 域中的 {1} 实例的主机属性。

# CDISA5257E
source: The {0} user is not authorized to list available hosts for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Auflisten verfügbarer Hosts für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスの使用可能なホストをリストする権限がありません: {2}。
ru: Пользователю {0} не разрешено перечислять доступные хосты для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权列示 {2} 域中的 {1} 实例的可用主机。

# CDISA5258E
source: The {0} user is not authorized to add a host or add a service to a host for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Hinzufügen eines Hosts oder zum Hinzufügen eines Service zu einem Host für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスでのホストの追加およびホストへのサービスの追加を行う権限がありません: {2}。
ru: Пользователю {0} не разрешено добавлять хост или добавлять службу на хост для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权为 {2} 域中的 {1} 实例添加主机或向该实例的主机添加服务。

# CDISA5259E
source: The {0} user is not authorized to remove a host or remove a service from a host for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Entfernen eines Hosts oder zum Entfernen eines Service von einem Host für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスでのホストの削除およびホストからのサービスの削除を行う権限がありません: {2}。
ru: Пользователю {0} не разрешено удалять хост или удалять службу с хоста для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权从 {2} 域的 {1} 实例中移除主机或从该实例的主机中移除服务。

# CDISA5260E
source: Internal error - could not get PE connection based on Operator connection info {0} for domain {1} instance {2}.
de: Interner Fehler - die PE-Verbindung auf der Basis der Operatorverbindungsinformationen {0} für Domäne {1}, Instanz {2} konnte nicht abgerufen werden.
ja: 内部エラー - ドメイン {1}、インスタンス {2} のオペレーター接続情報 {0} に基づいて PE 接続を取得できませんでした。
ru: Внутренняя ошибка - не удалось получить соединение PE на основе информации о соединении оператора {0} для экземпляра {2} домена {1}.
zh_cn: 内部错误 - 无法根据域 {1} 实例 {2} 的操作程序连接信息 {0} 获取 PE 连接。

# CDISA5261E
source: The {0} service failed to start on the following resource: {1}. The initialJvmSize={2} property has been set; the maximumJvmSize property is required to be set.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Die Eigenschaft initialJvmSize wurde auf {2} gesetzt; die Eigenschaft maximumJvmSize muss festgelegt werden.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。initialJvmSize={2} プロパティーが設定されているため、maximumJvmSize プロパティーを設定する必要があります。
ru: Не удалось запустить службу {0} на ресурсе {1}. Свойство initialJvmSize={2} задано; нужно задать свойство maximumJvmSize.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。已将 initialJvmSize 属性设置为 {2}；需要设置 maximumJvmSize 属性。

# CDISA5262E
source: The {0} service failed to start on the following resource: {1}. The initialJvmSize={2} is greater than the maxJvmSize={3}
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Der Wert {2} für initialJvmSize ist größer als der Wert {3} für maxJvmSize.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。initialJvmSize={2} が maxJvmSize={3} より大きくなっています
ru: Не удалось запустить службу {0} на ресурсе {1}. initialJvmSize={2} больше чем maxJvmSize={3}
zh_cn: 无法在 {1} 资源上启动 {0} 服务。initialJvmSize 属性的值 {2} 大于 maxJvmSize 属性的值 {3}

# CDISA5263E
source: The {0} user is not authorized to list resources for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Auflisten von Ressourcen für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのリソースをリストする権限がありません: {2}。
ru: Пользователю {0} не разрешено перечислять ресурсы для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权列示 {2} 域中的 {1} 实例的资源。

# CDISA5264E
source: The following domain indicates that it is started; but no resources can be contacted: {0}. You may need to issue a stopdomain with the force option followed by a startdomain.
de: Die folgende Domäne gibt an, dass sie gestartet ist, aber es können keine Ressourcen kontaktiert werden: {0}. Sie müssen möglicherweise den Befehl ''stopdomain'' mit der Option ''force'' und anschließend den Befehl ''startdomain'' absetzen.
ja: 次のドメインは開始済みであると示していますが、どのリソースにも接触できません: {0}。force オプションを指定して stopdomain を発行してから、startdomain を発行する必要がある可能性があります。
ru: Для следующего домена указано, что он запущен, но связаться ни с какими ресурсами не удается: {0}. Возможно, вам придется ввести команду stopdomain с опцией force после startdomain.
zh_cn: {0} 域指示它已启动；但无法联系到任何资源。您可能需要先发出带有 force 选项的 stopdomain，然后发出 startdomain。
