Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5328I
source: User {0} successfully removed permissions for user {1} to security object {2} in domain {3}.
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Domäne {3} entfernt.
ja: ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可を正常に削除しました。
ru: Пользователь {0} успешно удалил разрешения для пользователя {1} на доступ к объекту защиты {2} в домене {3}.
zh_cn: 用户 {0} 已成功移除用户 {1} 对域 {3} 中的安全对象 {2} 的许可权。

# CDISA5329E
source: User {0} failed to remove permissions for user {1} to security object {2} in domain {3} due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Domäne {3} aufgrund eines unerwarteten Fehlers nicht entfernen.
ja: 予期しないエラーのため、ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可の削除に失敗しました。
ru: Пользователю {0} не удалось удалить разрешения для пользователя {1} на доступ к объекту защиты {2} в домене {3} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法移除用户 {1} 对域 {3} 中的安全对象 {2} 的许可权。

# CDISA5330I
source: User {0} successfully removed permissions for user {1} to security object {2} in instance {3} domain {4}.
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Instanz {3} in Domäne {4} entfernt.
ja: ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可を正常に削除しました。
ru: Пользователь {0} успешно удалил разрешения для пользователя {1} на доступ к объекту защиты {2} в экземпляре {3} и домене {4}.
zh_cn: 用户 {0} 已成功移除用户 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权。

# CDISA5331E
source: User {0} failed to remove permissions for user {1} to security object {2} in instance {3} domain {4} due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Instanz {3} und Domäne {4} aufgrund eines unerwarteten Fehlers nicht entfernen.
ja: 予期しないエラーのため、ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可の削除に失敗しました。
ru: Пользователю {0} не удалось удалить разрешения для пользователя {1} на доступ к объекту защиты {2} в экземпляре {3} домене {4} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法移除用户 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权。

# CDISA5332I
source: User {0} successfully removed permissions for group {1} to security object {2} in domain {3}.
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Domäne {3} entfernt.
ja: ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可を正常に削除しました。
ru: Пользователь {0} успешно удалил разрешения для группы {1} на доступ к объекту защиты {2} в домене {3}.
zh_cn: 用户 {0} 已成功移除组 {1} 对域 {3} 中的安全对象 {2} 的许可权。

# CDISA5333E
source: User {0} failed to remove permissions for group {1} to security object {2} in domain {3} due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Domäne {3} aufgrund eines unerwarteten Fehlers nicht entfernen.
ja: 予期しないエラーのため、ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可の削除に失敗しました。
ru: Пользователю {0} не удалось удалить разрешения для группы {1} на доступ к объекту защиты {2} в домене {3} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法移除组 {1} 对域 {3} 中的安全对象 {2} 的许可权。

# CDISA5334I
source: User {0} successfully removed permissions for group {1} to security object {2} in instance {3} domain {4}.
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Instanz {3} in Domäne {4} entfernt.
ja: ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可を正常に削除しました。
ru: Пользователь {0} успешно удалил разрешения для группы {1} на доступ к объекту защиты {2} в экземпляре {3} и домене {4}.
zh_cn: 用户 {0} 已成功移除组 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权。

# CDISA5335E
source: User {0} failed to remove permissions for group {1} to security object {2} in instance {3} domain {4} due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Instanz {3} und Domäne {4} aufgrund eines unerwarteten Fehlers nicht entfernen.
ja: 予期しないエラーのため、ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可の削除に失敗しました。
ru: Пользователю {0} не удалось удалить разрешения для группы {1} на доступ к объекту защиты {2} в экземпляре {3} домене {4} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法移除组 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权。

# CDISA5336I
source: User {0} successfully removed permissions for role {1} to security object {2} in domain {3}.
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Rolle {1} für das Sicherheitsobjekt {2} in Domäne {3} entfernt.
ja: ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するロール {1} の許可を正常に削除しました。
ru: Пользователь {0} успешно удалил разрешения для роли {1} на доступ к объекту защиты {2} в домене {3}.
zh_cn: 用户 {0} 已成功移除角色 {1} 对域 {3} 中的安全对象 {2} 的许可权。

# CDISA5337E
source: User {0} failed to remove permissions for role {1} to security object {2} in domain {3} due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Rolle {1} für das Sicherheitsobjekt {2} in Domäne {3} aufgrund eines unerwarteten Fehlers nicht entfernen.
ja: 予期しないエラーのため、ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するロール {1} の許可の削除に失敗しました。
ru: Пользователю {0} не удалось удалить разрешения для роли {1} на доступ к объекту защиты {2} в домене {3} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法移除角色 {1} 对域 {3} 中的安全对象 {2} 的许可权。

# CDISA5338I
source: User {0} successfully removed permissions for role {1} to security object {2} in instance {3} domain {4}.
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Rolle {1} für das Sicherheitsobjekt {2} in Instanz {3} in Domäne {4} entfernt.
ja: ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するロール {1} の許可を正常に削除しました。
ru: Пользователь {0} успешно удалил разрешения для роли {1} на доступ к объекту защиты {2} в экземпляре {3} и домене {4}.
zh_cn: 用户 {0} 已成功移除角色 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权。

# CDISA5339E
source: User {0} failed to remove permissions for group {1} to security object {2} in instance {3} domain {4} due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Instanz {3} und Domäne {4} aufgrund eines unerwarteten Fehlers nicht entfernen.
ja: 予期しないエラーのため、ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可の削除に失敗しました。
ru: Пользователю {0} не удалось удалить разрешения для группы {1} на доступ к объекту защиты {2} в экземпляре {3} домене {4} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法移除组 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权。

# CDISA5340I
source: User {0} successfully set permissions for user {1} to security object {2} in domain {3} [{4}={5}] [default={6}].
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Domäne {3} [{4}={5}] [Standardwert={6}] festgelegt.
ja: ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可 ([{4}={5}] [デフォルト={6}]) を正常に設定しました。
ru: Пользователь {0} успешно задал разрешения для пользователя {1} на доступ к объекту защиты {2} в домене {3} [{4}={5}] [по умолчанию={6}].
zh_cn: 用户 {0} 已成功设置用户 {1} 对域 {3} 中的安全对象 {2} 的许可权 [{4}={5}] [缺省值为 {6}]。

# CDISA5341I
source: User {0} failed to set permissions for user {1} to security object {2} in domain {3} [{4}={5}] [default={6}] due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Domäne {3} [{4}={5}] [Standardwert={6}] aufgrund eines unerwarteten Fehlers nicht festlegen.
ja: 予期しないエラーのため、ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可 ([{4}={5}] [デフォルト={6}]) の設定に失敗しました。
ru: Пользователю {0} не удалось задать разрешения для пользователя {1} на доступ к объекту защиты {2} в домене {3} [{4}={5}] [по умолчанию={6}] из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法设置用户 {1} 对域 {3} 中的安全对象 {2} 的许可权 [{4}={5}] [缺省值为 {6}]。

# CDISA5342I
source: User {0} successfully set permissions for user {1} to security object {2} in instance {3} domain {4} [{5}={6}] [default={7}].
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Instanz {3}, Domäne {4} [{5}={6}] [Standardwert={7}] festgelegt.
ja: ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可 ([{5}={6}] [デフォルト={7}]) を正常に設定しました。
ru: Пользователь {0} успешно задал разрешения для пользователя {1} на доступ к объекту защиты {2} в экземпляре {3} в домене {4} [{5}={6}] [по умолчанию={7}].
zh_cn: 用户 {0} 已成功设置用户 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权 [{5}={6}] [缺省值为 {7}]。

# CDISA5343I
source: User {0} failed to set permissions for user {1} to security object {2} in instance {3} domain {4} [{5}={6}] [default={7}] due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Benutzer {1} für das Sicherheitsobjekt {2} in Instanz {3}, Domäne {4} [{5}={6}] [Standardwert={7}]] aufgrund eines unerwarteten Fehlers nicht festlegen.
ja: 予期しないエラーのため、ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するユーザー {1} の許可 ([{5}={6}] [デフォルト={7}]) の設定に失敗しました。
ru: Пользователю {0} не удалось задать разрешения для пользователя {1} на доступ к объекту защиты {2} в экземпляре {3} в домене {4} [{5}={6}] [по умолчанию={7}] из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法设置用户 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权 [{5}={6}] [缺省值为 {7}]。

# CDISA5344I
source: User {0} successfully set permissions for group {1} to security object {2} in domain {3} [{4}={5}] [default={6}].
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Domäne {3} [{4}={5}] [Standardwert={6}] festgelegt.
ja: ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可 ([{4}={5}] [デフォルト={6}]) を正常に設定しました。
ru: Пользователь {0} успешно задал разрешения для группы {1} на доступ к объекту защиты {2} в домене {3} [{4}={5}] [по умолчанию={6}].
zh_cn: 用户 {0} 已成功设置组 {1} 对域 {3} 中的安全对象 {2} 的许可权 [{4}={5}] [缺省值为 {6}]。

# CDISA5345I
source: User {0} failed to set permissions for group {1} to security object {2} in domain {3} [{4}={5}] [default={6}] due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Domäne {3} [{4}={5}] [Standardwert={6}] aufgrund eines unerwarteten Fehlers nicht festlegen.
ja: 予期しないエラーのため、ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可 ([{4}={5}] [デフォルト={6}]) の設定に失敗しました。
ru: Пользователю {0} не удалось задать разрешения для группы {1} на доступ к объекту защиты {2} в домене {3} [{4}={5}] [по умолчанию={6}] из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法设置组 {1} 对域 {3} 中的安全对象 {2} 的许可权 [{4}={5}] [缺省值为 {6}]。

# CDISA5346I
source: User {0} successfully set permissions for group {1} to security object {2} in instance {3} domain {4} [{5}={6}] [default={7}].
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Instanz {3}, Domäne {4} [{5}={6}] [Standardwert={7}] festgelegt.
ja: ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可 ([{5}={6}] [デフォルト={7}]) を正常に設定しました。
ru: Пользователь {0} успешно задал разрешения для группы {1} на доступ к объекту защиты {2} в экземпляре {3} в домене {4} [{5}={6}] [по умолчанию={7}].
zh_cn: 用户 {0} 已成功设置组 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权 [{5}={6}] [缺省值为 {7}]。

# CDISA5347I
source: User {0} failed to set permissions for group {1} to security object {2} in instance {3} domain {4} [{5}={6}] [default={7}] due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Gruppe {1} für das Sicherheitsobjekt {2} in Instanz {3}, Domäne {4} [{5}={6}] [Standardwert={7}]] aufgrund eines unerwarteten Fehlers nicht festlegen.
ja: 予期しないエラーのため、ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するグループ {1} の許可 ([{5}={6}] [デフォルト={7}]) の設定に失敗しました。
ru: Пользователю {0} не удалось задать разрешения для группы {1} на доступ к объекту защиты {2} в экземпляре {3} в домене {4} [{5}={6}] [по умолчанию={7}] из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法设置组 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权 [{5}={6}] [缺省值为 {7}]。

# CDISA5348I
source: User {0} successfully set permissions for role {1} to security object {2} in domain {3} [{4}={5}] [default={6}].
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Rolle {1} für das Sicherheitsobjekt {2} in Domäne {3} [{4}={5}] [Standardwert={6}] festgelegt.
ja: ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するロール {1} の許可 ([{4}={5}] [デフォルト={6}]) を正常に設定しました。
ru: Пользователь {0} успешно задал разрешения для роли {1} на доступ к объекту защиты {2} в домене {3} [{4}={5}] [по умолчанию={6}].
zh_cn: 用户 {0} 已成功设置角色 {1} 对域 {3} 中的安全对象 {2} 的许可权 [{4}={5}] [缺省值为 {6}]。

# CDISA5349I
source: User {0} failed to set permissions for role {1} to security object {2} in domain {3} [{4}={5}] [default={6}] due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Rolle {1} für das Sicherheitsobjekt {2} in Domäne {3} [{4}={5}] [Standardwert={6}] aufgrund eines unerwarteten Fehlers nicht festlegen.
ja: 予期しないエラーのため、ユーザー {0} が、ドメイン {3} 内のセキュリティー・オブジェクト {2} に対するロール {1} の許可 ([{4}={5}] [デフォルト={6}]) の設定に失敗しました。
ru: Пользователю {0} не удалось задать разрешения для роли {1} на доступ к объекту защиты {2} в домене {3} [{4}={5}] [по умолчанию={6}] из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法设置角色 {1} 对域 {3} 中的安全对象 {2} 的许可权 [{4}={5}] [缺省值为 {6}]。

# CDISA5350I
source: User {0} successfully set permissions for role {1} to security object {2} in instance {3} domain {4} [{5}={6}] [default={7}].
de: Der Benutzer {0} hat erfolgreich Berechtigungen für Rolle {1} für das Sicherheitsobjekt {2} in Instanz {3}, Domäne {4} [{5}={6}] [Standardwert={7}] festgelegt.
ja: ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するロール {1} の許可 ([{5}={6}] [デフォルト={7}]) を正常に設定しました。
ru: Пользователь {0} успешно задал разрешения для роли {1} на доступ к объекту защиты {2} в экземпляре {3} в домене {4} [{5}={6}] [по умолчанию={7}].
zh_cn: 用户 {0} 已成功设置角色 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权 [{5}={6}] [缺省值为 {7}]。

# CDISA5351I
source: User {0} failed to set permissions for role {1} to security object {2} in instance {3} domain {4} [{5}={6}] [default={7}] due to unexpected error.
de: Der Benutzer {0} konnte Berechtigungen für Rolle {1} für das Sicherheitsobjekt {2} in Instanz {3}, Domäne {4} [{5}={6}] [Standardwert={7}]] aufgrund eines unerwarteten Fehlers nicht festlegen.
ja: 予期しないエラーのため、ユーザー {0} が、インスタンス {3} (ドメイン {4}) 内のセキュリティー・オブジェクト {2} に対するロール {1} の許可 ([{5}={6}] [デフォルト={7}]) の設定に失敗しました。
ru: Пользователю {0} не удалось задать разрешения для роли {1} на доступ к объекту защиты {2} в экземпляре {3} в домене {4} [{5}={6}] [по умолчанию={7}] из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法设置角色 {1} 对域 {4} 实例 {3} 中的安全对象 {2} 的许可权 [{5}={6}] [缺省值为 {7}]。

# CDISA5352E
source: Resource specification count must be a positive number.
de: Die Anzahl der Ressourcenspezifikationen muss eine positive Zahl sein.
ja: リソース仕様カウントは正数でなければなりません。
ru: Число спецификаций ресурсов должно быть положительным числом.
zh_cn: 资源规范计数必须是正数。

# CDISA5353E
source: Unexpected error validating value for property: {0}.
de: Unerwarteter Fehler beim Validieren eines Werts für Eigenschaft: {0}.
ja: 次のプロパティーの値の検証中に予期しないエラーが発生しました: {0}。
ru: Неожиданная ошибка при проверке значения для свойства: {0}.
zh_cn: 验证属性 {0} 的值时发生意外错误。

# CDISA5354E
source: Internal error - value: {0} is unexpected for property: {1}.
de: Interner Fehler - der Wert {0} wird für Eigenschaft {1} nicht erwartet.
ja: 内部エラー - 次のプロパティーでは値 {0} は予期されていません: {1}。
ru: Внутренняя ошибка - значение {0} является неожиданным для свойства {1}.
zh_cn: 内部错误 - 值 {0} 不是属性 {1} 的预期值。

# CDISA5355E
source: Internal error - value type: {0} is unexpected for property: {1}.
de: Interner Fehler - der Werttyp {0} wird für Eigenschaft {1} nicht erwartet.
ja: 内部エラー - 次のプロパティーでは値タイプ {0} は予期されていません: {1}。
ru: Внутренняя ошибка - тип значения {0} является неожиданным для свойства {1}.
zh_cn: 内部错误 - 值类型 {0} 不是属性 {1} 的预期值。

# CDISA5356E
source: Unable to access validator: {0} for property: {1}.
de: Auf den Validator {0} für Eigenschaft {1} kann nicht zugegriffen werden.
ja: 次のプロパティーのバリデーター {0} にアクセスできません: {1}。
ru: Не удается получить доступ к функции проверки {0} для свойства {1}.
zh_cn: 无法访问 {1} 属性的验证器 {0}。

# CDISA5357E
source: The following custom resource manager command does not have the correct format: {0}.
de: Der folgende angepasste Ressourcenmanagerbefehl hat nicht das korrekte Format: {0}.
ja: 次のカスタム・リソース・マネージャー・コマンドのフォーマットは正しくありません: {0}。
ru: У указанной ниже пользовательской команды менеджера ресурсов неправильный формат: {0}.
zh_cn: 以下定制资源管理器命令的格式不正确：{0}。

# CDISA5358E
source: The resource package cannot be created because the {0} file is missing from the installation.
de: Das Ressourcenpaket kann nicht erstellt werden, da die Datei {0} in der Installation fehlt.
ja: {0} ファイルがインストール済み環境で欠落しているため、リソース・パッケージを作成できません。
ru: Не удается создать пакет ресурсов, так как файл {0} отсутствует в установке.
zh_cn: 无法创建资源软件包，这是因为安装中缺少 {0} 文件。

# CDISA5359E
source: An error occurred creating the resource package. The error is: {0}
de: Beim Erstellen des Ressourcenpakets ist ein Fehler aufgetreten. Fehler: {0}
ja: リソース・パッケージの作成中にエラーが発生しました。エラー: {0}
ru: Произошла ошибка при создании пакета ресурсов. Ошибка: {0}
zh_cn: 创建资源软件包时发生错误。错误为：{0}

# CDISA5360E
source: Contents of specified application bundle {0} is not in the correct format.
de: Der Inhalt des angegebenen Anwendungsbundles {0} hat nicht das korrekte Format.
ja: 指定されたアプリケーション・バンドル {0} の内容のフォーマットが正しくありません。
ru: Содержимое указанного пакета приложений {0} представлено в неправильном формате.
zh_cn: 所指定应用程序捆绑包 {0} 的内容的格式不正确。

# CDISA5361E
source: The request cannot be completed because resource tag {0} has a custom defintion format.
de: Die Anforderung kann nicht abgeschlossen werden, da der Ressourcentag {0} ein angepasstes Definitionsformat hat.
ja: リソース・タグ {0} のフォーマットがカスタム定義であるため、要求を完了できません。
ru: Не удается выполнить требование, так как у тега ресурса {0} пользовательский формат определения.
zh_cn: 无法完成此请求，这是因为资源标记 {0} 具有定制定义格式。

# CDISA5362E
source: Cannot retrieve the following write-only property value: {0}.
de: Der folgende Nur-Schreiben-Eigenschaftswert kann nicht abgerufen werden: {0}.
ja: 次の書き込み専用プロパティー値を取得できません: {0}。
ru: Не удается получить следующее значение свойства, доступного только для записи: {0}.
zh_cn: 无法检索以下只写属性值：{0}。

# CDISA5363E
source: The {0} file storage directory could not be created on the {1} resource by the following user: {2}.
de: Der folgende Benutzer konnte das Dateispeicherverzeichnis {0} in der Ressource {1} nicht erstellen: {2}.
ja: 次のユーザーによって {1} リソースで {0} ファイル・ストレージ・ディレクトリーを作成できませんでした: {2}。
ru: Указанному ниже пользователю не удалось создать каталог хранения файлов {0} на ресурсе {1}: {2}.
zh_cn: {2} 用户无法在 {1} 资源上创建 {0} 文件存储目录。

# CDISA5364E
source: The JMX service is not available.
de: Der JMX-Service ist nicht verfügbar.
ja: JMX サービスが使用可能でありません。
ru: Служба JMX недоступна.
zh_cn: JMX 服务不可用。

# CDISA5365E
source: The connection to the JMX service was refused. The JMX service is not available.
de: Die Verbindung zum JMX-Service wurde verweigert. Der JMX-Service ist nicht verfügbar.
ja: JMX サービスへの接続が拒否されました。JMX サービスが使用可能でありません。
ru: Соединение со службой JMX отклонено. Служба JMX недоступна.
zh_cn: 已拒绝与 JMX 服务的连接。JMX 服务不可用。

# CDISA5366E
source: The LDAP administration user password is required when LDAP administration user ID is specified.
de: Das LDAP-Verwaltungsbenutzerkennwort ist erforderlich, wenn eine LDAP-Verwaltungsbenutzer-ID angegeben wird.
ja: LDAP 管理ユーザー ID を指定した場合、LDAP 管理ユーザー・パスワードは必須です。
ru: Если задан ID пользователя-администратора LDAP, требуется пароль пользователя-администратора LDAP.
zh_cn: 指定了 LDAP 管理用户标识时，LDAP 管理用户密码是必需项。

# CDISA5367E
source: The LDAP administration user ID is required when LDAP administration user password is specified.
de: Die LDAP-Verwaltungsbenutzer-ID ist erforderlich, wenn ein LDAP-Verwaltungsbenutzerkennwort angegeben wird.
ja: LDAP 管理ユーザー・パスワードを指定した場合、LDAP 管理ユーザー ID は必須です。
ru: Если задан пароль пользователя-администратора LDAP, требуется ID пользователя-администратора LDAP.
zh_cn: 指定了 LDAP 管理用户密码时，LDAP 管理用户标识是必需项。

# CDISA5368E
source: LDAP user secondary lookup query must be set when specifying LDAP administration user ID and LDAP administration user password.
de: Eine sekundäre Lookup-Abfrage für LDAP-Benutzer muss festgelegt sein, wenn eine LDAP-Verwaltungsbenutzer-ID und ein LDAP-Verwaltungsbenutzerkennwort angegeben werden.
ja: LDAP 管理ユーザー ID および LDAP 管理ユーザー・パスワードを指定する場合、LDAP ユーザー 2 次ルックアップ照会を設定する必要があります。
ru: Задавая ID LDAP пользователя-администратора LDAP и пароль пользователя-администратора LDAP, нужно задать запрос вторичного поиска пользователя LDAP.
zh_cn: 指定 LDAP 管理用户标识和 LDAP 管理用户密码时，必须设置 LDAP 用户辅助查找查询。

# CDISA5369E
source: Cannot perform operation because instance is running with an incompatible version of Streams.
de: Eine Operation kann nicht ausgeführt werden, da eine Instanz mit einer inkompatiblen Version von Streams ausgeführt wird.
ja: 非互換バージョンの Streams でインスタンスが実行されているため、操作を実行できません。
ru: Не удается выполнить операцию, так как экземпляр работает с несовместимой версией Streams.
zh_cn: 无法执行操作，这是因为实例正在与不兼容的 Streams 版本一起运行。

# CDISA5370E
source: The Domain Manager application is not supported on this system.
de: Die Domänenmanageranwendung wird auf diesem System nicht unterstützt.
ja: このシステムではドメイン・マネージャー・アプリケーションはサポートされません。
ru: Приложение менеджера домена не поддерживается в этой системе.
zh_cn: 此系统上不支持“域管理器”应用程序。

# CDISA5371I
source: Application {0} job ID {1} has been registered with governance server {2}.
de: Die Anwendung {0} mit der Job-ID {1} wurde beim Governance-Server {2} registriert.
ja: アプリケーション {0} (ジョブ ID {1}) がガバナンス・サーバー {2} に登録されました。
ru: ID задания {1} приложения {0} зарегистрирован на сервере регулировки {2}.
zh_cn: 已向管控服务器 {2} 注册应用程序 {0} 作业标识 {1}。

# CDISA5372E
source: Failed to register application {0} job ID {1} with governance server {2}. HTTP response code: {3}
de: Die Anwendung {0} mit der Job-ID {1} konnte nicht beim Governance-Server {2} registriert werden. HTTP-Antwortcode: {3}
ja: ガバナンス・サーバー {2} へのアプリケーション {0} (ジョブ ID {1}) の登録に失敗しました。HTTP 応答コード: {3}
ru: Не удалось зарегистрировать ID задания {1} приложения {0} на сервере регулировки {2}. Код ответа HTTP: {3}
zh_cn: 无法向管控服务器 {2} 注册应用程序 {0} 作业标识 {1}。HTTP 响应码：{3}

# CDISA5373E
source: Failed to register application {0} job ID {1} with governance server {2}. Cause: {3}
de: Die Anwendung {0} mit der Job-ID {1} konnte nicht beim Governance-Server {2} registriert werden. Ursache: {3}
ja: ガバナンス・サーバー {2} へのアプリケーション {0} (ジョブ ID {1}) の登録に失敗しました。原因: {3}
ru: Не удалось зарегистрировать ID задания {1} приложения {0} на сервере регулировки {2}. Причина: {3}
zh_cn: 无法向管控服务器 {2} 注册应用程序 {0} 作业标识 {1}。原因：{3}

# CDISA5374E
source: Governance URL is not set for instance {0}.
de: Die Governance-URL ist für die Instanz {0} nicht festgelegt.
ja: インスタンス {0} のガバナンス URL が設定されていません。
ru: URL регулировки не задан для экземпляра {0}.
zh_cn: 未设置实例 {0} 的管控 URL。

# CDISA5375E
source: Governance URL {0} is not properly formed for instance {1}.
de: Die Governance-URL {0} ist nicht ordnungsgemäß für die Instanz {1} formatiert.
ja: インスタンス {1} のガバナンス URL {0} の形式が適切でありません。
ru: URL регулировки {0} неправильно сформатирован для экземпляра {1}.
zh_cn: 实例 {1} 的管控 URL {0} 的格式不正确。

# CDISA5376E
source: Failed to register job ID {0} for instance {1}. Cause: {2}
de: Die Job-ID {0} konnte für die Instanz {1} nicht registriert werden. Ursache: {2}
ja: インスタンス {1} のジョブ ID {0} の登録に失敗しました。原因: {2}
ru: Не удалось зарегистрировать ID задания {0} для экземпляра {1}. Причина: {2}
zh_cn: 无法注册实例 {1} 的作业标识 {0}。原因：{2}
