Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsRuntimeMessages_*.xlf
Languages: ko, pt_br

# CDISR3221E
source: The following inPoolIndex value for the {1} operator is not valid: {0}. This value is not allowed or is too large for the hostpool.
ko: {1} 연산자의 inPoolIndex 값 {0}이(가) 유효하지 않습니다. 이 값은 허용되지 않거나 호스트 풀에 대해 지나치게 큽니다.
pt_br: O valor de inPoolIndex a seguir para o operador {1} não é válido: {0}. Esse valor não é permitido ou é muito grande para o conjunto de hosts.

# CDISR3222E
source: The {0} value is not valid for the {1} attribute. This attribute is in the following section: {2}.
ko: {1} 속성에 대해 {0} 값이 유효하지 않습니다. 이 속성은 {2} 섹션에 있습니다.
pt_br: O valor {0} não é válido para o atributo {1}. Esse atributo está na seguinte seção: {2}.

# CDISR3223E
source: Both the {0} attribute and the {1} attribute are not allowed in the following section: {2}.
ko: {0} 속성과 {1} 속성이 {2} 섹션에서 허용되지 않습니다.
pt_br: O atributo {0} e o atributo {1} não são permitidos na seção a seguir: {2}.

# CDISR3224E
source: The {0} attribute must be specified for the following information: {1} and {2}.
ko: 정보 {1} 및 {2}에 {0} 속성을 지정해야 합니다.
pt_br: O atributo {0} deve ser especificado para as informações a seguir: {1} e {2}.

# CDISR3225E
source: The {0} constraint cannot be applied to the following operator: {1}.
ko: {0} 제한조건을 {1} 연산자에 적용할 수 없습니다.
pt_br: A restrição {0} não pode ser aplicada ao operador a seguir: {1}.

# CDISR3226I
source: A processing element will be created from the following operator set: {0}. This processing element will be placed on the {2} host and have the following host tagging requirements: {1}.
ko: 연산자 세트 {0}에서 처리 요소를 작성합니다. 이 처리 요소는 {2} 호스트에 배치되며 호스트 태그 지정 요구사항 {1}을(를) 포함합니다.
pt_br: Um elemento de processamento será criado a partir do seguinte conjunto de operadores: {0}. Esse elemento de processamento será colocado no host {2} e tem os requisitos de identificação de host a seguir: {1}.

# CDISR3227I
source: A processing element will be created from the following operator set: {0}. This processing element will be placed on the {3} host and have the following host tagging requirements: {2}. The candidate hosts are: {1}.
ko: 연산자 세트 {0}에서 처리 요소를 작성합니다. 이 처리 요소는 {3} 호스트에 배치되며 호스트 태그 지정 요구사항 {2}을(를) 포함합니다. 후보 호스트는 {1}입니다.
pt_br: Um elemento de processamento será criado a partir do seguinte conjunto de operadores: {0}. Esse elemento de processamento será colocado no host {3} e tem os requisitos de identificação de host a seguir: {2}. Os hosts candidatos são: {1}.

# CDISR3228I
source: The {0} operator has the following attributes: {1}.
ko: {0} 연산자에 {1} 속성이 있습니다.
pt_br: O operador {0} tem os atributos a seguir: {1}.

# CDISR3229I
source: A {0} group is defined for the following operators: {1}.
ko: {1} 연산자에 대한 {0} 그룹이 정의되어 있습니다.
pt_br: Um grupo {0} é definido para os operadores a seguir: {1}.

# CDISR3230I
source: A hostpool is defined with the following operators: {0}. The operator attributes are: {1}.
ko: 호스트 풀이 다음 연산자를 사용하여 정의되었습니다: {0}. 연산자 속성은 {1}입니다.
pt_br: Um conjunto de hosts é definido com os seguintes operadores: {0}. Os atributos do operador são: {1}.

# CDISR3231E
source: Operators that have hostIsolation specified cannot be fused with operators that have hostColocation specified.
ko: hostIsolation이 지정된 연산자를 hostColocation이 지정된 연산자와 결합할 수 없습니다.
pt_br: Operadores que têm hostIsolation especificado não podem ser fundidos com operadores que têm hostColocation especificado.

# CDISR3232E
source: The operation failed because the {0} operator name is not known for this application.
ko: {0} 연산자 이름이 이 애플리케이션에 알려져 있지 않기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque o nome do operador {0} não é conhecido para esse aplicativo.

# CDISR3233E
source: The operation failed because the job submission configuration is not valid.
ko: 작업 제출 구성이 유효하지 않기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque a configuração de envio de tarefa não é válida.

# CDISR3234E
source: The operation failed because the {0} operator is specified more than once in the {1} section.
ko: {1} 섹션에서 {0} 연산자가 두 번 이상 지정되었기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque o operador {0} está especificado mais de uma vez na seção {1}.

# CDISR3235E
source: The operation failed because the required {0} keyword is missing in the {1} section.
ko: {1} 섹션에서 필수 {0} 키워드가 누락되었기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque a palavra-chave {0} necessária está ausente na seção {1}.

# CDISR3236E
source: The operation failed because a JSON error was detected when parsing the job configuration overlay file. Cause: {0} Job configuration overlay: {1}
ko: 작업 구성 겹쳐쓰기 파일을 구문 분석하는 중에 JSON 오류가 발견되었기 때문에 조작이 실패했습니다. 원인: {0} 작업 구성 겹쳐쓰기: {1}
pt_br: A operação falhou porque um erro de JSON foi detectado durante a análise sintática do arquivo de sobreposição de configuração de tarefa. Causa: {0} Sobreposição de configuração de tarefa: {1}

# CDISR3237E
source: The operation failed because the following pool placement group name is not valid: {0}. The group name cannot use the IBM Streams reserved prefix of STREAMS_HP.
ko: 풀 배치 그룹 이름 {0}이(가) 유효하지 않기 때문에 조작이 실패했습니다. 그룹 이름이 IBM Streams 예약 접두부 STREAMS_HP를 사용할 수 없습니다.
pt_br: A operação falhou porque o nome do grupo de posicionamento de conjunto a seguir não é válido: {0}. O nome do grupo não pode usar o prefixo reservado de STREAMS_HP do IBM Streams.

# CDISR3238I
source: The {0} operator has related constraints because it is host co-located with one or more of the target operators. The constraints are: {1}.
ko: {0} 연산자가 하나 이상의 대상 연산자와 함께 배치되었으므로 이 연산자에 관련 제한조건이 있습니다. 제한조건은 {1}입니다.
pt_br: O operador {0} tem restrições relacionadas porque está localizado juntamente com o host com um ou mais dos operadores de destino. As restrições são: {1}.

# CDISR3239E
source: Operator group {0} of type {1} contains the following operators that are not members of the set of target operators: {2}.
ko: {1} 유형의 연산자 그룹 {0}에 대상 연산자 세트의 멤버가 아닌 {2} 연산자가 있습니다.
pt_br: O grupo do operador {0} do tipo {1} contém os seguintes operadores que não são membros do conjunto de operadores de destino: {2}.

# CDISR3240E
source: The following operators were specified that are not members of the set of target operators: {0}.
ko: 대상 연산자 세트의 멤버가 아닌 연산자({0})가 지정되었습니다.
pt_br: Os operadores a seguir especificados não são membros do conjunto de operadores de destino: {0}.

# CDISR3241E
source: The {0} fields are not allowed to be specified in the JobConfigurationOverlay for a updateOperators operation.
ko: {0} 필드는 updateOperators 조작을 위한 JobConfigurationOverlay에 지정하도록 허용되지 않습니다.
pt_br: Não é permitido que os campos {0} sejam especificados no JobConfigurationOverlay para uma operação updateOperators.

# CDISR3242E
source: Resources for job {0} are not able to be made more exclusive because they are currently being shared by the following jobs: {1}.
ko: {0} 작업을 위한 자원은 현재 {1} 작업과 공유되고 있기 때문에 더 독점적으로 설정할 수 없습니다.
pt_br: Os recursos para a tarefa {0} não podem ser tornar mais exclusivos porque eles estão sendo compartilhados atualmente pelas tarefas a seguir: {1}.

# CDISR3243E
source: The following resources {0} were not able to be removed from job {1} because they are not currently assigned to the job.
ko: {0} 자원은 현재 {1} 작업에 지정되어 있지 않기 때문에 해당 작업에서 제거할 수 없습니다.
pt_br: Os recursos a seguir {0} não puderam ser removidos da tarefa {1} porque eles não estão atualmente designados à tarefa.

# CDISR3244W
source: A resource with the following tagging requirement was requested but was not able to be satisfied: {0}.
ko: 태그 지정 요구사항이 {0}인 자원이 요청되었지만 충족시킬 수 없었습니다.
pt_br: Um recurso com o requisito de identificação a seguir foi solicitado, mas não pôde ser satisfeito: {0}.

# CDISR3245W
source: Only {0} of the {1} requested resources was able to be fullfilled. The tagging requirement that was requested was: {2}.
ko: 요청된 자원 {1}개 중 {0}개만 충족시킬 수 있었습니다. 요청된 태그 지정 요구사항은 {2}입니다.
pt_br: Somente {0} dos recursos solicitados {1} puderam ser preenchidos. O requisito de identificação solicitado foi: {2}.

# CDISR3246E
source: The operation failed because there are multiple adjustment subsections specified in the {0} section of the job configuration overlay.
ko: 작업 구성 겹쳐쓰기의 {0} 섹션에 복수의 조정 서브섹션이 지정되어 있기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque há múltiplas subseções de ajuste especificadas na seção {0} da sobreposição de configuração de tarefa.

# CDISR3247I
source: The user request for {0} new resources was truncated to {1} as this is the limit of resources usable by the job.
ko: 작업에서 사용 가능한 자원의 한계로 인해 {0}개의 새 자원에 대한 사용자 요청이 {1}개로 잘렸습니다.
pt_br: A solicitação do usuário para {0} novos recursos foi truncada para {1} como este é o limite de recursos utilizáveis pela tarefa.

# CDISR3248I
source: The following resources were released from the job {0} because they are not currently hosting any Processing Elements {1}.
ko: 현재 처리 요소를 호스팅하고 있지 않기 때문에 {0} 작업에서 {1} 자원이 해제되었습니다.
pt_br: Os recursos a seguir foram liberados da tarefa {0} porque eles não estão atualmente hospedando nenhum Elemento de processamento {1}.

# CDISR3249E
source: Explicit hosts are not allowed to be specified when instance has applicationResourceAllocationMode property set to job.
ko: 인스턴스의 applicationResourceAllocationMode 특성이 job으로 설정된 경우에는 명시적 호스트를 지정할 수 없습니다.
pt_br: Hosts explícitos não podem ser especificados quando a instância possui a propriedade applicationResourceAllocationMode configurada como job.

# CDISR3250W
source: The behavior for the {0} instance property has changed in the {1} release and may require adjustments to the configuration of the instance to maintain similar behavior.
ko: {0} 인스턴스 특성의 동작이 {1} 릴리스에서 변경되었으므로 유사한 동작을 유지하기 위해 인스턴스의 구성을 조정해야 할 수도 있습니다.
pt_br: O comportamento para a propriedade da instância {0} mudou na liberação {1} e pode requerer ajustes na configuração da instância para manter o comportamento semelhante.

# CDISR3500E
source: The service of the processing element container for processing element ID {0} was forced to shut down because the typical shut down operation for the processing element application did not succeed.
ko: 처리 요소 애플리케이션에 대한 일반 종료 조작에 실패했으므로 처리 요소 ID {0}에 대한 처리 요소 컨테이너의 서비스를 강제 종료했습니다.
pt_br: O serviço do contêiner de elemento de processamento para o ID de elemento de processamento {0} foi forçado a encerrar porque a operação de encerramento típica para a aplicação do elemento de processamento não foi bem-sucedida.

# CDISR3501E
source: The service of the processing element container for processing element ID {0} was forced to shut down because the typical shut down operation for the service of the processing container did not succeed.
ko: 처리 컨테이너의 서비스에 대한 일반 종료 조작에 실패했으므로 처리 요소 ID {0}에 대한 처리 요소 컨테이너의 서비스를 강제 종료했습니다.
pt_br: O serviço do contêiner de elemento de processamento para o ID de elemento de processamento {0} foi forçado a encerrar porque a operação de encerramento típica para o serviço do contêiner de processo não foi bem-sucedida.

# CDISR3502E
source: The Controller service failed to run setcap command for processing element ID {0}. The error is: {1}.
ko: 제어기 서비스가 처리 요소 ID {0}에 대한 setcap 명령을 실행하는 데 실패했습니다. 오류는 {1}입니다.
pt_br: O serviço do controlador falhou ao executar o comando setcap para o ID do elemento de processamento {0}. O erro é: {1}.

# CDISR3503E
source: The Controller service cannot start the following processing element ID: {0}. The error is: {1}.
ko: 제어기 서비스가 처리 요소 ID {0}을(를) 시작할 수 없습니다. 오류는 {1}입니다.
pt_br: O serviço do controlador não pode iniciar o seguinte ID de elemento de processamento: {0}. O erro é: {1}.

# CDISR3504E
source: Processing element ID {0} in the {1} instance is already running.
ko: {1} 인스턴스의 처리 요소 ID {0}이(가) 이미 실행 중입니다.
pt_br: O ID do elemento de processamento {0} na instância {1} já está em execução.

# CDISR3505E
source: Processing element ID {0} in the {1} instance is already stopped.
ko: {1} 인스턴스의 처리 요소 ID {0}을(를) 이미 중지했습니다.
pt_br: O ID do elemento de processamento {0} na instância {1} já foi interrompido.

# CDISR3506E
source: The processing element logs for job ID {0} cannot be deleted. This job is in the {1} instance.
ko: 작업 ID {0}의 처리 요소 로그를 삭제할 수 없습니다. 이 작업은 {1} 인스턴스에 있습니다.
pt_br: Os logs do elemento de processamento para o ID da tarefa {0} não podem ser excluídos. Essa tarefa está na instância {1}.

# CDISR3700W
source: The Host Controller service cannot contact the Streams Application Manager. The error is: {0}.
ko: 호스트 제어기 서비스가 Streams Application Manager에 접속할 수 없습니다. 오류는 {0}입니다.
pt_br: O serviço do controlador de host não pode entrar em contato com o Streams Application Manager. O erro é: {0}.

# CDISR3702W
source: The Host Controller service cannot contact the Streams Resource Manager. The error is: {0}.
ko: 호스트 제어기 서비스가 Streams Resource Manager에 접속할 수 없습니다. 오류는 {0}입니다.
pt_br: O serviço do controlador de host não pode entrar em contato com o Streams Resource Manager. O erro é: {0}.

# CDISR3704W
source: Data directory {0} for PE {1} of job {2} does not exist.
ko: {2} 작업의 {1} PE에 대한 데이터 디렉토리 {0}이(가) 없습니다.
pt_br: Diretório de dados {0} para o PE {1} da tarefa {2} não existe.

# CDISR3800I
source: The {0} Host Controller service was started.
ko: {0} 호스트 제어기 서비스를 시작했습니다.
pt_br: O serviço do controlador de host {0} foi iniciado.

# CDISR3802I
source: The processing element ID {0} of the {1} job with ID {2} was started on the {3} host by the {4} user with process ID {5}, it is running with Streams release {6}.
ko: {4} 사용자가 {3} 호스트에서 프로세스 ID {5}을(를) 사용하여 ID가 {2}인 {1} 작업의 처리 요소 ID {0}을(를) 시작했습니다. 이 처리 요소 ID는 Streams 릴리스 {6}에서 실행 중입니다.
pt_br: O ID de elemento de processamento {0} da tarefa {1} com ID {2} foi iniciado no host {3} pelo usuário {4} com o ID do processo {5}, ele está em execução com a liberação do Streams {6}.

# CDISR3803I
source: The processing element ID {0} of the {1} job which ran with process ID {2} was stopped on the {3} host.
ko: 프로세스 ID {2}(으)로 실행된 {1} 작업의 처리 요소 ID {0}을(를) {3} 호스트에서 중지했습니다.
pt_br: O ID do elemento de processamento {0} da tarefa {1} que foi executada com o ID do processo {2} foi interrompido no host {3}.

# CDISR4000E
source: The processing element ID {0} of the {1} job with job ID {2} was submitted by the {3} user, and then was shut down unexpectedly. The error is: {4}.
ko: 작업 ID가 {2}인 {1} 작업의 처리 요소 ID {0}이(가) {3} 사용자에 의해 제출되었으며 예상치 않게 종료되었습니다. 오류는 {4}입니다.
pt_br: O ID do elemento de processamento {0} da tarefa {1} com o ID da tarefa {2} foi enviado pelo usuário {3} e, depois, encerrado inesperadamente. O erro é: {4}.

# CDISR4001E
source: Processing element ID {0} started but then failed with the following error: {1}.
ko: 처리 요소 ID {0}이(가) 시작되었지만 실패했으며 {1} 오류가 발생했습니다.
pt_br: O ID do elemento de processamento {0} foi iniciado, mas depois falhou com o erro a seguir: {1}.

# CDISR4200W
source: The service of the processing element container for processing element ID {0} cannot contact the Controller service. The error is: {1}.
ko: 처리 요소 ID {0}에 대한 처리 요소 컨테이너의 서비스가 제어기 서비스에 접속할 수 없습니다. 오류는 {1}입니다.
pt_br: O serviço do contêiner de elemento de processamento para o ID de elemento de processamento {0} não pode contatar o serviço do controlador. O erro é: {1}.

# CDISR4302I
source: Processing element ID {0} was shut down. The latest metrics are: nCpuMilliseconds={1}, nMemoryConsumption={2}.
ko: 처리 요소 ID {0}이(가) 종료되었습니다. 최신 메트릭은 nCpuMilliseconds={1}, nMemoryConsumption={2}입니다.
pt_br: O ID do elemento de processamento {0} foi encerrado. As métricas mais recentes são: nCpuMilliseconds={1}, nMemoryConsumption={2}.

# CDISR4303I
source: The tracing configuration for the processing element ID {0} was updated to a value of {1}.
ko: 처리 요소 ID {0}에 대한 추적 구성을 {1} 값으로 갱신했습니다.
pt_br: A configuração de rastreio para o ID do elemento de processamento {0} foi atualizada para um valor de {1}.

# CDISR4304I
source: The log level for the processing element ID {0} was updated to a value of {1}.
ko: 처리 요소 ID {0}에 대한 로그 레벨을 {1} 값으로 갱신했습니다.
pt_br: O nível de log para o ID do elemento de processamento {0} foi atualizado para um valor de {1}.

# CDISR4307I
source: The processing element ID {0} of the {1} job with job ID {2} was submitted by the {3} user, and has shut down.
ko: 작업 ID가 {2}인 {1} 작업의 처리 요소 ID {0}이(가) {3} 사용자에 의해 제출되었으며 종료되었습니다.
pt_br: O ID do elemento de processamento {0} da tarefa {1} com ID de tarefa {2} foi enviado pelo usuário {3} e encerrado.

# CDISR4308E
source: The processing element ID {0} was shut down because of an unexpected error. The error is: {1}.
ko: 예기치 않은 오류로 인해 처리 요소 ID {0}이(가) 종료되었습니다. 오류는 {1}입니다.
pt_br: O ID do elemento de processamento {0} foi encerrado devido a um erro inesperado. O erro é: {1}.

# CDISR4309I
source: The properties of the {0} application configuration for the following processing element ID are updated: {1}. The updated property values are {2}.
ko: 처리 요소 ID {1}에 대한 {0} 애플리케이션 구성의 특성을 갱신했습니다. 갱신한 특성 값은 {2}입니다.
pt_br: As propriedades da configuração de aplicativo {0} para o ID do elemento de processamento a seguir são atualizadas: {1}. Os valores de propriedade atualizados são {2}.

# CDISR4310I
source: The properties of the {0} application configuration for the following processing element ID were removed: {1}.
ko: 처리 요소 ID {1}에 대한 {0} 애플리케이션 구성의 특성을 제거했습니다.
pt_br: As propriedades da configuração de aplicativo {0} para o ID do elemento de processamento a seguir foram removidas: {1}.

# CDISR4311E
source: Application bundle {0} failed to deploy on resource {1}. Cause: {2}
ko: 애플리케이션 번들 {0}을(를) {1} 자원에 배치하는 데 실패했습니다. 원인: {2}
pt_br: O pacote configurável do aplicativo {0} falhou ao ser implementado no recurso {1}. Causa: {2}

# CDISR4312E
source: Failed to deploy application on resource {0}. Missing application bundle ID in download request.
ko: 애플리케이션을 {0} 자원에 배치하는 데 실패했습니다. 다운로드 요청에서 애플리케이션 번들 ID가 누락되었습니다.
pt_br: Falha ao implementar o aplicativo no recurso {0}. O ID de pacote configurável do aplicativo está ausente na solicitação de download.

# CDISR4313E
source: Application bundle {0} failed to deploy on resource {1}. The bundle is not installed in the domain.
ko: 애플리케이션 번들 {0}을(를) {1} 자원에 배치하는 데 실패했습니다. 해당 도메인에 해당 번들이 설치되어 있지 않습니다.
pt_br: O pacote configurável do aplicativo {0} falhou ao ser implementado no recurso {1}. O pacote configurável não está instalado no domínio.

# CDISR4314E
source: Failed to install and register application bundle {0} on resource {1}. Cause: {2}
ko: 애플리케이션 번들 {0}을(를) {1} 자원에 설치 및 등록하는 데 실패했습니다. 원인: {2}
pt_br: Falha ao instalar e registrar o pacote configurável do aplicativo {0} no recurso {1}. Causa: {2}

# CDISR4315E
source: Failed to download application bundle {0} on resource {1}. Failed resources: {2}
ko: 애플리케이션 번들 {0}을(를) {1} 자원에 다운로드하는 데 실패했습니다. 실패한 자원: {2}
pt_br: Falha ao fazer download do pacote configurável do aplicativo {0} no recurso {1}. Recursos com falha: {2}

# CDISR4316E
source: Failed to clean up application storage on resource {0}. Cause: {1}
ko: {0} 자원에서 애플리케이션 스토리지를 제거하는 데 실패했습니다. 원인: {1}
pt_br: Falha ao limpar o armazenamento do aplicativo no recurso {0}. Causa: {1}

# CDISR4317E
source: Download request for {0} from resource {1} to resource {2} failed. Cause: {3}
ko: {1} 자원에서 {2} 자원으로 {0}을(를) 다운로드하는 요청이 실패했습니다. 원인: {3}
pt_br: A solicitação de download para {0} do recurso {1} para o recurso {2} falhou. Causa: {3}

# CDISR4318E
source: Failed to prepare invocation directory for job {0} PE {1} on resource {2}. Cause: {3}
ko: {2} 자원에서 {0} 작업 {1} PE의 호출 디렉토리를 준비하는 데 실패했습니다. 원인: {3}
pt_br: Falha ao preparar o diretório de chamada para a tarefa {0} PE {1} no recurso {2}. Causa: {3}

# CDISR4319E
source: Failed to install application ID {0} on resource {1}. Cause: {2}
ko: 애플리케이션 ID {0}을(를) {1} 자원에 설치하는 데 실패했습니다. 원인: {2}
pt_br: Falha ao instalar o ID do aplicativo {0} no recurso {1}. Causa: {2}

# CDISR4320E
source: Failed to install application ID {0} on resource {1}.
ko: 애플리케이션 ID {0}을(를) {1} 자원에 설치하는 데 실패했습니다.
pt_br: Falha ao instalar o ID do aplicativo {0} no recurso {1}.

# CDISR4321E
source: Failed to unpack application bundle {0} on resource {1}. Cause: {2}
ko: 애플리케이션 번들 {0}을(를) {1} 자원에 압축 해제하는 데 실패했습니다. 원인: {2}
pt_br: Falha ao descompactar o pacote configurável do aplicativo {0} no recurso {1}. Causa: {2}

# CDISR4322E
source: Failed to prepare working directory for job {0} while trying to deploy application on resource {1}. Cause: {2}
ko: 애플리케이션을 {1} 자원에 배치하려고 시도하는 중에 {0} 작업의 작업 디렉토리를 준비하는 데 실패했습니다. 원인: {2}
pt_br: Falha ao preparar o diretório ativo para a tarefa {0} ao tentar implementar o aplicativo no recurso {1}. Causa: {2}

# CDISR4323E
source: Failed to prepare working directory for job {0} while trying to deploy application on resource {1}.
ko: 애플리케이션을 {1} 자원에 배치하려고 시도하는 중에 {0} 작업의 작업 디렉토리를 준비하는 데 실패했습니다.
pt_br: Falha ao preparar o diretório ativo para a tarefa {0} ao tentar implementar o aplicativo no recurso {1}.

# CDISR4324E
source: Failed to prepare application landing zone directory while trying to deploy application on resource {0}. Cause: {1}
ko: 애플리케이션을 {0} 자원에 배치하려고 시도하는 중에 애플리케이션 배치 구역 디렉토리를 준비하는 데 실패했습니다. 원인: {1}
pt_br: Falha ao preparar o diretório de zona de entrada do aplicativo ao tentar implementar o aplicativo no recurso {0}. Causa: {1}

# CDISR6000E
source: An unexpected error occurred in the following resource manager: {0}.
ko: {0} 자원 관리자에서 예기치 않은 오류가 발생했습니다.
pt_br: Ocorreu um erro inesperado no seguinte gerenciador de recursos: {0}.

# CDISR6001E
source: An unexpected error occurred in the following resource manager: {0}. Error is: {1}.
ko: {0} 자원 관리자에서 예기치 않은 오류가 발생했습니다. 오류는 {1}입니다.
pt_br: Ocorreu um erro inesperado no seguinte gerenciador de recursos: {0}. O erro é: {1}.

# CDISR6002E
source: The {0} resource manager is not available.
ko: {0} 자원 관리자가 사용 불가능합니다.
pt_br: O gerenciador de recursos {0} não está disponível.

# CDISR6003E
source: The {0} resource manager is already running on host={1} port={2}.
ko: {0} 자원 관리자가 이미 호스트={1} 포트={2}에서 실행 중입니다.
pt_br: O gerenciador de recursos {0} já está em execução no host={1} porta={2}.

# CDISR6004E
source: The {0} resource manager does not support the following format for the {1} tag: {2}.
ko: {0} 자원 관리자가 {1} 태그의 {2} 형식을 지원하지 않습니다.
pt_br: O gerenciador de recursos {0} não suporta o seguinte formato para a tag {1}: {2}.

# CDISR6005E
source: The {0} resource manager does not support the following {1} tag attribute: {2}.
ko: {0} 자원 관리자가 {1} 태그 속성 {2}을(를) 지원하지 않습니다.
pt_br: O gerenciador de recursos {0} não suporta o seguinte atributo de tag {1}: {2}.

# CDISR6006E
source: The {0} resource manager does not support the ''{3}'' value for the following ''{1}'' tag attribute: {2}.
ko: {0} 자원 관리자가 ''{1}'' 태그 속성 {2}의 ''{3}'' 값을 지원하지 않습니다.
pt_br: O gerenciador de recursos {0} não suporta o valor ''{3}'' para o seguinte atributo de tag ''{1}'': {2}.

# CDISR6007E
source: The {0} resource manager requires a numeric value for the following ''{1}'' tag attribute: {2}. The ''{3}'' value is incorrect.
ko: {0} 자원 관리자에 ''{1}'' 태그 속성 {2}의 숫자 값이 필요합니다. ''{3}'' 값은 올바르지 않습니다.
pt_br: O gerenciador de recursos {0} requer um valor numérico para o seguinte atributo de tag ''{1}'': {2}. O valor ''{3}'' está incorreto.

# CDISR6008E
source: The {0} resource manager requires a string value for the following ''{1}'' tag attribute: {2}. The ''{3}'' value is incorrect.
ko: {0} 자원 관리자에 ''{1}'' 태그 속성 {2}의 문자열 값이 필요합니다. ''{3}'' 값은 올바르지 않습니다.
pt_br: O gerenciador de recursos {0} requer um valor de sequência para o seguinte atributo de tag ''{1}'': {2}. O valor ''{3}'' está incorreto.

# CDISR6009E
source: The ''{0}'' tag is not associated with the request.
ko: ''{0}'' 태그가 요청과 연결되어 있지 않습니다.
pt_br: A tag ''{0}'' não está associada à solicitação.

# CDISR6010E
source: The ''{0}'' tag definition was not defined using the ''{1}'' format.
ko: ''{1}'' 형식을 사용하여 ''{0}'' 태그 정의를 정의하지 않았습니다.
pt_br: A definição de tag ''{0}'' não foi definida usando o formato ''{1}''.

# CDISR6011E
source: The {0} resource manager could not complete the request. The error is: {1}.
ko: {0} 자원 관리자가 요청을 완료할 수 없습니다. 오류는 {1}입니다.
pt_br: O gerenciador de recursos {0} não pôde concluir a solicitação. O erro é: {1}.
