Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA0068I
source: Placing {0} copies of the {1} service on the following resource: {2}.
de: {0} Kopien des Service {1} werden in der folgenden Ressource verteilt: {2}.
ja: 次のリソース上に {1} サービスの {0} 個のコピーを配置中: {2}。
ru: Копии службы {1} в количестве {0} помещаются на следующий ресурс: {2}.
zh_cn: 正在将 {1} 服务的 {0} 个副本放置在 {2} 资源上。

# CDISA0069I
source: The following installation package was successfully created: {0}.
de: Das folgende Installationspaket wurde erfolgreich erstellt: {0}.
ja: 次のインストール・パッケージが正常に作成されました: {0}。
ru: Следующий пакет установки успешно создан: {0}.
zh_cn: 已成功创建安装软件包 {0}。

# CDISA0070I
source: Creating the following installation package: {0}.
de: Das folgende Installationspaket wird erstellt: {0}.
ja: 次のインストール・パッケージを作成中: {0}。
ru: Создается следующий пакет установки: {0}.
zh_cn: 正在创建安装软件包 {0}。

# CDISA0071I
source: The management API service or JMX service has the following URL: {0}.
de: Der Management-API-Service oder JMX-Service hat die folgende URL: {0}.
ja: 管理 API サービスまたは JMX サービスの URL は次のとおりです: {0}。
ru: У службы API управления или службы JMX следующий URL: {0}.
zh_cn: 管理 API 服务或 JMX 服务具有以下 URL：{0}。

# CDISA0072I
source: The Streams Console has the following URL: {0}.
de: Streams Console hat die folgende URL: {0}.
ja: Streams Console の URL は次のとおりです: {0}。
ru: У Streams Console следующий URL: {0}.
zh_cn: Streams Console 具有以下 URL：{0}。

# CDISA0073I
source: Logs were removed successfully from the {0} instance for the following domain: {1}.
de: Protokolle wurden erfolgreich aus der Instanz {0} für die folgende Domäne entfernt: {1}.
ja: 次のドメインの {0} インスタンスからログが正常に削除されました: {1}。
ru: Журналы успешно удалены из экземпляра {0} для следующего домена: {1}.
zh_cn: 已成功从 {1} 域的 {0} 实例中移除日志。

# CDISA0074I
source: Network communication has been restored to the {0} resource for the following domain: {1}.
de: Die Netzkommunikation wurde in der Ressource {0} für die folgende Domäne wiederhergestellt: {1}.
ja: ネットワーク通信が次のドメインの {0} リソースに復元されました: {1}。
ru: Сетевое взаимодействие восстановлено для ресурса {0} для следующего домена: {1}.
zh_cn: 已复原与 {1} 域的 {0} 资源的网络通信。

# CDISA0075I
source: The {0} service is running on the following resource: {1}. The service is running for the following domain: {2}.
de: Der Service {0} wird in der folgenden Ressource ausgeführt: {1}. Der Service wird für die folgende Domäne ausgeführt: {2}.
ja: 次のリソース上で {0} サービスが実行されています: {1}。サービスは次のドメイン用に実行されています: {2}。
ru: Служба {0} работает на ресурсе {1}. Служба работает для следующего домена: {2}.
zh_cn: {0} 服务正在 {1} 资源上运行。该服务是针对 {2} 域在运行。

# CDISA0076I
source: The {0} service is running on the following resource: {1}. The service is running in the {2} instance for the following domain: {3}.
de: Der Service {0} wird in der folgenden Ressource ausgeführt: {1}. Der Service wird in der Instanz {2} für die folgende Domäne ausgeführt: {3}.
ja: 次のリソース上で {0} サービスが実行されています: {1}。サービスは次のドメインの {2} インスタンスで実行されています: {3}。
ru: Служба {0} работает на ресурсе {1}. Служба работает на экземпляре {2} для следующего домена {3}.
zh_cn: {0} 服务正在 {1} 资源上运行。该服务正在 {3} 域的 {2} 实例中运行。

# CDISA0077I
source: Adding the {0} service to the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} wird der folgenden Ressource hinzugefügt: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: {0} サービスを次のリソースに追加中: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Добавляется служба {0} к следующему ресурсу: {1}. Ресурс выделен домену {2}.
zh_cn: 正在将 {0} 服务添加到 {1} 资源。该资源已分配到 {2} 域。

# CDISA0078I
source: Adding the {0} service to the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} wird der folgenden Ressource hinzugefügt: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} サービスを次のリソースに追加中: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Добавляется служба {0} к следующему ресурсу: {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 正在将 {0} 服务添加到 {1} 资源。该资源已分配到 {3} 域的 {2} 实例。

# CDISA0079I
source: Removing the {0} service from the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} wird aus der folgenden Ressource entfernt: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソースから {0} サービスを削除中: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Удаляется служба {0} к следующему ресурсу: {1}. Ресурс выделен домену {2}.
zh_cn: 正在从 {1} 资源中移除 {0} 服务。该资源已分配到 {2} 域。

# CDISA0080I
source: Removing the {0} service from the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} wird aus der folgenden Ressource entfernt: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: 次のリソースから {0} サービスを削除中: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Удаляется служба {0} к следующему ресурсу: {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 正在从 {1} 资源中移除 {0} 服务。该资源已分配到 {3} 域的 {2} 实例。

# CDISA0081I
source: Moving the {0} service to the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} wird in die folgende Ressource versetzt: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: {0} サービスを次のリソースに移動中: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Служба {0} перемещается на ресурс {1}. Ресурс выделен домену {2}.
zh_cn: 正在将 {0} 服务移动到 {1} 资源。该资源已分配到 {2} 域。

# CDISA0082I
source: Moving the {0} service to the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} wird in die folgende Ressource versetzt: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} サービスを次のリソースに移動中: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Служба {0} перемещается на ресурс {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 正在将 {0} 服务移动到 {1} 资源。该资源已分配到 {3} 域的 {2} 实例。

# CDISA0083I
source: Replacing the {0} dynamic resource with {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Die dynamische Ressource {0} wird durch {1} ersetzt. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} 動的リソースを {1} に置換中。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Динамический ресурс {0} заменяется на {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 正在将 {0} 动态资源替换为 {1}。该资源已分配到 {3} 域的 {2} 实例。

# CDISA0085I
source: The domain high availability count changed from {0} to {1} for the following domain: {2}.
de: Die Domänenhochverfügbarkeitsanzahl wurde für die folgende Domäne von {0} in {1} geändert: {2}.
ja: 次のドメインのドメイン高可用性カウントが {0} から {1} に変更されました: {2}。
ru: Величина высокой доступности домена изменена с {0} на {1} для следующего домена: {2}.
zh_cn: {2} 域的域高可用性计数已由 {0} 更改为 {1}。

# CDISA0086I
source: The high availability count changed from {0} to {1} for the {2} instance in following domain: {3}.
de: Die Hochverfügbarkeitsanzahl wurde für die Instanz {2} in der folgenden Domäne von {0} in {1} geändert: {3}.
ja: 次のドメイン内の {2} インスタンスの高可用性カウントが {0} から {1} に変更されました: {3}。
ru: Величина высокой доступности изменена с {0} на {1} для экземпляра {2} в следующем домене: {3}.
zh_cn: {3} 域中的 {2} 实例的高可用性计数已由 {0} 更改为 {1}。

# CDISA0087I
source: The {0} resource matches specification {1} for the {2} instance in the following domain: {3}.
de: Die Ressource {0} stimmt mit der Spezifikation {1} für die Instanz {2} in der folgenden Domäne überein: {3}.
ja: 次のドメイン内の {2} インスタンスの {0} リソースが仕様 {1} に一致しています: {3}。
ru: Ресурс {0} соответствует спецификации {1} для экземпляра {2} в следующем домене: {3}.
zh_cn: {0} 资源与 {3} 域中的 {2} 实例的 {1} 规范匹配。

# CDISA0088I
source: Replacing the {0} resource with {1} in the following specification: {2}. The specification is allocated to the {3} instance for the following domain: {4}.
de: Die Ressource {0} wird in der folgenden Spezifikation durch {1} ersetzt: {2}. Die Spezifikation ist der Instanz {3} für die folgende Domäne zugeordnet: {4}.
ja: {0} リソースを次の仕様の {1} に置換中: {2}。仕様は次のドメインの {3} インスタンスに割り振られています: {4}。
ru: Ресурс {0} заменяется на {1} в следующей спецификации: {2}. Спецификация выделена экземпляру {3} для следующего домена {4}.
zh_cn: 正在将 {0} 资源替换为 {2} 规范中的 {1}。该规范已分配到 {4} 域的 {3} 实例。

# CDISA0089I
source: Generated key successfully for the following domain: {0}.
de: Ein Schlüssel wurde erfolgreich für die folgende Domäne generiert: {0}.
ja: 次のドメインの鍵が正常に生成されました: {0}。
ru: Успешно сгенерирован ключ для следующего домена: {0}.
zh_cn: 已成功为 {0} 域生成密钥。

# CDISA0090I
source: The following domain was updated successfully: {0}.
de: Die folgende Domäne wurde erfolgreich aktualisiert: {0}.
ja: 次のドメインが正常に更新されました: {0}。
ru: Следующий домен был успешно обновлен: {0}.
zh_cn: 已成功更新 {0} 域。

# CDISA0091I
source: Application profile is not available on the {0} resource for the {1} job. The resource is allocated to the {2} instance for the following domain: {3}.
de: Das Anwendungsprofil ist in der {0}-Ressource für den {1}-Job nicht verfügbar. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {1} ジョブのアプリケーション・プロファイルが {0} リソースで使用可能でありません。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Профиль приложения недоступен на ресурсе {0} для задания {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 在 {1} 作业的 {0} 资源上未提供应用程序概要信息。该资源已分配到 {3} 域的 {2} 实例。

# CDISA0092I
source: Property {0} with a value of {1} was loaded from the property file.
de: Die Eigenschaft {0} mit dem Wert {1} wurde aus der Eigenschaftendatei geladen.
ja: 値が {1} のプロパティー {0} がプロパティー・ファイルからロードされました。
ru: Свойство {0} со значением {1} загружено из файла свойств.
zh_cn: 已从属性文件装入值为 {1} 的 {0} 属性。

# CDISA0093I
source: View {0} restarted for domain {1} instance {2}, job {3}, operator {4} port {5}.
de: Die Ansicht {0} wurde für Domäne {1}, Instanz {2}, Job {3}, Operator {4}, Port {5} erneut gestartet.
ja: ドメイン{1}、インスタンス {2}、ジョブ {3}、オペレーター {4}、ポート {5} のビュー {0} が再始動されました。
ru: Представление {0} перезапущено для домена {1}, экземпляра {2}, задания {3}, оператора {4} на порту {5}.
zh_cn: 已针对域 {1} 实例 {2} 来重新启动视图 {0}，作业为 {3}，操作程序为 {4}，端口为 {5}。

# CDISA0094I
source: View started for domain {0} instance {1}, job {2}, operator {3}.
de: Die Ansicht wurde für Domäne {0}, Instanz {1}, Job {2}, Operator {3} gestartet.
ja: ドメイン {0}、インスタンス {1}、ジョブ {2}、オペレーター {3} のビューが開始しました。
ru: Представление запущено для домена {0} экземпляра {1}, задания {2}, оператора {3}.
zh_cn: 已针对域 {0} 实例 {1} 来启动视图，作业为 {2}，操作程序为 {3}。

# CDISA0095I
source: Cleaning the {0} resource for the following instance: {1}. The instance is in the following domain: {2}.
de: Die Ressource {0} wird für die folgende Instanz bereinigt: {1}. Die Instanz befindet sich in der folgenden Domäne: {2}.
ja: 次のインスタンスの {0} リソースをクリーンアップ中: {1}。インスタンスは次のドメイン内にあります: {2}。
ru: Очищается ресурс {0} для следующего экземпляра: {1}. Экземпляр находится в следующем домене: {2}.
zh_cn: 正在清除 {1} 实例的 {0} 资源。该实例位于 {2} 域中。

# CDISA0096I
source: Dynamic view {0} restarted for domain {1} instance {2}, job {3}, operator {4} port {5}.
de: Die dynamische Ansicht {0} wurde für Domäne {1}, Instanz {2}, Job {3}, Operator {4}, Port {5} erneut gestartet.
ja: ドメイン{1}、インスタンス {2}、ジョブ {3}、オペレーター {4}、ポート {5} の動的ビュー {0} が再始動されました。
ru: Динамическое представление {0} перезапущено для домена {1}, экземпляра {2}, задания {3}, оператора {4} на порту {5}.
zh_cn: 已针对域 {1} 实例 {2} 来重新启动动态视图 {0}，作业为 {3}，操作程序为 {4}，端口为 {5}。

# CDISA0097I
source: The {0} resource was a member of specification {1} in the {2} instance for the following domain: {3}. The resource was added to the instance but removed from the specification.
de: Die Ressource {0} gehörte zur Spezifikation {1} in der Instanz {2} für die folgende Domäne: {3}. Die Ressource wurde der Instanz hinzugefügt, aber aus der Spezifikation entfernt.
ja: {0} リソースは、次のドメインの {2} インスタンス内の仕様 {1} のメンバーでした: {3}。リソースはインスタンスに追加されましたが、仕様から削除されました。
ru: Ресурс {0} был членом спецификации {1} в экземпляре {2} для следующего домена: {3}. Ресурс добавлен в экземпляр, но удален из спецификации.
zh_cn: {0} 资源是 {3} 域的 {2} 实例中的规范 {1} 的成员。该资源已添加到此实例，但已从此规范中移除。

# CDISA0098I
source: The {0} service was restarted on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} wurde in der folgenden Ressource erneut gestartet: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で {0} サービスが再始動されました: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Служба {0} перезапущена на ресурсе {1}. Ресурс выделен домену {2}.
zh_cn: 已在 {1} 资源上重新启动 {0} 服务。该资源已分配到 {2} 域。

# CDISA0099I
source: The {0} service was restarted on the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} wurde in der folgenden Ressource erneut gestartet: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: 次のリソース上で {0} サービスが再始動されました: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Служба {0} перезапущена на ресурсе {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 已在 {1} 资源上重新启动 {0} 服务。该资源已分配到 {3} 域的 {2} 实例。

# CDISA0100I
source: The {0} resource with {1} tags has been acquired from the following resource manager: {2}.
de: Die Ressource {0} mit den Tags {1} wurde vom folgenden Ressourcenmanager angefordert: {2}.
ja: {1} タグの {0} リソースが次のリソース・マネージャーから獲得されました: {2}。
ru: Ресурс {0} с тегами {1} получен от следующего менеджера ресурсов: {2}.
zh_cn: 已从 {2} 资源管理器获取具有 {1} 标记的 {0} 资源。

# CDISA0101I
source: Returning the {0} resource to the following resource manager: {1}.
de: Die Ressource {0} wird an den folgenden Ressourcenmanager zurückgegeben: {1}.
ja: {0} リソースを次のリソース・マネージャーに返しています: {1}。
ru: Ресурс {0} возвращается следующему менеджеру ресурсов: {1}.
zh_cn: 正在将 {0} 资源返回到 {1} 资源管理器。

# CDISA0102I
source: Starting registration of {0} jobs.
de: Die Registrierung von {0} Jobs wird gestartet.
ja: {0} 個のジョブの登録の開始中。
ru: Запускается регистрация заданий {0}.
zh_cn: 正在开始注册 {0} 个作业。

# CDISA0103I
source: Registration of the following job has completed: {0}
de: Die Registrierung des folgenden Jobs wurde abgeschlossen: {0}
ja: 次のジョブの登録が完了しました: {0}
ru: Регистрация указанного ниже задания завершена: {0}
zh_cn: 注册 {0} 作业已完成

# CDISA0104I
source: Registration of {0} jobs complete.
de: Die Registrierung von {0} Jobs wurde abgeschlossen.
ja: {0} 個のジョブの登録が完了しました。
ru: Регистрация заданий {0} завершена.
zh_cn: 已完成注册 {0} 个作业。

# CDISA0105I
source: The installation directory to start the {0} system service for the {1} domain was changed to {2}.
de: Das Installationsverzeichnis zum Starten des Systemservice {0} für die Domäne {1} wurde in {2} geändert.
ja: {1} ドメインの {0} システム・サービスを開始するインストール・ディレクトリーが {2} に変更されました。
ru: Каталог установки для запуска системной службы {0} для домена {1} изменен на {2}.
zh_cn: 用于启动 {1} 域的 {0} 系统服务的安装目录已更改为 {2}。

# CDISA0106I
source: The edition license was updated to the IBM Streams edition.
de: Die Editionslizenz wurde auf die IBM Streams-Edition aktualisiert.
ja: エディション・ライセンスが IBM Streams エディションに更新されました。
ru: Лицензия на выпуск обновлена до выпуска IBM Streams.
zh_cn: 修订版许可证已更新为 IBM Streams 修订版。

# CDISA0107I
source: An update edition notification was sent to {1} domains in {0} Zookeeper. Domains that are not active will get the update when they are started.
de: Eine Editionsupdatebenachrichtigung wurde an {1} Domänen in ZooKeeper {0} gesendet. Domänen, die nicht aktiv sind, rufen das Update ab, wenn sie gestartet werden.
ja: エディション更新通知が {0} Zookeeper 内の {1} 個のドメインに送信されました。アクティブでないドメインは、開始時に更新を取得します。
ru: Уведомление о выпуске обновления отправлено в домены {1} в {0} Zookeeper. Неактивные домены получат обновление при их запуске.
zh_cn: 已向 {0} ZooKeeper 中的 {1} 个域发送更新修订版通知。未处于活动状态的域将在启动后获得该更新。

# CDISA0108I
source: The installation is already at the IBM Streams edition.
de: Die Installation ist bereits auf dem Stand der IBM Streams-Edition.
ja: このインストール済み環境は既に IBM Streams エディションです。
ru: Установка уже находится на уровне выпуска IBM Streams.
zh_cn: 安装已处于 IBM Streams 修订版。

# CDISA0109I
source: An update edition notification was not sent to domains in the {0} ZooKeeper because there are no domains that are active. Domains that are not active will get the update when they are started.
de: Eine Editionsupdatebenachrichtigung wurde nicht an Domänen in ZooKeeper {0} gesendet, da keine aktiven Domänen vorhanden ist. Domänen, die nicht aktiv sind, rufen das Update ab, wenn sie gestartet werden.
ja: アクティブなドメインがないため、エディション更新通知が {0} ZooKeeper 内のドメインに送信されませんでした。アクティブでないドメインは、開始時に更新を取得します。
ru: Уведомление о выпуске обновления не отправлено в домены в {0} ZooKeeper, так как нет активных доменов. Неактивные домены получат обновление при их запуске.
zh_cn: 未向 ZooKeeper {0} 中的域发送更新修订版通知，这是因为没有处于活动状态的域。未处于活动状态的域将在启动后获得该更新。

# CDISA0110I
source: The edition license was updated to the IBM Streams edition with warnings.
de: Die Editionslizenz wurde mit Warnungen auf die IBM Streams-Edition aktualisiert.
ja: エディション・ライセンスが IBM Streams エディションに更新されましたが、警告が出されました。
ru: Лицензия на выпуск обновлена до выпуска IBM Streams с предупреждениями.
zh_cn: 修订版许可证已更新为 IBM Streams 修订版，但存在警告。

# CDISA0111I
source: The following job is already registered: {0}.
de: Der folgende Job ist bereits registriert: {0}.
ja: 次のジョブは既に登録済みです: {0}。
ru: Следующее задание уже зарегистрировано: {0}.
zh_cn: 已注册 {0} 作业。

# CDISA0112I
source: Successfully reconnected with managed bean: {0} in the {1} instance for the following domain: {2} .
de: Verbindung zu Managed Bean {0} in der Instanz {1} für die Domäne {2} wurde erfolgreich wiederhergestellt.
ja: 次のドメインの {1} インスタンス内の Managed Bean {0} に正常に再接続されました: {2}。
ru: Успешно восстановлено соединение с управляемым компонентом bean {0} в экземпляре {1} для следующего домена: {2}.
zh_cn: 已成功与 {2} 域的 {1} 实例中的受管 Bean {0} 重新建立连接。

# CDISA0113I
source: Established connection to the following resource manager: {0}. The resource manager is running on host={1} and port={2}.
de: Die Verbindung zum folgenden Ressourcenmanager wurde hergestellt: {0}. Der Ressourcenmanager wird auf dem Host {1} an Port {2} ausgeführt.
ja: 次のリソース・マネージャーへの接続が確立されました: {0}。リソース・マネージャーは、ホスト={1}、ポート={2} で実行されています。
ru: Установлено соединение со следующим менеджером ресурсов: {0}. Менеджер ресурсов работает на хосте {1} и порту {2}.
zh_cn: 已与 {0} 资源管理器建立连接。该资源管理器正在主机 {1} 端口 {2} 上运行。

# CDISA0114I
source: The {0} application configuration was created successfully for the following domain: {1}
de: Die Anwendungskonfiguration {0} wurde erfolgreich für die folgende Domäne erstellt: {1}
ja: 次のドメインの {0} アプリケーション構成が正常に作成されました: {1}。
ru: Конфигурация приложения {0} успешно создана для следующего домена: {1}.
zh_cn: 已成功为 {1} 域创建 {0} 应用程序配置

# CDISA0115I
source: The {0} application configuration was updated successfully for the following domain: {1}
de: Die Anwendungskonfiguration {0} wurde erfolgreich für die folgende Domäne aktualisiert: {1}
ja: 次のドメインの {0} アプリケーション構成が正常に更新されました: {1}。
ru: Конфигурация приложения {0} успешно обновлена для следующего домена: {1}.
zh_cn: 已成功更新 {1} 域的 {0} 应用程序配置

# CDISA0116I
source: The {0} application configuration was removed successfully for the following domain: {1}
de: Die Anwendungskonfiguration {0} wurde erfolgreich für die folgende Domäne entfernt: {1}
ja: 次のドメインの {0} アプリケーション構成が正常に削除されました: {1}。
ru: Конфигурация приложения {0} успешно удалена из следующего домена: {1}.
zh_cn: 已成功移除 {1} 域的 {0} 应用程序配置

# CDISA0117I
source: The {0} system service property was set to the following value: "{1}". The previous property value was "{2}". This change affects the {3} system service for the {4} domain. This change will not take affect until the system service associated with the domain is restarted. You can use ''streamtool stopdomainhost'' to stop it and ''streamtool startdomainhost'' to start it.
de: Die Systemserviceeigenschaft {0} wurde auf den folgenden Wert gesetzt: "{1}". Vorheriger Eigenschaftswert: "{2}". Diese Änderung wirkt sich auf den Systemservice {3} der Domäne {4} aus. Diese Änderung wird erst nach einem Neustart des Systemservice wirksam, der der Domäne zugeordnet ist. Sie können ''streamtool stopdomainhost'' zum Stoppen und ''streamtool startdomainhost'' zum Starten verwenden.
ja: {0} システム・サービス・プロパティーが次の値に設定されました:「{1}」。以前のプロパティー値は「{2}」でした。この変更は、{4} ドメインの {3} システム・サービスに影響します。この変更は、ドメインに関連付けられているシステム・サービスが再始動されるまで、有効になりません。停止するには「streamtool stopdomainhost」、開始するには「streamtool startdomainhost」を使用できます。
ru: Для свойства системной службы {0} задано следующее значение: "{1}". Предыдущее значение свойства - "{2}". Это изменение влияет на системную службу {3} домена {4}. Это изменение не вступит в силу, пока не будет перезапущена системная служба, связанная с доменом. Для ее остановки можно использовать команду ''streamtool stopdomainhost'', а для запуска - команду ''streamtool startdomainhost''.
zh_cn: {0} 系统服务属性已设置为值“{1}”。先前的属性值为“{2}”。此更改会影响 {4} 域的 {3} 系统服务。要在重新启动与该域相关联的系统服务之后，此更改才会生效。您可以使用“streamtool stopdomainhost”停止该系统服务，然后使用“streamtool startdomainhost”将其启动。

# CDISA0118I
source: The {0} option was not specified. Using the following value from the system service configuration file: {1}.
de: Die Option {0} wurde nicht angegeben. Der folgende Wert aus der Systemservicekonfigurationsdatei wird verwendet: {1}.
ja: {0} オプションが指定されませんでした。システム・サービス構成ファイルから次の値を使用します: {1}。
ru: Опция {0} не задана. Используется следующее значение из файла конфигурации системной службы: {1}.
zh_cn: 未指定 {0} 选项。正在使用系统服务配置文件中的以下值：{1}。

# CDISA0119I
source: The {0} option was not specified. Using the following default value: {1}.
de: Die Option {0} wurde nicht angegeben. Der folgende Standardwert wird verwendet: {1}.
ja: {0} オプションが指定されませんでした。次のデフォルト値を使用します: {1}。
ru: Опция {0} не задана. Используется следующее значение по умолчанию: {1}.
zh_cn: 未指定 {0} 选项。正在使用缺省值 {1}。

# CDISA0120I
source: The following property was removed from the {2} system service: {0}. The previous property value was "{1}". When the system service is restarted, the property reverts to the default value of "{3}".
de: Die folgende Eigenschaft wurde aus dem Systemservice {2} entfernt: {0}. Vorheriger Eigenschaftswert: "{1}". Beim Neustart des Systemservice wird die Eigenschaft auf den Standardwert "{3}" zurückgesetzt.
ja: 次のプロパティーが {2} システム・サービスから削除されました: {0}。以前のプロパティー値は「{1}」でした。システム・サービスが再始動されると、プロパティーはデフォルト値「{3}」に戻ります。
ru: Следующее свойство удалено из системной службы {2}: {0}. Предыдущее значение свойства - "{1}". Когда системная служба перезапустится, свойство возвратится к значению по умолчанию "{3}".
zh_cn: 已从 {2} 系统服务中移除 {0} 属性。先前的属性值为“{1}”。在重新启动该系统服务之后，此属性将还原为缺省值“{3}”。

# CDISA0121I
source: The following property was removed from the {2} system service: {0}. The previous property value was "{1}". The property will now use the default value of "{3}".
de: Die folgende Eigenschaft wurde aus dem Systemservice {2} entfernt: {0}. Vorheriger Eigenschaftswert: "{1}". Die Eigenschaft verwendet jetzt den Standardwert "{3}".
ja: 次のプロパティーが {2} システム・サービスから削除されました: {0}。以前のプロパティー値は「{1}」でした。現在、プロパティーはデフォルト値「{3}」を使用するようになりました。
ru: Следующее свойство удалено из системной службы {2}: {0}. Предыдущее значение свойства - "{1}". Теперь свойство примет значение по умолчанию "{3}".
zh_cn: 已从 {2} 系统服务中移除 {0} 属性。先前的属性值为“{1}”。现在，此属性将使用缺省值“{3}”。

# CDISA0122I
source: The {0} application configuration was created successfully for the following instance: {1}
de: Die Anwendungskonfiguration {0} wurde erfolgreich für die folgende Instanz erstellt: {1}
ja: 次のインスタンスの {0} アプリケーション構成が正常に作成されました: {1}。
ru: Конфигурация приложения {0} успешно создана для следующего экземпляра: {1}.
zh_cn: 已成功为 {1} 实例创建 {0} 应用程序配置
