Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5138E
source: The {0} user is not authorized to stop the following service: {1}. The serivce is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Stoppen des folgenden Service berechtigt: {1}. Der Service ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のサービスを停止する権限がありません: {1}。サービスは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено останавливать следующую службу: {1}. Служба выделена экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权停止 {1} 服务。该服务已分配到 {3} 域的 {2} 实例。

# CDISA5139E
source: The {0} tag is in use and cannot be modified or removed. The tag is allocated to the following domain: {1}.
de: Der Tag {0} wird gerade verwendet und kann nicht modifiziert oder entfernt werden. Der Tag ist der folgenden Domäne zugeordnet: {1}.
ja: {0} タグは使用中であるため、変更および削除できません。タグは次のドメインに割り振られています: {1}。
ru: Тег {0} используется и его нельзя изменить или удалить. Тег выделен следующему домену: {1}.
zh_cn: {0} 标记正在使用中，无法修改或移除该标记。该标记已分配到 {1} 域。

# CDISA5140E
source: The {0} instance can not be started at Streams version {1}. This version is not compatible with domain version {2}.
de: Die Instanz {0} kann nicht mit Streams Version {1} gestartet werden. Diese Version ist nicht mit der Domänenversion {2} kompatibel.
ja: {0} インスタンスは、Streams バージョン {1} で開始できません。このバージョンには、ドメインのバージョン {2} との互換性がありません。
ru: Экземпляр {0} невозможно запустить в версии Streams {1}. Эта версия не совместима с версией домена {2}.
zh_cn: 无法以 Streams V{1} 启动 {0} 实例。此版本与域 V{2} 不兼容。

# CDISA5141E
source: The following domain is currently busy: {0}.
de: Die folgende Domäne ist zurzeit ausgelastet: {0}.
ja: 次のドメインは現在ビジーです: {0}。
ru: Следующий домен сейчас занят: {0}.
zh_cn: {0} 域当前处于繁忙状态。

# CDISA5142E
source: The {0} instance is currently busy for the following domain: {1}.
de: Die Instanz {0} für die folgende Domäne ist zurzeit ausgelastet: {1}.
ja: 次のドメインの {0} インスタンスは現在ビジーです: {1}。
ru: Экземпляр {0} сейчас занят для следующего домена: {1}.
zh_cn: {1} 域的 {0} 实例当前处于繁忙状态。

# CDISA5143E
source: ZooKeeper not started on {0}.
de: ZooKeeper wurde in {0} nicht gestartet.
ja: ZooKeeper が {0} で開始しませんでした。
ru: ZooKeeper не запущен на {0}.
zh_cn: 未根据 {0} 启动 ZooKeeper。

# CDISA5144E
source: ZooKeeper not stopped on {0}.
de: ZooKeeper wurde in {0} nicht gestoppt.
ja: ZooKeeper が {0} で停止しませんでした。
ru: ZooKeeper не остановлен на {0}.
zh_cn: 未根据 {0} 停止 ZooKeeper。

# CDISA5145E
source: The property value for {0}={1} is not valid.
de: Der Eigenschaftswert für {0}={1} ist nicht gültig.
ja: {0}={1} のプロパティー値は無効です。
ru: Значение свойства для {0}={1} является недопустимым.
zh_cn: {0} 属性的值 {1} 无效。

# CDISA5146E
source: The property value for {0}={1} is not supported.
de: Der Eigenschaftswert für {0}={1} wird nicht unterstützt.
ja: {0}={1} のプロパティー値はサポートされません。
ru: Значение свойства для {0}={1} не поддерживается.
zh_cn: {0} 属性的值 {1} 不受支持。

# CDISA5148E
source: The {0} user is not authorized to list jobs for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Auflisten von Jobs für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのジョブをリストする権限がありません: {2}。
ru: Пользователю {0} не разрешено перечислять задания для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权列示 {2} 域中的 {1} 实例的作业。

# CDISA5149E
source: The {0} system service failed to restart on the following resource: {1}. The resources is allocated to the following domain: {2}.
de: Der Systemservice {0} konnte in der folgenden Ressourcen nicht erneut gestartet werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で {0} システム・サービスの再始動に失敗しました: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Не удалось перезапустить системную службу {0} на ресурсе {1}. Ресурс выделен домену {2}.
zh_cn: 无法在 {1} 资源上重新启动 {0} 系统服务。该资源已分配到 {2} 域。

# CDISA5151E
source: The {0} host can not be removed from the following domain: {1}. The host is running services for the domain.
de: Der Host {0} kann nicht aus der folgenden Domäne entfernt werden: {1}. Auf dem Host werden Services für die Domäne ausgeführt.
ja: {0} ホストを次のドメインから削除できません: {1}。このホストはドメインのサービスを実行しています。
ru: Хост {0} невозможно удалить из следующего домена: {1}. На хосте работают службы для домена.
zh_cn: 无法从 {1} 域中移除 {0} 主机。该主机正在运行该域的服务。

# CDISA5152E
source: The {0} host can not be removed from the following domain: {2}. The host is running services for the following instance: {1}.
de: Der Host {0} kann nicht aus der folgenden Domäne entfernt werden: {2}. Auf dem Host werden Services für die folgende Instanz ausgeführt: {1}.
ja: {0} ホストを次のドメインから削除できません: {2}。このホストは次のインスタンスのサービスを実行しています: {1}。
ru: Хост {0} невозможно удалить из следующего домена: {2}. На хосте работают службы для следующего экземпляра: {1}.
zh_cn: 无法从 {2} 域中移除 {0} 主机。该主机正在运行 {1} 实例的服务。

# CDISA5154E
source: The {0} user is not authorized to modify the configuration for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Modifizieren der Konfiguration für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスの構成を変更する権限がありません: {2}。
ru: Пользователю {0} не разрешено изменять конфигурацию для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权修改 {2} 域中的 {1} 实例的配置。

# CDISA5155E
source: The following role already exists: {0}.
de: Die folgende Rolle ist bereits vorhanden: {0}.
ja: 次のロールは既に存在します: {0}。
ru: Следующая роль уже существует: {0}.
zh_cn: {0} 角色已存在。

# CDISA5156E
source: The following role does not exist: {0}.
de: Die folgende Rolle ist nicht vorhanden: {0}.
ja: 次のロールは存在しません: {0}。
ru: Следующая роль не существует: {0}.
zh_cn: {0} 角色不存在。

# CDISA5157E
source: The {0} resource does not exist for the following domain: {1}.
de: Die Ressource {0} ist für die folgende Domäne nicht vorhanden: {1}.
ja: 次のドメインの {0} リソースは存在しません: {1}。
ru: Ресурс {0} не существует для следующего домена: {1}.
zh_cn: {1} 域的 {0} 资源不存在。

# CDISA5158E
source: Could not allocate enough management resources for the following domain: {0}.
de: Es konnten nicht genügend Managementressourcen für die folgende Domäne zugeordnet werden: {0}.
ja: 次のドメインに十分な管理リソースを割り振ることができませんでした: {0}。
ru: Не удалось выделить достаточно ресурсов управления ресурсов для следующего домена: {0}.
zh_cn: 无法为 {0} 域分配足够的管理资源。

# CDISA5159E
source: No resources are available for the {0} instance in the following domain: {1}.
de: In der folgenden Domäne sind keine Ressourcen für die Instanz {0} verfügbar: {1}.
ja: 次のドメイン内の {0} インスタンスで使用可能なリソースがありません: {1}。
ru: Не доступных ресурсов для экземпляра {0} в следующем домене: {1}.
zh_cn: 没有任何资源可用于 {1} 域中的 {0} 实例。

# CDISA5160E
source: No system service resources are available for the {0} instance in the following domain: {1}. This instance requires that all resources be registered as system services.
de: In der folgenden Domäne sind keine Systemserviceressourcen für die Instanz {0} verfügbar: {1}. Für diese Instanz müssen alle Ressourcen als Systemservices registriert sein.
ja: 次のドメイン内の {0} インスタンスで使用可能なシステム・サービス・リソースがありません: {1}。このインスタンスでは、すべてのリソースがシステム・サービスとして登録される必要があります。
ru: Не доступных ресурсов системных служб для экземпляра {0} в следующем домене: {1}. Этому экземпляру требуется, чтобы все ресурсы были зарегистрированы как системные службы.
zh_cn: 没有任何系统服务资源可用于 {1} 域中的 {0} 实例。此实例要求将所有资源都注册为系统服务。

# CDISA5162E
source: Could not locate the {0} install package with version {1} and build level {2}. A resource with the full install must be part of the domain and in a running state.
de: Das Installationspaket {0} mit Version {1} und Buildstufe {2} konnte nicht lokalisiert werden. Eine Ressource mit der vollständigen Installation muss Teil der Domäne sein und sich im Ausführungsstatus befinden.
ja: バージョン {1} およびビルド・レベル {2} の {0} インストール・パッケージを見つけることができませんでした。フルインストールが含まれたリソースがドメインに属していて、実行中状態でなければなりません。
ru: Не удалось найти пакет установки {0} с версией {1} и уровнем сборки {2}. Ресурс с полной установкой должен быть частью домена и должен находиться в работающем состоянии.
zh_cn: 找不到版本为 {1} 且构建级别为 {2} 的 {0} 安装软件包。已进行完全安装的资源必须位于域中且处于运行状态。

# CDISA5163E
source: An error occured downloading the {0} install package from the following resource: {1}.
de: Beim Download des Installationspakets {0} von der folgenden Ressource ist ein Fehler aufgetreten: {1}.
ja: 次のリソースからの {0} インストール・パッケージのダウンロード中にエラーが発生しました: {1}。
ru: Произошла ошибка при скачивании пакета установки {0} со следующего ресурса: {1}.
zh_cn: 从 {1} 资源中下载 {0} 安装软件包时发生错误。

# CDISA5164E
source: The following resource manager is not configured properly: {0}.
de: Der folgende Ressourcenmanager ist nicht ordnungsgemäß konfiguriert: {0}.
ja: 次のリソース・マネージャーが適切に構成されていません: {0}。
ru: Указанный ниже менеджер ресурсов не сконфигурирован правильно: {0}.
zh_cn: 未正确配置 {0} 资源管理器。

# CDISA5165E
source: An unexpected error occured while communicating with LDAP - {0}.
de: Bei der Kommunikation mit LDAP ist ein unerwarteter Fehler aufgetreten - {0}.
ja: LDAP との通信中に予期しないエラーが発生しました - {0}。
ru: Произошла неожиданная ошибка при взаимодействии с LDAP - {0}.
zh_cn: 与 LDAP 通信时发生意外错误 - {0}。

# CDISA5166E
source: Failed to connect to LDAP - {0}.
de: Herstellen der Verbindung zu LDAP ist fehlgeschlagen - {0}.
ja: LDAP への接続に失敗しました - {0}。
ru: Не удалось соединиться с LDAP - {0}.
zh_cn: 无法连接到 LDAP - {0}。

# CDISA5167E
source: The path to the installation directory must be an absolute path and cannot contain spaces or special characters.
de: Der Pfad zum Installationsverzeichnis muss ein absoluter Pfad sein und darf keine Leerzeichen oder Sonderzeichen enthalten.
ja: インストール・ディレクトリーのパスは絶対パスでなければならず、スペースおよび特殊文字を含めることができません。
ru: Путь к каталогу установки должен быть абсолютным и не должен содержать пробелов или специальных символов.
zh_cn: 安装目录的路径必须是绝对路径，并且不能包含空格或特殊字符。

# CDISA5168E
source: The {0} user does not have write permission to the following package directory: {1}.
de: Der Benutzer {0} hat keine Schreibberechtigung für das folgende Paketverzeichnis: {1}.
ja: {0} ユーザーは、次のパッケージ・ディレクトリーに対する書き込み許可を備えていません: {1}。
ru: У пользователя {0} нет разрешений на запись в следующий каталог пакета: {1}.
zh_cn: {0} 用户没有以下软件包目录的写许可权：{1}。

# CDISA5170E
source: The following directory for the installation package does not exist: {0}.
de: Das folgende Verzeichnis für das Installationspaket ist nicht vorhanden: {0}.
ja: インストール・パッケージの次のディレクトリーは存在しません: {0}。
ru: Следующий каталог для пакета установки не существует: {0}.
zh_cn: 安装软件包的以下目录不存在：{0}。

# CDISA5171E
source: The installation package cannot be created because the source files do not exist in this installation.
de: Das Installationspaket kann nicht erstellt werden, da die Quellendateien in dieser Installation nicht vorhanden sind.
ja: ソース・ファイルがこのインストールで存在しないため、インストール・パッケージを作成できません。
ru: Невозможно создать пакет установки, так как исходные файлы не существуют в этой установке.
zh_cn: 无法创建安装软件包，这是因为此安装中不存在源文件。

# CDISA5172E
source: The following security object does not exist: {0}.
de: Das folgende Sicherheitsobjekt ist nicht vorhanden: {0}.
ja: 次のセキュリティー・オブジェクトは存在しません: {0}。
ru: Следующий объект защиты не существует: {0}.
zh_cn: 安全对象 {0} 不存在。

# CDISA5173E
source: The operation can not be performed on the following resource: {0}. The resource is running management services for the following domain: {1}. There are no standby services available.
de: Die Operation kann in der folgenden Ressource nicht ausgeführt werden: {0}. In der Ressource werden Management-Services für die folgende Domäne ausgeführt: {1}. Es sind keine Standby-Services verfügbar.
ja: 次のリソースで操作を実行できません: {0}。リソースは次のドメインの管理サービスを実行しています: {1}。使用可能なスタンバイ・サービスがありません。
ru: Операцию невозможно выполнить на следующем ресурсе: {0}. На ресурсе работают службы управления для следующего домена: {1}. Нет доступных резервных служб.
zh_cn: 无法在 {0} 资源上执行此操作。该资源正在运行 {1} 域的管理服务。没有可用的备用服务。

# CDISA5174E
source: The operation can not be performed on the following resource: {0}. The resource is running management services for the {1} instance in the following domain: {2}. There are no standby services available.
de: Die Operation kann in der folgenden Ressource nicht ausgeführt werden: {0}. In der Ressource werden Management-Services für die Instanz {1} in der folgenden Domäne ausgeführt: {2}. Es sind keine Standby-Services verfügbar.
ja: 次のリソースで操作を実行できません: {0}。リソースは次のドメイン内の {1} インスタンスの管理サービスを実行しています: {2}。使用可能なスタンバイ・サービスがありません。
ru: Операцию невозможно выполнить на следующем ресурсе: {0}. На ресурсе работают службы управления для экземпляра {1} в следующем домене: {2}. Нет доступных резервных служб.
zh_cn: 无法在 {0} 资源上执行此操作。该资源正在运行 {2} 域中的 {1} 实例的管理服务。没有可用的备用服务。

# CDISA5175E
source: Unexpected error encountered while parsing HTML - {0}
de: Beim HTML-Parsing ist ein unerwarteter Fehler aufgetreten - {0}
ja: HTML の解析中に予期しないエラーが発生しました - {0}
ru: Обнаружена неожиданная ошибка при анализе HTML - {0}
zh_cn: 解析 HTML 时遇到意外错误 - {0}

# CDISA5177E
source: The following configuration item already exists: {0}.
de: Das folgende Konfigurationselement ist bereits vorhanden: {0}.
ja: 次の構成項目は既に存在します: {0}。
ru: Следующий элемент конфигурации уже существует: {0}.
zh_cn: 配置项 {0} 已存在。

# CDISA5178E
source: The following configuration item does not exist: {0}.
de: Das folgende Konfigurationselement ist nicht vorhanden: {0}.
ja: 次の構成項目は存在しません: {0}。
ru: Следующий элемент конфигурации не существует: {0}.
zh_cn: 配置项 {0} 不存在。

# CDISA5179E
source: The {0} host is configured for an instance in the following domain: {1}.
de: Der Host {0} ist für eine Instanz in der folgenden Domäne konfiguriert: {1}.
ja: {0} ホストは次のドメイン内のインスタンス用に構成されています: {1}。
ru: Хост {0} сконфигурирован для экземпляра в следующем домене: {1}.
zh_cn: 已为 {1} 域中的实例配置 {0} 主机。

# CDISA5180E
source: The {0} host is not part of the following domain: {1}.
de: Der Host {0} ist nicht Teil der folgenden Domäne: {1}.
ja: {0} ホストは次のドメインに属していません: {1}。
ru: Хост {0} - это не часть следующего домена: {1}.
zh_cn: {0} 主机不属于 {1} 域。

# CDISA5181E
source: Pending value does not exist for the following property: {0}.
de: Der anstehende Wert ist für die folgende Eigenschaft nicht vorhanden: {0}.
ja: 次のプロパティーの保留中の値は存在しません: {0}。
ru: Отложенное значение не существует для следующего свойства: {0}.
zh_cn: 不存在 {0} 属性的暂挂值。

# CDISA5182E
source: Pending value does not exist for the following resource specification: {0}.
de: Der anstehende Wert ist für die folgende Ressourcenspezifikation nicht vorhanden: {0}.
ja: 次のリソース仕様の保留中の値は存在しません: {0}。
ru: Отложенное значение не существует для следующей спецификации ресурса: {0}.
zh_cn: 不存在 {0} 资源规范的暂挂值。

# CDISA5183E
source: The following property is not valid: {0}.
de: Die folgende Eigenschaft ist nicht gültig: {0}.
ja: 次のプロパティーは無効です: {0}。
ru: Следующее свойство недопустимо: {0}.
zh_cn: {0} 属性无效。

# CDISA5184E
source: Cannot modify the following property: {0}.
de: Die folgende Eigenschaft kann nicht modifiziert werden: {0}.
ja: 次のプロパティーを変更できません: {0}。
ru: Невозможно изменить следующее свойство: {0}.
zh_cn: 无法修改 {0} 属性。

# CDISA5185E
source: Value {0} is not valid for the following property: {1}.
de: Der Wert {0} ist für die folgende Eigenschaft nicht gültig: {1}.
ja: 次のプロパティーの値 {0} は無効です: {1}。
ru: Значение {0} не допустимо для следующего свойства: {1}.
zh_cn: 值 {0} 对于 {1} 属性而言无效。

# CDISA5186E
source: The following tag does not exist: {0}.
de: Der folgende Tag ist nicht vorhanden: {0}.
ja: 次のタグは存在しません: {0}。
ru: Следующий тег не существует: {0}.
zh_cn: {0} 标记不存在。

# CDISA5187E
source: The following tag can not be removed: {0}. The tag is associated with a resource.
de: Der folgende Tag kann nicht entfernt werden: {0}. Der Tag ist einer Ressource zugeordnet.
ja: 次のタグを削除できません: {0}。このタグはリソースに関連付けられています。
ru: Следующий тег невозможно удалить: {0}. Тег связан с ресурсом.
zh_cn: 无法移除 {0} 标记。该标记与某个资源相关联。

# CDISA5188E
source: The following tag can not be removed: {0}. The tag is associated with an instance.
de: Der folgende Tag kann nicht entfernt werden: {0}. Der Tag ist einer Instanz zugeordnet.
ja: 次のタグを削除できません: {0}。このタグはインスタンスに関連付けられています。
ru: Следующий тег невозможно удалить: {0}. Тег связан с экземпляром.
zh_cn: 无法移除 {0} 标记。该标记与某个实例相关联。

# CDISA5189E
source: The following reserved tag can not be modified: {0}.
de: Der folgende Tag kann nicht modifiziert werden: {0}.
ja: 次の予約済みタグは変更できません: {0}。
ru: Следующий зарезервированный тег невозможно изменить: {0}.
zh_cn: 无法修改保留标记 {0}。

# CDISA5191E
source: The following tag is not valid as part of an instance resource specification: {0}.
de: Der folgende Tag ist nicht als Teil einer Instanzressourcenspezifikation gültig: {0}.
ja: 次のタグはインスタンス・リソース仕様の一部として無効です: {0}。
ru: Следующий тег является недопустимым как часть спецификации ресурса экземпляра: {0}.
zh_cn: {0} 标记作为实例资源规范的组成部分时无效。

# CDISA5193E
source: Cannot set Streams bootstrap configuration properties while embedded ZooKeeper is running.
de: Streams-Bootstrap-Konfigurationseigenschaften können nicht festgelegt werden, während der integrierte ZooKeeper-Service ausgeführt wird.
ja: 組み込み ZooKeeper の実行中は Streams ブートストラップ構成プロパティーを設定できません。
ru: Невозможно задать свойства конфигурации начальной загрузки потоков, когда работает встроенный компонент ZooKeeper.
zh_cn: 当嵌入式 ZooKeeper 处于运行状态时，无法设置 Streams 引导配置属性。

# CDISA5194E
source: The {0} host name is not known to the system name resolver.
de: Der Hostname {0} ist dem Namensauflöser des Systems nicht bekannt.
ja: {0} ホスト名は、システム名リゾルバーに認識されていません。
ru: Имя хоста {0} неизвестно системному средству разрешения имен.
zh_cn: {0} 主机名对于系统名称解析器而言未知。

# CDISA5195E
source: The following role is defined by the system and cannot be removed: {0}.
de: Die folgende Rolle ist vom System definiert und kann nicht entfernt werden: {0}.
ja: 次のロールはシステムによって定義されているため、削除できません: {0}。
ru: Указанная ниже роль задана системой, и ее нельзя удалить: {0}.
zh_cn: {0} 角色由系统定义，无法将其移除。

# CDISA5196E
source: The following instance role is defined by the system and cannot be removed: {0}.
de: Die folgende Instanzrolle ist vom System definiert und kann nicht entfernt werden: {0}.
ja: 次のインスタンス・ロールはシステムによって定義されているため、削除できません: {0}。
ru: Указанная ниже роль экземпляра задана системой, и ее нельзя удалить: {0}.
zh_cn: {0} 实例角色由系统定义，无法将其移除。

# CDISA5197E
source: The {0} resource is reserved for exclusive use by the {1} instance for the following domain: {2}.
de: Die Ressource {0} ist für die exklusive Nutzung durch die Instanz {1} für die folgende Domäne reserviert: {2}.
ja: {0} リソースは、次のドメインの {1} インスタンスによる排他使用のために予約済みです: {2}。
ru: Ресурс {0} зарезервирован для исключительного использования экземпляром {1} для следующего домена: {2}.
zh_cn: {0} 资源是专供 {2} 域中的 {1} 实例使用的保留资源。

# CDISA5198E
source: The jmx service failed to start; an available communications port could not be found within range {0}.
de: Der JMX-Service konnte nicht gestartet werden; innerhalb des Bereichs {0} konnte kein verfügbarer Kommunikationsport gefunden werden.
ja: jmx サービスの開始に失敗しました。使用可能な通信ポートが範囲 {0} で見つかりませんでした。
ru: Служба jmx не смогла запуститься; не удалось найти доступный порт связи в диапазоне {0}.
zh_cn: 无法启动 JMX 服务；在范围 {0} 内找不到可用的通信端口。

# CDISA5199E
source: The following domain is not operational: {0}. The required services are temporarily unavailable.
de: Die folgende Domäne ist nicht betriebsbereit: {0}. Die erforderlichen Services sind vorübergehend nicht verfügbar.
ja: 次のドメインは作動可能でありません: {0}。必要なサービスが一時的に使用不可です。
ru: Следующий домен в нерабочем состоянии: {0}. Необходимые службы временно недоступны.
zh_cn: {0} 域未正常运行。所需服务暂时不可用。

# CDISA5200E
source: Unable to access the Streams configuration repository in {0}.
de: Auf das Streams-Konfigurationsrepository in {0} kann nicht zugegriffen werden.
ja: {0} 内の Streams 構成リポジトリーにアクセスできません。
ru: Невозможно получить доступ к репозиторию конфигурации Streams в {0}.
zh_cn: 无法访问 {0} 中的 Streams 配置存储库。

# CDISA5201E
source: The {0} instance is active for the following domain: {1}. Logs can not be removed.
de: Die Instanz {0} ist für die folgende Domäne aktiv: {1}. Protokolle können nicht entfernt werden.
ja: 次のドメインの {0} インスタンスはアクティブです: {1}。ログを削除できません。
ru: Экземпляр {0} активен для следующего домена: {1}. Журналы нельзя удалить.
zh_cn: {1} 域的 {0} 实例处于活动状态。无法移除日志。

# CDISA5202E
source: The {0} user is not authorized to remove logs from the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Entfernen von Protokollen aus der Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスからログを削除する権限がありません: {2}。
ru: Пользователю {0} не разрешено удалять журналы из экземпляра {1} для следующего домена: {2}.
zh_cn: {0} 用户无权从 {2} 域的 {1} 实例中移除日志。

# CDISA5203E
source: The following domain is active: {0}. Logs can not be removed.
de: Die folgende Domäne ist aktiv: {0}. Protokolle können nicht entfernt werden.
ja: 次のドメインがアクティブです: {0}。ログを削除できません。
ru: Следующий домен активен: {0}. Журналы нельзя удалить.
zh_cn: {0} 域处于活动状态。无法移除日志。

# CDISA5204E
source: The {0} user is not authorized to remove logs from the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Entfernen von Protokollen aus der folgenden Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインからログを削除する権限がありません: {1}。
ru: Пользователю {0} не разрешено удалять журналы из следующего домена: {1}.
zh_cn: {0} 用户无权从 {1} 域中移除日志。

# CDISA5205E
source: The {0} user is not authorized to check user permissions for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Überprüfen von Benutzerberechtigungen für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのユーザー許可をチェックする権限がありません: {1}。
ru: Пользователю {0} не разрешено проверять полномочия для следующего домена: {1}.
zh_cn: {0} 用户无权检查 {1} 域的用户许可权。

# CDISA5206E
source: The {0} user is not authorized to check user permissions for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Überprüfen von Benutzerberechtigungen für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのユーザー許可をチェックする権限がありません: {2}。
ru: Пользователю {0} не разрешено проверять полномочия для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权检查 {2} 域中的 {1} 实例的用户许可权。

# CDISA5207E
source: Network communication failed to the following resource: {0}. The resource is allocated to the following domain: {1}.
de: Die Netzkommunikation mit der folgenden Ressource ist fehlgeschlagen: {0}. Die Ressource ist der folgenden Domäne zugeordnet: {1}.
ja: 次のリソースへのネットワーク通信が失敗しました: {0}。リソースは次のドメインに割り振られています: {1}。
ru: Сетевая связь завершилась неудачно для следующего ресурса: {0}. Ресурс выделен домену {1}.
zh_cn: 无法与 {0} 资源建立网络通信。该资源已分配到 {1} 域。

# CDISA5208E
source: The following jobgroup is defined by the system and cannot be removed: {0}.
de: Die folgende Jobgruppe ist vom System definiert und kann nicht entfernt werden: {0}.
ja: 次のジョブ・グループはシステムによって定義されているため、削除できません: {0}。
ru: Указанная ниже группа заданий задана системой, и ее нельзя удалить: {0}.
zh_cn: {0} 作业组由系统定义，无法将其移除。

# CDISA5209E
source: The following job group already exists: {0}.
de: Die folgende Jobgruppe ist bereits vorhanden: {0}.
ja: 次のジョブ・グループは既に存在します: {0}。
ru: Следующая группа заданий уже существует: {0}.
zh_cn: 作业组 {0} 已存在。

# CDISA5210E
source: The following job group does not exist: {0}.
de: Die folgende Jobgruppe ist nicht vorhanden: {0}.
ja: 次のジョブ・グループは存在しません: {0}。
ru: Следующая группа заданий не существует: {0}.
zh_cn: 作业组 {0} 不存在。

# CDISA5212E
source: The following port is not valid: {0}.
de: Der folgende Port ist nicht gültig: {0}.
ja: 次のポートは無効です: {0}。
ru: Следующий порт недопустим: {0}.
zh_cn: 端口 {0} 无效。

# CDISA5213E
source: An error occured resolving the following host: {0}.
de: Beim Auflösen des folgenden Hosts ist ein Fehler aufgetreten: {0}.
ja: 次のホストの解決中にエラーが発生しました: {0}。
ru: Произошла ошибка при разрешении следующего хоста: {0}.
zh_cn: 解析 {0} 主机时发生错误。
