Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsRuntimeMessages_*.xlf
Languages: ko, pt_br

# CDISR3027E
source: The job submission, or processing element restart, failed. A placement that meets the constraints of all the processing elements was not found.
ko: 작업 제출 또는 처리 요소 재시작에 실패합니다. 모든 처리 요소 제한조건에 맞는 배치를 찾을 수 없습니다.
pt_br: Falha no envio de tarefa ou na reinicialização do elemento de processamento. Uma colocação que atende às restrições de todos os elementos de processamento não foi localizada.

# CDISR3028E
source: The specified recommendation scope of {0} is not valid.
ko: 지정된 권장사항 범위 {0}이(가) 유효하지 않습니다.
pt_br: O escopo da recomendação especificado de {0} não é válido.

# CDISR3029E
source: The {0} scope ID of the instance-scoped recommendation is not valid.
ko: 인스턴스 범위의 권장사항에 대한 {0} 범위 ID가 유효하지 않습니다.
pt_br: O ID do escopo {0} da recomendação com escopo definido para instância não é válido.

# CDISR3030E
source: You cannot request the performance recommendations for a host {0} that cannot run jobs.
ko: 작업을 실행할 수 없는 {0} 호스트의 성능 권장사항을 요청할 수 없습니다.
pt_br: Não é possível solicitar recomendações de desempenho para um host {0} que não pode executar tarefas.

# CDISR3031E
source: Job ID {0} of the job-scoped recommendation is not valid.
ko: 작업 범위 권장사항의 작업 ID {0}이(가) 유효하지 않습니다.
pt_br: O ID da tarefa {0} da recomendação com escopo definido para tarefa não é válido.

# CDISR3033E
source: Hostpool index {0} is not valid.
ko: 호스트 풀 인덱스 {0}이(가) 유효하지 않습니다.
pt_br: O índice do conjunto de hosts {0} não é válido.

# CDISR3034E
source: The operation failed because a required size parameter is missing in the explicit hostpool definition of hostpool {0}.
ko: 호스트 풀 {0}의 명시적 호스트 풀 정의에서 필수 크기 매개변수가 누락되었기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque um parâmetro de tamanho necessário está ausente na definição do conjunto de hosts explícitos do conjunto de hosts {0}.

# CDISR3035W
source: {0} processing elements were requested, but the number of processing elements submitted was {1}.
ko: {0} 처리 요소를 요청했지만 제출된 처리 요소의 수는 {1}입니다.
pt_br: {0} elementos de processamento foram solicitados, mas o número de elementos de processamento enviado foi {1}.

# CDISR3040I
source: Job ID {0} was scheduled.
ko: 작업 ID {0}을(를) 스케줄했습니다.
pt_br: O ID de tarefa {0} foi planejado.

# CDISR3041E
source: The operation failed because the PE placement constraints cannot be met. For more information, see the messages that follow this one.
ko: PE 배치 제한조건을 충족할 수 없기 때문에 조작이 실패했습니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: A operação falhou porque as restrições de posicionamento do PE não podem ser atendidas. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3042E
source: The preliminary verification of the constraints of job ID {0} indicates that not all the constraints can be met. For more information, see the messages that follow this one.
ko: 작업 ID {0}의 제한조건에 대한 예비 확인은 일부 제한조건을 충족할 수 없음을 표시합니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: A verificação preliminar de restrições do ID de tarefa {0} indica que nem todas as restrições podem ser atendidas. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3043I
source: The following processing elements must run on one of the following hosts. The processing elements are: {0}. The hosts on which the processing elements must run are: {1}. For more information, see the messages that follow this one.
ko: 다음 처리 요소가 다음 호스트 중 하나에서 실행되어야 합니다. 처리 요소는 {0}입니다. 처리 요소가 실행되어야 하는 호스트는 {1}입니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: Os elementos de processamento a seguir devem ser executados em um dos hosts a seguir. Os elementos de processamento são: {0}. Os hosts nos quais os elementos de processamento deve ser executados são: {1}. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3044E
source: The following processing elements must run on the same host, but these processing elements cannot be scheduled on the same host: {0}. For more information, see the messages that follow this one.
ko: {0} 처리 요소를 동일한 호스트에서 실행해야 하지만 이러한 처리 요소를 동일한 호스트에서 스케줄할 수 없습니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: Os elementos de processamento a seguir devem ser executados no mesmo host, mas esses elementos de processamento não podem ser planejados no mesmo host: {0}. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3045I
source: The processing element ID {0} is constrained to be scheduled from the following hosts: {1}. For more information, see the messages that follow this one.
ko: 처리 요소 ID {0}이(가) {1} 호스트에서 스케줄되도록 제한됩니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: O ID do elemento de processamento {0} é restrito para ser planejado a partir dos hosts a seguir: {1}. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3046E
source: The processing element ID {0} cannot be scheduled. For more information, see the messages that follow this one.
ko: 처리 요소 ID {0}을(를) 스케줄할 수 없습니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: O ID do elemento de processamento {0} não pode ser planejado. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3047I
source: A constraint on the {0} operator requires that it be scheduled from the following hosts: {1}. For more information, see the messages that follow this one.
ko: {0} 연산자에 대한 제한조건에서는 이 연산자를 {1} 호스트에서 스케줄해야 합니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: Uma restrição no operador {0} requer que ele seja planejado a partir dos hosts a seguir: {1}. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3048E
source: The {0} operator cannot be scheduled. For more information, see the messages that follow this one.
ko: {0} 연산자를 스케줄할 수 없습니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: O operador {0} não pode ser planejado. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR3049E
source: The operation can not be performed on {0}. The following processing elements are currently placed on this resource for instance {1} in domain {2} and there is no other resource placement alternatives: {3}.
ko: {0}에서 조작을 수행할 수 없습니다. {3} 처리 요소가 현재 도메인 {2}의 인스턴스 {1}에 대한 해당 자원에 배치되어 있으며 다른 자원 배치 대체가 없습니다.
pt_br: A operação não pode ser executada em {0}. Atualmente, os elementos de processamento a seguir estão colocados nesse recurso para a instância {1} no domínio {2} e não há outras alternativas de colocação de recurso: {3}.

# CDISR3050I
source: The {0} host was included in the scheduling process because the absolute location of the host was specified.
ko: 호스트의 절대 위치를 지정했으므로 스케줄링 프로세스에 {0} 호스트가 포함되어 있습니다.
pt_br: O host {0} foi incluído no processo de planejamento porque o local absoluto do host foi especificado.

# CDISR3051I
source: The following hosts were included in the scheduling process because the hosts are eligible to be included in the {0} hostpool by having the following tags. The hosts are: {2}. The tags that are shared by the hosts are: {1}.
ko: 호스트가 다음 호스트 풀 태그를 포함하여 {0} 호스트 풀에 포함될 수 있으므로 다음 호스트가 스케줄링 프로세스에 포함되었습니다. 호스트는 {2}입니다. 호스트가 공유하는 태그는 {1}입니다.
pt_br: Os seguintes hosts foram incluídos no processo de planejamento porque os hosts são elegíveis para ser incluídos no conjunto de hosts {0} tendo as seguintes tags. Os hosts são: {2}. As tags que são compartilhadas pelos hosts são: {1}.

# CDISR3052I
source: The following hosts were included in the scheduling process because the hosts are indexed in the {0} hostpool with the following tags. The hosts are: {2}. The tags that are shared by the hosts are: {1}.
ko: 호스트가 다음 태그를 포함하는 {0} 호스트 풀에서 인덱스화되어 다음 호스트가 스케줄링 프로세스에 포함되었습니다. 호스트는 {2}입니다. 호스트가 공유하는 태그는 {1}입니다.
pt_br: Os seguintes hosts foram incluídos no processo de planejamento porque os hosts são indexados no conjunto de hosts {0} com as seguintes tags. Os hosts são: {2}. As tags que são compartilhadas pelos hosts são: {1}.

# CDISR3053I
source: Because the processing element cannot be relocated, the {0} host on which it runs was included in the scheduling process.
ko: 처리 요소를 재배치할 수 없으므로 처리 요소가 실행되는 {0} 호스트가 스케줄링 프로세스에 포함되어 있습니다.
pt_br: Como o elemento de processamento não pode ser realocado, o host {0} no qual ele é executado foi incluído no processo de planejamento.

# CDISR3054I
source: Because the processing element is not affected by this operation, the {0} host on which it runs was included in the scheduling process.
ko: 이 조작이 처리 요소에 적용되지 않으므로 이 처리 요소가 실행되는 {0} 호스트가 스케줄링 프로세스에 포함되어 있습니다.
pt_br: Como o elemento de processamento não é afetado por essa operação, o host {0} no qual ele é executado foi incluído no processo de planejamento.

# CDISR3055I
source: Because the {0} host was specified as an override in the command, the host was included in the scheduling process.
ko: 명령에서 {0} 호스트를 겹쳐쓰기로 지정했으므로 호스트가 스케줄링 프로세스에 포함되어 있습니다.
pt_br: Como o host {0} foi especificado como uma substituição no comando, ele foi incluído no processo de planejamento.

# CDISR3060I
source: Because the following hosts are in an exclusive hostpool, these hosts cannot be included in the scheduling process. The hosts are: {0}.
ko: 다음 호스트가 독점 호스트 풀에 있으므로 이러한 호스트를 스케줄링 프로세스에 포함시킬 수 없습니다. 호스트는 {0}입니다.
pt_br: Como os seguintes hosts estão em um conjunto de hosts exclusivo, esses hosts não podem ser incluídos no processo de planejamento. Os hosts são: {0}.

# CDISR3061I
source: Because the following hosts are already hosting a processing element, and are therefore not eligible for an exclusive hostpool, these hosts cannot be included in the scheduling process: {0}.
ko: 다음 호스트는 이미 처리 요소를 호스팅하고 있어 독점 호스트 풀에 적합하지 않으므로 스케줄링 프로세스에 포함시킬 수 없습니다: {0}.
pt_br: Como os seguintes hosts já estão hospedando um elemento de processamento e, portanto, não são elegíveis para um conjunto de hosts exclusivo, esses hosts não podem ser incluídos no processo de planejamento: {0}.

# CDISR3062I
source: Because the following hosts have a current processing utilization that is above the threshold, these hosts cannot be included in the scheduling process: {0}.
ko: {0} 호스트의 현재 처리 사용도가 임계값을 초과하므로 이러한 호스트를 스케줄링 프로세스에 포함할 수 없습니다.
pt_br: Como a utilização de processamento atual dos hosts a seguir está acima do limite, esses hosts não podem ser incluídos no processo de planejamento: {0}.

# CDISR3063I
source: Because the following hosts already host a processing element, and therefore cannot host an operator that has a host isolation constraint, these hosts cannot be included in the scheduling process: {0}.
ko: {0} 호스트가 이미 처리 요소를 호스팅하고 있어 호스트 격리 제한조건이 있는 연산자를 호스팅할 수 없으므로 이러한 호스트를 스케줄링 프로세스에 포함할 수 없습니다.
pt_br: Como os hosts a seguir já têm um elemento de processamento e, portanto, não podem hospedar um operador que tem uma restrição de isolamento de host, esses hosts não podem ser incluídos no processo de planejamento: {0}.

# CDISR3064I
source: Because the following hosts are not in the correct state to be scheduled, these hosts were removed from the scheduling process: {0}.
ko: {0} 호스트가 스케줄할 올바른 상태가 아니므로 이러한 호스트가 스케줄링 프로세스에서 제거되었습니다.
pt_br: Como os hosts a seguir não estão no estado correto para serem planejados, eles foram removidos do processo de planejamento: {0}.

# CDISR3065I
source: Because the following hosts are not in the current instance, these hosts cannot be included in the scheduling process: {0}.
ko: {0} 호스트가 현재 인스턴스에 없으므로 이러한 호스트를 스케줄링 프로세스에 포함할 수 없습니다.
pt_br: Como os hosts a seguir não estão na instância atual, eles não poderão ser incluídos no processo de planejamento: {0}.

# CDISR3066I
source: Because the following hosts are not supported by all the operators in the partition, these hosts cannot be included in the scheduling process: {0}.
ko: {0} 호스트가 파티션의 모든 연산자에서 지원되지 않으므로 이러한 호스트를 스케줄링 프로세스에 포함할 수 없습니다.
pt_br: Como os hosts a seguir não são suportados por todos os operadores na partição, eles não poderão ser incluídos no processo de planejamento: {0}.

# CDISR3067I
source: Because the following hosts are not supported by all the operators that share a host colocation constraint, these hosts cannot be included in the scheduling process: {0}.
ko: {0} 호스트가 호스트의 동일 호스트에 배치 제한조건을 공유하는 모든 연산자에서 지원되지 않으므로 이러한 호스트를 스케줄링 프로세스에 포함할 수 없습니다.
pt_br: Como os hosts a seguir não são suportados por todos os operadores que compartilham uma restrição de colocação de host, eles não poderão ser incluídos no processo de planejamento: {0}.

# CDISR3068I
source: Because the following hosts already host an operator that shares a host exlocation constraint, these hosts cannot be included in the scheduling process: {0}.
ko: {0} 호스트가 이미 호스트 외부 배치 제한조건을 공유하는 연산자를 호스팅하므로 이러한 호스트를 스케줄링 프로세스에 포함할 수 없습니다.
pt_br: Como os hosts a seguir já hospedam um operador que compartilha uma restrição exlocation de host, esses hosts não podem ser incluídos no processo de planejamento: {0}.

# CDISR3069I
source: Because the following hosts are already referenced by a different hostpool index, these hosts cannot be included in the scheduling process: {0}.
ko: 다음 호스트는 이미 다른 호스트 풀 인덱스에서 참조되었으므로 스케줄링 프로세스에 포함시킬 수 없습니다: {0}.
pt_br: Como os seguintes hosts já foram referenciados por um índice do conjunto de hosts diferente, esses hosts não podem ser incluídos no processo de planejamento: {0}.

# CDISR3070I
source: None of the hosts can be found in the {0} hostpool. By checking the instance configuration, ensure that the hosts with the following tags are configured and started. The tags are: {1}.
ko: {0} 호스트 풀에서 호스트를 찾을 수 없습니다. 인스턴스 구성을 검사하여 다음 태그를 포함하는 호스트가 구성되고 시작되었는지 확인하십시오. 태그는 {1}입니다.
pt_br: Nenhum dos hosts pode ser localizado no conjunto de hosts {0}. Ao verificar a configuração da instância, certifique-se de que os hosts com as seguintes tags estejam configurados e iniciados. As tags são: {1}.

# CDISR3071I
source: Because the following hosts are currently hosting an operator that has a host isolation constraint, these hosts cannot be included in the scheduling process. The hosts are: {0}.
ko: 다음 호스트가 현재 호스트 격리 제한조건을 포함한 연산자를 호스팅하고 있으므로 이러한 호스트를 스케줄링 프로세스에 포함할 수 없습니다. 호스트는 {0}입니다.
pt_br: Como atualmente os hosts a seguir estão hospedando um operador que tem uma restrição de isolamento de host, esses hosts não podem ser incluídos no processo de planejamento. Os hosts são: {0}.

# CDISR3072I
source: Because the composite tag set {0} for Processing Element {1} does not meet the tag restriction set {2}, the following host cannot be included in the scheduling process {3}.
ko: 처리 요소 {1}에 대한 복합 태그 세트 {0}이(가) 태그 제한사항 세트 {2}에 맞지 않으므로 다음 호스트를 스케줄링 프로세스 {3}에 포함할 수 없습니다.
pt_br: Como a tag composta configurada {0} para o Elemento de Processamento {1} não atende à restrição de tag configurada {2}, o host a seguir não pode ser incluído no processo de planejamento {3}.

# CDISR3073I
source: Because the following hosts are not associated with the target region of the job to be scheduled, these hosts were removed from the scheduling process: {0}.
ko: {0} 호스트는 스케줄할 작업의 대상 영역과 연관되어 있지 않기 때문에 스케줄링 프로세스에서 제거되었습니다.
pt_br: Como os hosts a seguir não estão associados à região de destino da tarefa a ser planejada, eles foram removidos do processo de planejamento: {0}.

# CDISR3080I
source: The compute PE restart recommendations were requested for a scope of {0} and a scope ID of {1}.
ko: 범위 {0} 및 범위 ID {1}에 대한 계산 PE 재시작 권장사항을 요청했습니다.
pt_br: As recomendações de reinicialização do PE de cálculo foram solicitadas para um escopo de {0} e um ID de escopo de {1}.

# CDISR3081I
source: The request for compute PE restart recommendations was completed.
ko: 계산 PE 재시작 권장사항에 대한 요청을 완료했습니다.
pt_br: A solicitação para recomendações de reinicialização de PE de cálculo foi concluída.

# CDISR3083I
source: The compute placement operation started for job ID {0} and job name {1}.
ko: 작업 ID {0} 및 작업 이름 {1}에 대한 계산 배치 조작을 시작했습니다.
pt_br: A operação de posicionamento de cálculo foi iniciada para o ID da tarefa {0} e o nome da tarefa {1}.

# CDISR3084I
source: The compute placement operation for the job was completed.
ko: 작업에 대한 계산 배치 조작을 완료했습니다.
pt_br: A operação de posicionamento de cálculo para a tarefa foi concluída.

# CDISR3085E
source: The compute placement operation for the job failed.
ko: 작업에 대한 계산 배치 조작이 실패했습니다.
pt_br: A operação de posicionamento de cálculo para a tarefa falhou.

# CDISR3086I
source: The compute placement operation started for processing element ID {0} and job ID {1}.
ko: 처리 요소 ID {0} 및 작업 ID {1}에 대한 계산 배치 조작을 시작했습니다.
pt_br: A operação de posicionamento de cálculo foi iniciada para o ID de elemento de processamento {0} e ID de tarefa {1}.

# CDISR3087I
source: The compute placement operation for the processing element is finished.
ko: 처리 요소에 대한 계산 배치 조작을 완료했습니다.
pt_br: A operação de posicionamento de cálculo para o elemento de processamento foi concluída.

# CDISR3089I
source: The compute placement operation started for processing element ID {0} and job ID {1} on the {2} host.
ko: {2} 호스트에서 처리 요소 ID {0} 및 작업 ID {1}에 대한 계산 배치 조작을 시작했습니다.
pt_br: A operação de posicionamento de cálculo foi iniciada para o ID de elemento de processamento {0} e ID de tarefa {1} no host {2}.

# CDISR3090I
source: The compute placement operation started for the processing element on the host.
ko: 호스트에서 처리 요소에 대한 계산 배치 조작을 시작했습니다.
pt_br: A operação de posicionamento de cálculo foi iniciada para o elemento de processamento no host.

# CDISR3200E
source: One or more processing elements were not created from the specified operator sets.
ko: 지정된 연산자 세트에서 하나 이상의 처리 요소가 작성되지 않았습니다.
pt_br: Um ou mais elementos de processamento não foram criados a partir dos conjuntos de operadores especificados.

# CDISR3201E
source: To be fused, all operators must specify the same value for the Restartable attribute.
ko: 결합하려면 모든 연산자가 Restartable 속성에 동일한 값을 지정해야 합니다.
pt_br: Para serem fundidos, todos os operadores devem especificar o mesmo valor para o atributo Restartable.

# CDISR3202E
source: To be fused, all operators must specify the same value for the Relocatable attribute.
ko: 결합하려면 모든 연산자가 Relocatable 속성에 동일한 값을 지정해야 합니다.
pt_br: Para serem fundidos, todos os operadores devem especificar o mesmo valor para o atributo Relocatable.

# CDISR3203E
source: The operator cannot be fused with any other operator because partitionIsolation is set to true.
ko: partitionIsolation을 true로 설정했으므로 연산자를 다른 연산자와 결합할 수 없습니다.
pt_br: O operador não pode ser fundido com nenhum outro porque partitionIsolation está configurado para true.

# CDISR3204E
source: An operator with the {0} group ID and partitionExlocation specified cannot be fused with any other operator that specifies the same group ID.
ko: {0} 그룹 ID와 partitionExlocation이 지정된 연산자를 동일한 그룹 ID를 지정하는 다른 연산자와 결합할 수 없습니다.
pt_br: Um operador com o ID do grupo {0} e partitionExlocation especificados não pode ser fundido com nenhum outro operador que especifique o mesmo ID do grupo.

# CDISR3205E
source: To be fused, all operators must reference exclusive hostpool {2}. Only {0} of {1} operators satisfy this requirement.
ko: 결합하려면 모든 연산자가 독점 호스트 풀 {2}을(를) 참조해야 합니다. {1}개 중 {0}개의 연산자만 이 요구사항을 충족합니다.
pt_br: Para serem fundidos, todos os operadores devem referenciar o conjunto de hosts exclusivo {2}. Somente {0} de {1} operadores satisfazem esse requisito.

# CDISR3206E
source: To be fused, all operators must specify the same provision location value for the {0} internal property. Possible values are: {1}.
ko: 결합하려면 모든 연산자가 {0} 내부 특성에 동일한 프로비저닝 위치 값을 지정해야 합니다. 가능한 값은 {1}입니다.
pt_br: Para serem fundidos, todos os operadores devem especificar o mesmo valor de local de provisão para a propriedade interna {0}. Os valores possíveis são: {1}.

# CDISR3207E
source: To be fused, all operators must specify the same segregated location value for the {0} internal property. Possible values are: {1}.
ko: 결합하려면 모든 연산자가 {0} 내부 특성에 동일한 분리 위치 값을 지정해야 합니다. 가능한 값은 {1}입니다.
pt_br: Para serem fundidos, todos os operadores devem especificar o mesmo valor de local segregado para a propriedade interna {0}. Os valores possíveis são: {1}.

# CDISR3208E
source: To be fused, all operators must specify the {2} internal property with the following value: {3}. Only {0} of {1} operators satisfy this requirement.
ko: 결합하려면 모든 연산자가 {2} 내부 특성을 {3} 값으로 지정해야 합니다. {1}개 중 {0}개의 연산자만 이 요구사항을 충족합니다.
pt_br: Para serem fundidos, todos os operadores devem especificar a propriedade interna {2} com o valor a seguir: {3}. Somente {0} de {1} operadores satisfazem esse requisito.

# CDISR3209E
source: To be fused, all operators must specify the same host constraints. The host constraints are: {0}.
ko: 결합하려면 모든 연산자가 동일한 호스트 제한조건을 지정해야 합니다. 호스트 제한조건은 {0}입니다.
pt_br: Para serem fundidos, todos os operadores devem especificar as mesmas restrições de host. As restrições de host são: {0}.

# CDISR3210E
source: Operators that reference the hostpool with index {1} cannot be fused with other operators that reference the same hostpool with a different index {0}.
ko: 인덱스 {1}을(를) 사용하여 호스트 풀을 참조하는 연산자는 인덱스 {0}을(를) 사용하여 동일한 호스트 풀을 참조하는 다른 연산자와 결합될 수 없습니다.
pt_br: Os operadores que referenciam o conjunto de hosts com o índice {1} não podem ser fundidos com outros operadores que referenciam o mesmo conjunto de hosts com um índice {0} diferente.

# CDISR3211E
source: Operators with the same hostExlocation group ID specified or implied cannot be fused. The group ID is {0}.
ko: 동일한 hostExlocation 그룹 ID가 지정되었거나 내포된 연산자를 결합할 수 없습니다. 그룹 ID는 {0}입니다.
pt_br: Operadores com o mesmo ID do grupo hostExlocation especificado ou implícito não podem ser fundidos. O ID do grupo é {0}.

# CDISR3212I
source: The following constraints are specified for the {0} operator: {1}.
ko: {0} 연산자에 {1} 제한조건을 지정했습니다.
pt_br: As restrições a seguir são especificadas para o operador {0}: {1}.

# CDISR3213I
source: Details about the operator constraints for the {0} application bundle are in messages that follow this message.
ko: {0} 애플리케이션 번들의 연산자 제한조건에 대한 세부사항은 이 메시지 뒤에 오는 메시지에 있습니다.
pt_br: Detalhes sobre as restrições do operador para o pacote configurável do aplicativo {0} estão nas mensagens que seguem esta mensagem.

# CDISR3214I
source: The operator fusion sets for the {0} application bundle were created by using the following fusion configuration parameters: {1}.
ko: 결합 구성 매개변수 {1}을(를) 사용하여 {0} 애플리케이션 번들에 대한 연산자 결합 세트를 작성했습니다.
pt_br: Os conjuntos de fusão do operador para o pacote configurável do aplicativo {0} foram criados usando os parâmetros de configuração de fusão a seguir: {1}.

# CDISR3215I
source: A processing element will be fused from the following operator set: {0}.
ko: {0} 연산자 세트에서 처리 요소를 결합합니다.
pt_br: Um elemento de processamento será fundido a partir do conjunto de operadores a seguir: {0}.

# CDISR3216E
source: No processing elements were created from the following operator set: {0}.
ko: 연산자 세트 {0}에서 처리 요소를 작성하지 않았습니다.
pt_br: Nenhum elemento de processamento foi criado a partir do conjunto de operadores a seguir: {0}.

# CDISR3217E
source: The following job contains one or more processing elements that cannot be fused: {0}.
ko: {0} 작업에 결합할 수 없는 하나 이상의 처리 요소가 포함되어 있습니다.
pt_br: A tarefa a seguir contém um ou mais elementos de processamento que não podem ser fundidos: {0}.

# CDISR3218E
source: The required {0} attribute is not in the {1} section or has no members.
ko: 필수 {0} 속성이 {1} 섹션에 없거나 멤버를 포함하지 않습니다.
pt_br: O atributo {0} obrigatório não está na seção {1} ou não tem membros.

# CDISR3219E
source: The {0} value is not unique for the {1} attribute. This attribute is in the following section: {2}.
ko: {1} 속성에 대해 {0} 값이 고유하지 않습니다. 이 속성은 {2} 섹션에 있습니다.
pt_br: O valor {0} não é exclusivo para o atributo {1}. Esse atributo está na seguinte seção: {2}.

# CDISR3220E
source: Multiple resource configurations are not allowed for the {0} operator.
ko: {0} 연산자에 다중 자원 구성이 허용되지 않습니다.
pt_br: Várias configurações de recurso não são permitidas para o operador {0}.
