Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA0001I
source: The operation was completed.
de: Die Operation wurde abgeschlossen.
ja: 操作が完了しました。
ru: Операция выполнена.
zh_cn: 该操作已完成。

# CDISA0002I
source: The following command was canceled: {0}.
de: Der folgende Befehl wurde abgebrochen: {0}.
ja: 次のコマンドはキャンセルされました: {0}。
ru: Отменена следующая команда: {0}.
zh_cn: 已取消以下命令：{0}。

# CDISA0003I
source: The {0} build is waiting. The build resource must complete {1} builds before the build will start.
de: Build {0} ist im Wartestatus. Die Buildressource muss {1} Builds abschließen, bevor der Build gestartet wird.
ja: {0} ビルドが待機しています。このビルドを開始する前にビルド・リソースは {1} 個のビルドを完了する必要があります。
ru: Сборка {0} ожидает. Ресурс сборки должен завершить сборки в количестве {1}, прежде чем запустится сборка.
zh_cn: {0} 构建正在等待。构建资源必须先完成 {1} 个构建，然后该构建才会启动。

# CDISA0004I
source: The {0} build is waiting for an available build controller.
de: Der Build {0} wartet auf einen verfügbaren Build-Controller.
ja: {0} ビルドは、使用可能なビルド・コントローラーを待機しています。
ru: Сборка {0} ожидает доступного контроллера сборки.
zh_cn: {0} 构建正在等待可用构建控制器。

# CDISA0006I
source: Dynamic allocation of management resources is enabled for the following instance: {0}.
de: Die dynamische Zuordnung von Managementressourcen ist für die folgende Instanz aktiviert: {0}.
ja: 管理リソースの動的割り振りが次のインスタンスに対して有効です: {0}。
ru: Динамическое выделение ресурсов управления включено для следующего экземпляра: {0}.
zh_cn: 对以下实例启用了动态分配管理资源：{0}。

# CDISA0007I
source: Dynamic allocation of application resources is enabled for the following instance: {0}.
de: Die dynamische Zuordnung von Anwendungsressourcen ist für die folgende Instanz aktiviert: {0}.
ja: アプリケーション・リソースの動的割り振りが次のインスタンスに対して有効です: {0}。
ru: Динамическое выделение ресурсов приложений включено для следующего экземпляра: {0}.
zh_cn: 对以下实例启用了动态分配应用程序资源：{0}。

# CDISA0008I
source: The installation directory for this package is: {0}. The installation is owned by the {1} user and the {2} group. You can edit these values in the response file of the package.
de: Installationsverzeichnis für dieses Paket: {0}. Die Installation gehört dem Benutzer {1} und der Gruppe {2}. Sie können diese Werte in der Antwortdatei des Pakets bearbeiten.
ja: このパッケージのインストール・ディレクトリーは {0} です。インストールは、{1} ユーザーおよび {2} グループによって所有されています。パッケージの応答ファイルでこれらの値を編集できます。
ru: Каталогом установки для этого пакета является каталог {0}. Владельцем установки является пользователь {1} и группа {2}. Эти значения можно изменить в файле ответов для пакета.
zh_cn: 此软件包的安装目录为 {0}。安装所有者为 {1} 用户和 {2} 组。您可以在此软件包的响应文件中编辑这些值。

# CDISA0009I
source: The setup script in this package configures the domain controller to run as an unregistered service for the following domain: {0}. If the domain does not exist, or is not started, you must run the setup script as user root.
de: Das Setup-Script in diesem Paket konfiguriert den Domänencontroller für die Ausführung als nicht registrierter Service für die folgende Domäne: {0}. Ist die Domäne nicht vorhanden oder nicht gestartet, müssen Sie das Setup-Script als Rootbenutzer ausführen.
ja: このパッケージのセットアップ・スクリプトは、次のドメインの未登録サービスとして実行するようにドメイン・コントローラーを構成します: {0}。ドメインが存在しないか開始されていない場合、root ユーザーとしてセットアップ・スクリプトを実行する必要があります。
ru: Сценарий настройки в этом пакете конфигурирует контроллер домена для работы в качестве незарегистрированной службы для следующего домена: {0}. Если домен не существует или не запущен, вы должны запустить сценарий настройки от имени пользователя root.
zh_cn: 此软件包中的设置脚本会配置 {0} 域的域控制器，使其作为未注册的服务来运行。如果该域不存在或未启动，您必须以 root 用户身份运行此设置脚本。

# CDISA0010I
source: The {0} service started on the following resource for the {2} domain in the {4} ZooKeeper ensemble: {1}. The service has the following process id: {3}.
de: Der Service {0} wurde in der folgenden Ressource für die Domäne {2} im ZooKeeper-Ensemble {4} gestartet: {1}. Der Service hat die folgende Prozess-ID: {3}.
ja: {0} サービスが、{4} ZooKeeper アンサンブル内の {2} ドメインの次のリソースで開始されました: {1}。サービスのプロセス ID は {3} です。
ru: Служба {0} запущена на следующем ресурсе для домена {2} в комплекте ZooKeeper {4}: {1}. ID процесса службы: {3}.
zh_cn: 已在 ZooKeeper 整体 {4} 中的 {2} 域的 {1} 资源上启动 {0} 服务。该服务具有进程标识 {3}。

# CDISA0011I
source: The {0} service started on the {1} resource for the following domain: {2}.
de: Der Service {0} wurde in der Ressource {1} für die folgende Domäne gestartet: {2}.
ja: {0} サービスが次のドメインの {1} リソースで開始しました: {2}。
ru: Служба {0} запущена на ресурсе {1} для следующего домена: {2}.
zh_cn: 已在 {2} 域的 {1} 资源上启动 {0} 服务。

# CDISA0012I
source: The controller service restarted on the following resource: {0}. The controller recovered {1} Processing Elements for the {2} job with id {3}. The job is running in the following instance: {4}.
de: Der Controller-Service wurde in der folgenden Ressource erneut gestartet: {0}. Der Controller hat {1} Verarbeitungselemente für den Job {2} mit der ID {3} wiederhergestellt. Der Job wird in der folgenden Instanz ausgeführt: {4}.
ja: コントローラー・サービスが次のリソースで再始動されました: {0}。コントローラーが、ID {3} の {2} ジョブの {1} 処理要素を復旧しました。ジョブは次のインスタンスで実行中です: {4}。
ru: Служба контроллера перезапустилась на следующем ресурсе: {0}. Контроллер восстановил элементы обработки в количестве {1} для задания {2} с ID {3}. Задание работает на следующем экземпляре: {4}.
zh_cn: 已在 {0} 资源上重新启动控制器服务。控制器已恢复标识为 {3} 的 {2} 作业的 {1} 个处理元素。该作业正在 {4} 实例中运行。

# CDISA0013I
source: The Streams Web Service was started.
de: Der Streams-Web-Service wurde gestartet.
ja: Streams Web サービスが開始されました。
ru: Streams Web Service запущена.
zh_cn: Streams Web Service 已启动。

# CDISA0014I
source: The Streams Web Service was stopped.
de: Der Streams-Web-Service wurde gestoppt.
ja: Streams Web サービスが停止されました。
ru: Streams Web Service остановлена.
zh_cn: Streams Web Service 已停止。

# CDISA0015I
source: The log setting of the Streams Web Service was changed to the following value: {0}.
de: Die Protokolleinstellung für den Streams-Web-Service wurde in den folgenden Wert geändert: {0}.
ja: Streams Web サービスのログ設定が次の値に変更されました: {0}。
ru: Параметр журнала веб-службы потоков изменен на следующее значение: {0}.
zh_cn: Streams Web Service 的日志设置已更改为值 {0}。

# CDISA0016I
source: The trace setting of the Streams Web Service was changed to the following value: {0}.
de: Die Traceeinstellung für den Streams-Web-Service wurde in den folgenden Wert geändert: {0}.
ja: Streams Web サービスのトレース設定が次の値に変更されました: {0}。
ru: Параметр трассировки веб-службы потоков изменен на следующее значение: {0}.
zh_cn: Streams Web Service 的跟踪设置已更改为值 {0}。

# CDISA0017I
source: Creating the following domain: {0}.
de: Die folgende Domäne wird erstellt: {0}.
ja: 次のドメインの作成中: {0}。
ru: Создается следующий домен: {0}
zh_cn: 正在创建 {0} 域。

# CDISA0018I
source: The following domain was created successfully: {0}.
de: Die folgende Domäne wurde erfolgreich erstellt: {0}.
ja: 次のドメインが正常に作成されました: {0}。
ru: Следующий домен успешно создан: {0}.
zh_cn: 已成功创建 {0} 域。

# CDISA0019I
source: Removing the following domain: {0}.
de: Die folgende Domäne wird entfernt: {0}.
ja: 次のドメインの削除中: {0}。
ru: Удаляется следующий домен: {0}
zh_cn: 正在移除 {0} 域。

# CDISA0020I
source: The following domain was removed successfully: {0}.
de: Die folgende Domäne wurde erfolgreich entfernt: {0}.
ja: 次のドメインが正常に削除されました: {0}。
ru: Следующий домен успешно удален: {0}.
zh_cn: 已成功移除 {0} 域。

# CDISA0021I
source: Starting the following domain: {0}.
de: Die folgende Domäne wird gestartet: {0}.
ja: 次のドメインの開始中: {0}。
ru: Запускается следующий домен: {0}
zh_cn: 正在启动 {0} 域。

# CDISA0022I
source: The following domain started successfully: {0}.
de: Die folgende Domäne wurde erfolgreich gestartet: {0}.
ja: 次のドメインが正常に開始しました: {0}。
ru: Следующий домен успешно запущен: {0}.
zh_cn: 已成功启动 {0} 域。

# CDISA0023I
source: Stopping the following domain: {0}.
de: Die folgende Domäne wird gestoppt: {0}.
ja: 次のドメインの停止中: {0}。
ru: Останавливается следующий домен: {0}
zh_cn: 正在停止 {0} 域。

# CDISA0024I
source: The following domain stopped successfully: {0}.
de: Die folgende Domäne wurde erfolgreich gestoppt: {0}.
ja: 次のドメインが正常に停止しました: {0}。
ru: Следующий домен успешно остановлен: {0}.
zh_cn: 已成功停止 {0} 域。

# CDISA0025I
source: Cleaning the {0} resource for the following domain: {1}.
de: Die Ressource {0} wird für die folgende Domäne bereinigt: {1}.
ja: 次のドメインの {0} リソースのクリーンアップ中: {1}。
ru: Очищается ресурс {0} для следующего домена: {1}.
zh_cn: 正在清除 {1} 域的 {0} 资源。

# CDISA0026I
source: Creating the {0} instance for the following domain: {1}.
de: Die Instanz {0} wird für die folgende Domäne erstellt: {1}.
ja: 次のドメインの {0} インスタンスの作成中: {1}。
ru: Создается экземпляр {0} для следующего домена: {1}.
zh_cn: 正在为 {1} 域创建 {0} 实例。

# CDISA0027I
source: The {0} instance was created successfully for the following domain: {1}.
de: Die Instanz {0} wurde erfolgreich für die folgende Domäne erstellt: {1}.
ja: 次のドメインの {0} インスタンスが正常に作成されました: {1}。
ru: Экземпляр {0} успешно создан для следующего домена: {1}.
zh_cn: 已成功为 {1} 域创建 {0} 实例。

# CDISA0028I
source: Removing the {0} instance from the following domain {1}.
de: Die Instanz {0} wird aus der folgenden Domäne entfernt: {1}.
ja: 次のドメインから {0} インスタンスを削除中: {1}。
ru: Удаляется экземпляр {0} из следующего домена {1}.
zh_cn: 正在从 {1} 域中移除 {0} 实例。

# CDISA0029I
source: The {0} instance was removed successfully from the following domain {1}.
de: Die Instanz {0} wurde erfolgreich aus der folgenden Domäne entfernt: {1}.
ja: {0} インスタンスが次のドメインから正常に削除されました: {1}。
ru: Экземпляр {0} успешно удален из следующего домена: {1}.
zh_cn: 已成功从 {1} 域中移除 {0} 实例。

# CDISA0030I
source: Starting the {0} instance for the following domain: {1}.
de: Die Instanz {0} wird für die folgende Domäne gestartet: {1}.
ja: 次のドメインの {0} インスタンスの開始中: {1}。
ru: Запускается экземпляр {0} для следующего домена: {1}.
zh_cn: 正在针对 {1} 域启动 {0} 实例。

# CDISA0031I
source: The {0} instance started successfully for the following domain: {1}.
de: Die Instanz {0} wurde erfolgreich für die folgende Domäne gestartet: {1}.
ja: 次のドメインの {0} インスタンスが正常に開始しました: {1}。
ru: Экземпляр {0} успешно запущен для следующего домена: {1}.
zh_cn: 已针对 {1} 域成功启动 {0} 实例。

# CDISA0032I
source: Stopping the {0} instance for the following domain: {1}.
de: Die Instanz {0} wird für die folgende Domäne gestoppt: {1}.
ja: 次のドメインの {0} インスタンスの停止中: {1}。
ru: Останавливается экземпляр {0} для следующего домена: {1}.
zh_cn: 正在针对 {1} 域停止 {0} 实例。

# CDISA0033I
source: The {0} instance stopped successfully for the following domain: {1}.
de: Die Instanz {0} wurde erfolgreich für die folgende Domäne gestoppt: {1}.
ja: 次のドメインの {0} インスタンスが正常に停止しました: {1}。
ru: Экземпляр {0} успешно остановлен для следующего домена: {1}.
zh_cn: 已针对 {1} 域成功停止 {0} 实例。

# CDISA0034I
source: Waiting for all services to start.
de: Es wird auf den Start aller Services gewartet.
ja: すべてのサービスが開始するまで待機中。
ru: Ожидание запуска всех служб.
zh_cn: 正在等待所有服务启动。

# CDISA0035I
source: Waiting for all services to stop.
de: Es wird auf das Stoppen aller Services gewartet.
ja: すべてのサービスが停止するまで待機中。
ru: Ожидание остановки всех служб.
zh_cn: 正在等待所有服务停止。

# CDISA0036I
source: Updating services for the following domain {0}. This may take a few minutes to complete.
de: Services für die folgende Domäne werden aktualisiert: {0}. Dies kann einige Minuten dauern.
ja: 次のドメインのサービスを更新中: {0}。これが完了するまで、数分かかる場合があります。
ru: Обновляются службы для следующего домена {0}. Это может занять несколько минут.
zh_cn: 正在更新 {0} 域的服务。这可能需要几分钟时间才能完成。

# CDISA0037I
source: Starting the {0} service on the following resource: {1}.
de: Der Service {0} wird in der folgenden Ressource gestartet: {1}.
ja: 次のリソース上で {0} サービスを開始中: {1}。
ru: Запускается служба {0} на следующем ресурсе: {1}.
zh_cn: 正在 {1} 资源上启动 {0} 服务。

# CDISA0038I
source: The {0} service started on the following resource: {1}. The service has the following process id: {2}.
de: Der Service {0} wurde in der folgenden Ressource gestartet: {1}. Der Service hat die folgende Prozess-ID: {2}.
ja: 次のリソース上で {0} サービスが開始しました: {1}。サービスのプロセス ID は {2} です。
ru: Служба {0} запущена на ресурсе {1}. ID процесса службы: {2}.
zh_cn: 已在 {1} 资源上启动 {0} 服务。该服务具有进程标识 {2}。

# CDISA0039I
source: The {0} service started on the following resource: {1}. The service has the following process id: {2}. The service uses the following port: {3}.
de: Der Service {0} wurde in der folgenden Ressource gestartet: {1}. Der Service hat die folgende Prozess-ID: {2}. Der Service verwendet den folgenden Port: {3}.
ja: 次のリソース上で {0} サービスが開始しました: {1}。サービスのプロセス ID は {2} です。サービスは次のポートを使用しています: {3}。
ru: Служба {0} запущена на ресурсе {1}. ID процесса службы: {2}. Служба использует следующий порта: {3}.
zh_cn: 已在 {1} 资源上启动 {0} 服务。该服务具有进程标识 {2}。该服务使用端口 {3}。

# CDISA0040I
source: {0} of {1} {2} services started on the following resource: {3}. The service has the following process id: {4}.
de: {0} von {1} {2}-Services wurden in der folgenden Ressource gestartet: {3}. Der Service hat die folgende Prozess-ID: {4}.
ja: {1} 個の {2} サービスのうち {0} 個が次のリソースで開始しました: {3}。サービスのプロセス ID は {4} です。
ru: Службы в количестве {0} из {1} {2} запущены на следующем ресурсе: {3}. ID процесса службы: {4}.
zh_cn: 已在 {3} 资源上启动 {0} 个（共 {1} 个）{2} 服务。该服务具有进程标识 {4}。

# CDISA0041I
source: Stopping the {0} service on the following resource: {1}. The service has the following process id: {2}.
de: Der Service {0} wird in der folgenden Ressource gestoppt: {1}. Der Service hat die folgende Prozess-ID: {2}.
ja: 次のリソース上で {0} サービスを停止中: {1}。サービスのプロセス ID は {2} です。
ru: Останавливается служба {0} на следующем ресурсе: {1}. ID процесса службы: {2}.
zh_cn: 正在 {1} 资源上停止 {0} 服务。该服务具有进程标识 {2}。

# CDISA0042I
source: The {0} service stopped on the following resource: {1}. The service had the following process id: {2}.
de: Der Service {0} wurde in der folgenden Ressource gestoppt: {1}. Der Service hat die folgende Prozess-ID: {2}.
ja: 次のリソース上で {0} サービスが停止しました: {1}。サービスのプロセス ID は {2} です。
ru: Служба {0} остановлена на ресурсе {1}. У службы был следующий ID процесса: {2}.
zh_cn: 已在 {1} 资源上停止 {0} 服务。该服务具有进程标识 {2}。

# CDISA0043I
source: Verifying controller services are started on all configured hosts.
de: Es wird geprüft, ob die Controller-Services auf allen konfigurierten Hosts gestartet sind.
ja: 構成されているすべてのホストでコントローラー・サービスの検証が開始されました。
ru: Проверка служб контроллера запущена на всех сконфигурированных хостах.
zh_cn: 正在验证是否在所有已配置的主机上启动了控制器服务。

# CDISA0044I
source: {0} of {1} {2} services started on the following resource: {3}. The service has the following process id: {4}. The service uses the following port number: {5}.
de: {0} von {1} {2}-Services wurden in der folgenden Ressource gestartet: {3}. Der Service hat die folgende Prozess-ID: {4}. Der Service verwendet die folgende Portnummer: {5}.
ja: {1} 個の {2} サービスのうち {0} 個が次のリソースで開始しました: {3}。サービスのプロセス ID は {4} です。サービスは次のポート番号を使用しています: {5}。
ru: Службы в количестве {0} из {1} {2} запущены на следующем ресурсе: {3}. ID процесса службы: {4}. Служба использует следующий номер порта: {5}.
zh_cn: 已在 {3} 资源上启动 {0} 个（共 {1} 个）{2} 服务。该服务具有进程标识 {4}。该服务使用端口号 {5}。

# CDISA0045I
source: The {0} resource was registered with the following domain: {1}.
de: Die Ressource {0} wurde bei der folgenden Domäne registriert: {1}.
ja: {0} リソースが次のドメインに登録されました: {1}。
ru: Ресурс {0} зарегистрирован на следующем домене: {1}.
zh_cn: 已向 {1} 域注册 {0} 资源。

# CDISA0046I
source: The {0} system service was registered on the {1} resource for the following domain: {2}.
de: Der Systemservice {0} wurde in der Ressource {1} für die folgende Domäne registriert: {2}.
ja: {0} システム・サービスが次のドメインの {1} リソースで登録されました: {2}。
ru: Системная служба {0} зарегистрирована на ресурсе {1} для следующего домена: {2}.
zh_cn: 已在 {2} 域的 {1} 资源上注册 {0} 系统服务。

# CDISA0047I
source: The {0} resource was unregistered from the following domain: {1}.
de: Die Registrierung der Ressource {0} bei der folgenden Domäne wurde zurückgenommen: {1}.
ja: {0} リソースが次のドメインから登録抹消されました: {1}。
ru: Ресурс {0} дерегистрирован на следующем домене: {1}.
zh_cn: 已从 {1} 域中注销 {0} 资源。

# CDISA0048I
source: The {0} system service was unregistered on the {1} resource for the following domain: {2}.
de: Die Registrierung des Systemservice {0} bei der folgenden Domäne wurde in der Ressource {1} zurückgenommen: {2}.
ja: {0} システム・サービスが次のドメインの {1} リソースで登録抹消されました: {2}。
ru: Системная служба {0} дерегистрирована на ресурсе {1} для следующего домена: {2}.
zh_cn: 已在 {2} 域的 {1} 资源上注销 {0} 系统服务。

# CDISA0049I
source: Starting the {0} system service. The service is starting on the {1} resource for the following domain: {2}.
de: Der Systemservice {0} wird gestartet. Der Service wird in der Ressource {1} für die folgende Domäne gestartet: {2}.
ja: {0} システム・サービスの開始中。サービスは次のドメインの {1} リソースで開始しています: {2}。
ru: Запуск системной службы {0}. Служба запускается на ресурсе {1} для следующего домена: {2}.
zh_cn: 正在启动 {0} 系统服务。该服务正在 {2} 域的 {1} 资源上启动。

# CDISA0050I
source: The {0} service started successfully. The service started on the {1} resource for the following domain: {2}.
de: Der Service {0} wurde erfolgreich gestartet. Der Service wurde in der Ressource {1} für die folgende Domäne gestartet: {2}.
ja: {0} サービスが正常に開始しました。サービスが次のドメインの {1} リソースで開始しました: {2}。
ru: Служба {0} успешно запущена. Служба запущена на ресурсе {1} для следующего домена: {2}.
zh_cn: 已成功启动 {0} 服务。在 {2} 域的 {1} 资源上启动了该服务。

# CDISA0051I
source: Stopping the {0} service. The service is stopping on the {1} resource for the following domain: {2}.
de: Der Service {0} wird gestoppt. Der Service wird in der Ressource {1} für die folgende Domäne gestoppt: {2}.
ja: {0} サービスの停止中。サービスは次のドメインの {1} リソースで停止しています: {2}。
ru: Останавливается служба {0}. Служба останавливается на ресурсе {1} для следующего домена: {2}.
zh_cn: 正在停止 {0} 服务。正在 {2} 域的 {1} 资源上停止该服务。

# CDISA0052I
source: The {0} service stopped successfully. The service stopped on the {1} resource for the following domain: {2}.
de: Der Service {0} wurde erfolgreich gestoppt. Der Service wurde in der Ressource {1} für die folgende Domäne gestoppt: {2}.
ja: {0} サービスが正常に停止しました。サービスが次のドメインの {1} リソースで停止しました: {2}。
ru: Служба {0} успешно остановлена. Служба остановлена на ресурсе {1} для следующего домена: {2}.
zh_cn: 已成功停止 {0} 服务。在 {2} 域的 {1} 资源上停止了该服务。

# CDISA0053I
source: The {0} service is started on the {1} resource for the following domain: {2}.
de: Der Service {0} wird in der Ressource {1} für die folgende Domäne gestartet: {2}.
ja: {0} サービスが次のドメインの {1} リソースで開始されました: {2}。
ru: Служба {0} запущена на ресурсе {1} для следующего домена: {2}.
zh_cn: 已在 {2} 域的 {1} 资源上启动 {0} 服务。

# CDISA0054I
source: The {0} service is stopped. The service is stopped on the {1} resource for the following domain: {2}.
de: Der Service {0} ist gestoppt. Der Service ist in der Ressource {1} für die folgende Domäne gestoppt: {2}.
ja: {0} サービスが停止されました。サービスは次のドメインの {1} リソースで停止されました: {2}。
ru: Служба {0} остановлена. Служба остановлена на ресурсе {1} для следующего домена: {2}.
zh_cn: 已停止 {0} 服务。在 {2} 域的 {1} 资源上停止了该服务。

# CDISA0055I
source: Application logs are not available on the {0} resource for the following domain: {1}.
de: Anwendungsprotokolle sind in der Ressource {0} für die folgende Domäne nicht verfügbar: {1}.
ja: 次のドメインの {0} リソースでアプリケーション・ログが使用可能でありません: {1}。
ru: Журналы приложения недоступны на ресурсе {0} для следующего домена: {1}.
zh_cn: 在 {1} 域的 {0} 资源上未提供应用程序日志。

# CDISA0056I
source: All applications for the {0} instance in the {1} domain will run as the following user: {2}.
de: Alle Anwendungen für die Instanz {0} in der Domäne {1} werden als folgender Benutzer ausgeführt: {2}.
ja: {1} ドメイン内の {0} インスタンスのすべてのアプリケーションは次のユーザーとして実行されます: {2}。
ru: Все приложения для экземпляра {0} в домене {1} будут работать от имени следующего пользователя: {2}.
zh_cn: {1} 域中的 {0} 实例的所有应用程序都将以 {2} 用户身份运行。

# CDISA0057I
source: The {0} service is restarting on the following resource: {2}. The resource is allocated to the following domain: {3}. The service has the following process id: {1}.
de: Der Service {0} wird in der folgenden Ressource erneut gestartet: {2}. Die Ressource ist der folgenden Domäne zugeordnet: {3}. Der Service hat die folgende Prozess-ID: {1}.
ja: 次のリソース上で {0} サービスが再始動しています: {2}。リソースは次のドメインに割り振られています: {3}。サービスのプロセス ID は {1} です。
ru: Служба {0} перезапускается на ресурсе {2}. Ресурс выделен домену {3}. ID процесса службы: {1}.
zh_cn: 正在 {2} 资源上重新启动 {0} 服务。该资源已分配到 {3} 域。该服务具有进程标识 {1}。

# CDISA0058I
source: The {0} service is restarting on the following resource: {2}. The resource is allocated to the {3} instance for the following domain: {4}. The service has the following process id: {1}.
de: Der Service {0} wird in der folgenden Ressource erneut gestartet: {2}. Die Ressource ist der Instanz {3} für die folgende Domäne zugeordnet: {4}. Der Service hat die folgende Prozess-ID: {1}.
ja: 次のリソース上で {0} サービスが再始動しています: {2}。リソースは次のドメインの {3} インスタンスに割り振られています: {4}。サービスのプロセス ID は {1} です。
ru: Служба {0} перезапускается на ресурсе {2}. Ресурс выделен экземпляру {3} для домена {4}. ID процесса службы: {1}.
zh_cn: 正在 {2} 资源上重新启动 {0} 服务。该资源已分配到 {4} 域的 {3} 实例。该服务具有进程标识 {1}。

# CDISA0059I
source: Updating services for the following instance: {0}. This may take a few minutes to complete.
de: Services für die folgende Instanz werden aktualisiert: {0}. Dies kann einige Minuten dauern.
ja: 次のインスタンスのサービスを更新中: {0}。これが完了するまで、数分かかる場合があります。
ru: Обновляются службы для следующего экземпляра: {0}. Это может занять несколько минут.
zh_cn: 正在更新 {0} 实例的服务。这可能需要几分钟时间才能完成。

# CDISA0060I
source: Acquiring lock for the following domain: {0}.
de: Eine Sperre für die folgende Domäne wird angefordert: {0}.
ja: 次のドメインのロックを獲得中: {0}。
ru: Производится получение блокировки для следующего домена: {0}.
zh_cn: 正在获取对 {0} 域的锁定。

# CDISA0061I
source: Acquiring lock for the {0} instance in the following domain: {1}.
de: Eine Sperre für die Instanz {0} in der folgenden Domäne wird angefordert: {1}.
ja: 次のドメイン内の {0} インスタンスのロックを獲得中: {1}。
ru: Производится получение блокировки для экземпляра {0} в следующем домене: {1}.
zh_cn: 正在获取对 {1} 域中的 {0} 实例的锁定。

# CDISA0062I
source: ZooKeeper started with the following configuration settings: {0}.
de: ZooKeeper wurde mit den folgenden Konfigurationseinstellungen gestartet: {0}.
ja: ZooKeeper が次の構成設定で開始しました: {0}。
ru: Компонент ZooKeeper запущен с использованием следующих параметров конфигурации: {0}.
zh_cn: 已使用下列配置设置启动 ZooKeeper：{0}。

# CDISA0063I
source: ZooKeeper stopped with the following configuration settings: {0}.
de: ZooKeeper wurde mit den folgenden Konfigurationseinstellungen gestoppt: {0}.
ja: ZooKeeper が次の構成設定で停止しました: {0}。
ru: Компонент ZooKeeper остановлен с использованием следующих параметров конфигурации: {0}.
zh_cn: 已使用下列配置设置停止 ZooKeeper：{0}。

# CDISA0064I
source: Starting the authentication and auditing services for the following domain: {0}.
de: Der Authentifizierungsservice und der Prüfungsservice werden für die folgende Domäne gestartet: {0}.
ja: 次のドメインの認証および監査サービスを開始中: {0}。
ru: Запуск служб аутентификации и аудита для следующего домена: {0}.
zh_cn: 正在针对 {0} 域启动认证与审计服务。

# CDISA0065I
source: Stopping the authentication and auditing services for the following domain: {0}.
de: Der Authentifizierungsservice und der Prüfungsservice werden für die folgende Domäne gestoppt: {0}.
ja: 次のドメインの認証および監査サービスを停止中: {0}。
ru: Остановка служб аутентификации и аудита для следующего домена: {0}.
zh_cn: 正在针对 {0} 域停止认证与审计服务。

# CDISA0066I
source: The following domain does not exist: {0}.
de: Die folgende Domäne ist nicht vorhanden: {0}.
ja: 次のドメインは存在しません: {0}。
ru: Следующий домен не существует: {0}.
zh_cn: {0} 域不存在。

# CDISA0067I
source: Placing the {0} service on the following resource: {1}.
de: Der Service {0} wird in der folgenden Ressource verteilt: {1}.
ja: 次のリソース上に {0} サービスを配置中: {1}。
ru: Служба {0} помещается на следующий ресурс: {1}.
zh_cn: 正在将 {0} 服务放置在 {1} 资源上。
