Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA3032W
source: The {0} service failed to stop on the following resource: {1}. Attempting to kill the following process id: {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestoppt werden: {1}. Es wird versucht, den Prozess mit der folgenden ID abzubrechen: {2}.
ja: 次のリソース上で {0} サービスの停止に失敗しました: {1}。次のプロセス ID の強制終了を試行します: {2}。
ru: Не удалось запустить службу {0} на ресурсе: {1}. Попытка уничтожить следующий ID процесса: {2}.
zh_cn: 无法在 {1} 资源上停止 {0} 服务。正在尝试终止进程标识 {2}。

# CDISA3033W
source: {0} of {1} {2} services failed to stop on the following resource: {3}. Attempting to kill the following process id: {4}.
de: {0} von {1} {2}-Services konnten in der folgenden Ressource nicht gestoppt werden: {3}. Es wird versucht, den Prozess mit der folgenden ID zu beenden: {4}.
ja: {1} 個の {2} サービスのうち {0} 個が次のリソースで停止に失敗しました: {3}。次のプロセス ID の強制終了を試行します: {4}。
ru: Не удалось остановить службы {2} в количестве {0} из {1} на следующем ресурсе: {3}. Попытка уничтожить следующий ID процесса: {4}.
zh_cn: 无法在 {3} 资源上停止 {0} 个（共 {1} 个）{2} 服务。正在尝试终止进程标识 {4}。

# CDISA3034W
source: The {0} service terminated on the following resource: {2}. The resource is allocated to the following domain: {3}. The service had the following process id: {1}. Attempting to restart the service.
de: Der Service {0} wurde in der folgenden Ressource beendet: {2}. Die Ressource ist der folgenden Domäne zugeordnet: {3}. Der Service hatte die folgende Prozess-ID: {1}. Es wird versucht, den Service erneut zu starten.
ja: 次のリソース上で {0} サービスが強制終了されました: {2}。リソースは次のドメインに割り振られています: {3}。サービスのプロセス ID は {1} です。サービスの再始動を試行します。
ru: Служба {0} прекращена на ресурсе {2}. Ресурс выделен домену {3}. У службы был следующий ID процесса: {1}. Попытка перезапустить службу.
zh_cn: 已在 {2} 资源上终止 {0} 服务。该资源已分配到 {3} 域。该服务具有进程标识 {1}。正在尝试重新启动该服务。

# CDISA3035W
source: The {0} service is not responding on the following resource: {1}. The resource is allocated to the following domain: {2}. Attempting to restart the service.
de: Der Service {0} antwortet in der folgenden Ressource nicht: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}. Es wird versucht, den Service erneut zu starten.
ja: 次のリソース上で {0} サービスが応答していません: {1}。リソースは次のドメインに割り振られています: {2}。サービスの再始動を試行します。
ru: Служба {0} не отвечает на ресурсе {1}. Ресурс выделен домену {2}. Попытка перезапустить службу.
zh_cn: {1} 资源上的 {0} 服务未响应。该资源已分配到 {2} 域。正在尝试重新启动该服务。

# CDISA3036W
source: Running {0} of {1} {2} services on the following resource: {3}. The resource is allocated to the following domain: {4}. Attempting to start additional services.
de: {0} von {1} {2}-Services werden in der folgenden Ressource ausgeführt: {3}. Die Ressource ist der folgenden Domäne zugeordnet: {4}. Es wird versucht, zusätzliche Services zu starten.
ja: 次のリソースで {1} 個の {2} サービスのうち {0} 個を実行中: {3}。リソースは次のドメインに割り振られています: {4}。追加サービスの開始を試行します。
ru: Запускаются службы {2} в количестве {0} из {1} на следующем ресурсе: {3}. Ресурс выделен домену {4}. Попытка запустить дополнительные службы.
zh_cn: 正在 {3} 资源上运行 {0} 个（共 {1} 个）{2} 服务。该资源已分配到 {4} 域。正在尝试启动其他服务。

# CDISA3037W
source: The {0} service terminated on the following resource: {2}. The resource is allocated to the {3} instance for the following domain: {4}. The service had the following process id: {1}. Attempting to restart the service.
de: Der Service {0} wurde in der folgenden Ressource beendet: {2}. Die Ressource ist der Instanz {3} für die folgende Domäne zugeordnet: {4}. Der Service hatte die folgende Prozess-ID: {1}. Es wird versucht, den Service erneut zu starten.
ja: 次のリソース上で {0} サービスが強制終了されました: {2}。リソースは次のドメインの {3} インスタンスに割り振られています: {4}。サービスのプロセス ID は {1} です。サービスの再始動を試行します。
ru: Служба {0} прекращена на ресурсе {2}. Ресурс выделен экземпляру {3} для домена {4}. У службы был следующий ID процесса: {1}. Попытка перезапустить службу.
zh_cn: 已在 {2} 资源上终止 {0} 服务。该资源已分配到 {4} 域的 {3} 实例。该服务具有进程标识 {1}。正在尝试重新启动该服务。

# CDISA3038W
source: The {0} service is not responding on the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}. Attempting to restart the service.
de: Der Service {0} antwortet in der folgenden Ressource nicht: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}. Es wird versucht, den Service erneut zu starten.
ja: 次のリソース上で {0} サービスが応答していません: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。サービスの再始動を試行します。
ru: Служба {0} не отвечает на ресурсе {1}. Ресурс выделен экземпляру {2} для домена {3}. Попытка перезапустить службу.
zh_cn: {1} 资源上的 {0} 服务未响应。该资源已分配到 {3} 域的 {2} 实例。正在尝试重新启动该服务。

# CDISA3039W
source: Running {0} of {1} {2} services on the following resource: {3}. The resource is allocated to the {4} instance for the following domain: {5}. Attempting to start additional services.
de: {0} von {1} {2}-Services werden in der folgenden Ressource ausgeführt: {3}. Die Ressource ist der Instanz {4} für die folgende Domäne zugeordnet: {5}. Es wird versucht, zusätzliche Services zu starten.
ja: 次のリソースで {1} 個の {2} サービスのうち {0} 個を実行中: {3}。リソースは次のドメインの {4} インスタンスに割り振られています: {5}。追加サービスの開始を試行します。
ru: Запускаются службы {2} в количестве {0} из {1} на следующем ресурсе: {3}. Ресурс выделен экземпляру {4} для домена {5}. Попытка запустить дополнительные службы.
zh_cn: 正在 {3} 资源上运行 {0} 个（共 {1} 个）{2} 服务。该资源已分配到 {5} 域的 {4} 实例。正在尝试启动其他服务。

# CDISA3040W
source: No resources with the view tag are available for the {1} instance in the following domain: {2}. Using {0} as a view resource.
de: In der folgenden Domäne sind keine Ressourcen mit dem Ansichtstag für die Instanz {1} verfügbar: {2}. {0} wird als Ansichtsressource verwendet.
ja: 次のドメイン内の {1} インスタンスで使用可能な、ビュー・タグを持つリソースがありません: {2}。{0} をビュー・リソースとして使用します。
ru: Для экземпляра {1} в указанном ниже домене нет ресурсов с тегом представления (view): {2}. {0} используется как ресурс представления.
zh_cn: 没有带有视图标记的资源可用于 {2} 域中的 {1} 实例。正在使用 {0} 作为视图资源。

# CDISA3041W
source: High availability count is {0} for the {1} instance in the following domain: {2}. View services were placed evenly across {3} resources.
de: Hochverfügbarkeitsanzahl ist {0} für die Instanz {1} in der folgenden Domäne: {2}. Die Anzeigeservices wurden gleichmäßig auf {3} Ressourcen verteilt.
ja: 次のドメイン内の {1} インスタンスの高可用性カウントは {0} です: {2}。ビュー・サービスは {3} 個のリソースに均等に配置されました。
ru: Величина высокой доступности равна {0} для экземпляра {1} в следующем домене: {2}. Службы представления размещены равномерно по ресурсам {3}.
zh_cn: {2} 域中的 {1} 实例的高可用性计数为 {0}。视图服务已均匀放置在 {3} 个资源上。

# CDISA3042W
source: The {0} service failed to start on the following resource: {1}. All ports are in use.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Alle Ports werden verwendet.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。すべてのポートが使用中です。
ru: Не удалось запустить службу {0} на ресурсе {1}. Все порты используются.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。所有端口都在使用中。

# CDISA3043W
source: The {0} property is only allowed on the command line or in the command environment. The setting found in the property file will be ignored.
de: Die Eigenschaft {0} ist nur in der Befehlszeile oder in der Befehlsumgebung zulässig. Die in der Eigenschaftendatei gefundene Einstellung wird ignoriert.
ja: {0} プロパティーは、コマンド・ラインまたはコマンド環境でのみ許可されます。プロパティー・ファイルにある設定は無視されます。
ru: Свойство {0} допускается только в командной строке или в среде команды. Параметр, найденный в файле свойств, будет проигнорирован.
zh_cn: 只有在命令行或命令环境中才允许使用 {0} 属性。将忽略在属性文件中找到的设置。

# CDISA3044W
source: Clean request timed out for the following resource: {0}. Data such as log files may not have been removed.
de: Die Bereinigungsanforderung hat für die folgende Ressource das zulässige Zeitlimit überschritten: {0}. Daten wie Protokolldateien wurden möglicherweise nicht entfernt.
ja: 次のリソースのクリーンアップ要求がタイムアウトになりました: {0}。ログ・ファイルなどのデータは削除されなかった可能性があります。
ru: Произошел тайм-аут требования очистки для следующего ресурса: {0}. Возможно, такие данные, как файлы журналов, не были удалены.
zh_cn: 针对 {0} 资源的清除请求超时。可能未移除日志文件之类的数据。

# CDISA3045W
source: Clean request failed for the {0} resource with following return codes: {1}. Data such as log files may not have been removed.
de: Die Bereinigungsanforderung ist für die Ressource {0} mit den folgenden Rückgabecodes fehlgeschlagen: {1}. Daten wie Protokolldateien wurden möglicherweise nicht entfernt.
ja: {0} リソースのクリーンアップ要求が失敗し、次の戻りコードが返されました: {1}。ログ・ファイルなどのデータは削除されなかった可能性があります。
ru: Требование очистки завершилось неудачно для ресурса {0} со следующими кодами возврата: {1}. Возможно, такие данные, как файлы журналов, не были удалены.
zh_cn: 针对 {0} 资源的清除请求失败，返回码如下：{1}。可能未移除日志文件之类的数据。

# CDISA3046W
source: The {0} resource in the {1} domain experienced a zookeeper disconnect on {2}. Zookeeper reconnected at {3}.
de: Für die Ressource {0} in der Domäne {1} wurde um {2} die ZooKeeper-Verbindung getrennt. Die ZooKeeper-Verbindung wurde um {3} wiederhergestellt.
ja: {2} に、{1} ドメイン内の {0} リソースで Zookeeper の切断が発生しました。{3} に、Zookeeper は再接続されました。
ru: Ресурс {0} в домене {1} обнаружил разъединение с zookeeper на {2}. Zookeeper повторно соединился в {3}.
zh_cn: {1} 域中的 {0} 资源已在 {2} 断开与 ZooKeeper 的连接。ZooKeeper 已于 {3} 重新连接。

# CDISA3047W
source: The {0} service timed out or failed on the following resource: {1}. The resource is allocated to the following domain: {2}. The service is currently operational on at least one resource.
de: Der Service {0} hat in der folgenden Ressource das zulässige Zeitlimit überschritten oder ist fehlgeschlagen: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}. Der Service ist zurzeit in mindestens einer Ressource betriebsbereit.
ja: 次のリソースで {0} サービスがタイムアウトになったか、失敗しました: {1}。リソースは次のドメインに割り振られています: {2}。サービスは少なくとも 1 つのリソースで現在作動可能です。
ru: Тайм-аут или сбой службы {0} на ресурсе {1}. Ресурс выделен домену {2}. Служба сейчас пригодна для работы, как минимум, на одном ресурсе.
zh_cn: 在 {1} 资源上，{0} 服务超时或失败。该资源已分配到 {2} 域。该服务目前至少在一个资源上正常运行。

# CDISA3048W
source: The {0} log directory could not be created on the {1} resource by the following user: {2}. Using default log directory: {3}.
de: Der folgende Benutzer konnte das Protokollverzeichnis {0} in der Ressource {1} nicht erstellen: {2}. Das Standardprotokollverzeichnis wird verwendet: {3}.
ja: 次のユーザーによって {1} リソースで {0} ログ・ディレクトリーを作成できませんでした: {2}。次のデフォルトのログ・ディレクトリーを使用します: {3}。
ru: Указанному ниже пользователю не удалось создать каталог журналов {0} на ресурсе {1}: {2}. Используется каталог журнала по умолчанию: {3}.
zh_cn: {2} 用户无法在 {1} 资源上创建 {0} 日志目录。正在使用缺省日志目录 {3}。

# CDISA3049W
source: The {0} resource is being removed from the {1} instance for the following domain: {2}. Relocation of Processing Elements timed out.
de: Die Ressource {0} wird aus der Instanz {1} für die folgende Domäne entfernt: {2}. Beim Verlagern der Verarbeitungselemente wurde das zulässige Zeitlimit überschritten.
ja: {0} リソースを次のドメインの {1} インスタンスから削除しています: {2}。処理要素の再配置がタイムアウトになりました。
ru: Ресурс {0} удаляется из экземпляра {1} для следующего домена: {2}. Тайм-аут перемещения элементов обработки истек.
zh_cn: 正在从 {2} 域的 {1} 实例中移除 {0} 资源。重新定位处理元素时发生超时。

# CDISA3050W
source: The {0} resource was quiesced successfully for the following domain: {1}. Relocation of Processing Elements timed out.
de: Die Ressource {0} wurde erfolgreich für die folgende Domäne in den Quiescemodus versetzt: {1}. Beim Verlagern der Verarbeitungselemente wurde das zulässige Zeitlimit überschritten.
ja: 次のドメインの {0} リソースが正常に静止されました: {1}。処理要素の再配置がタイムアウトになりました。
ru: Ресурс {0} успешно стабилизирован для следующего домена: {1}. Тайм-аут перемещения элементов обработки истек.
zh_cn: 已成功使 {1} 域的 {0} 资源停顿。重新定位处理元素时发生超时。

# CDISA3051W
source: The {0} file storage directory could not be created on the {1} resource by the following user: {2}. Using default file storage directory: {3}.
de: Der folgende Benutzer konnte das Dateispeicherverzeichnis {0} in der Ressource {1} nicht erstellen: {2}. Das Standarddateispeicherverzeichnis wird verwendet: {3}.
ja: 次のユーザーによって {1} リソースで {0} ファイル・ストレージ・ディレクトリーを作成できませんでした: {2}。次のデフォルトのファイル・ストレージ・ディレクトリーを使用します: {3}。
ru: Указанному ниже пользователю не удалось создать каталог хранения файлов {0} на ресурсе {1}: {2}. Используется каталог хранения файла по умолчанию: {3}.
zh_cn: {2} 用户无法在 {1} 资源上创建 {0} 文件存储目录。正在使用缺省文件存储目录 {3}。

# CDISA3052W
source: Cannot change the owner and group of the following directory and its contents: {0}.
de: Der Eigner und die Gruppe des folgenden Verzeichnisses und dessen Inhalts können nicht geändert werden: {0}.
ja: 次のディレクトリーおよびその内容の所有者とグループを変更できません: {0}。
ru: Невозможно изменить владельца и группу для следующего каталога и его содержимого: {0}.
zh_cn: 无法更改 {0} 目录及其内容的所有者和组。

# CDISA3053W
source: The hc service failed to start on the following resource: {0}. The IBM Streams controller must run as root in order to set operating system capabilities.
de: Der Service hc konnte in der folgenden Ressource nicht gestartet werden: {0}. Der IBM Streams-Controller muss als Root ausgeführt werden, damit Betriebssystemfunktionen festgelegt werden können.
ja: 次のリソースで hc サービスの開始に失敗しました: {0}。オペレーティング・システム機能を設定するために、IBM Streams コントローラーが root として実行される必要があります。
ru: Не удалось запустить службу hc на ресурсе {0}. Контроллер IBM Streams должен работать от имени root, чтобы можно было задавать возможности операционной системы.
zh_cn: 无法在 {0} 资源上启动 hc 服务。要设置操作系统功能，必须以 root 用户身份运行 IBM Streams 控制器。

# CDISA3054W
source: The {0} service is not available on the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} ist für die folgenden Ressourcen nicht verfügbar: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: 次のリソース上で {0} サービスが使用可能でありません: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Служба {0} недоступна на ресурсе {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: {0} 服务在 {1} 资源上不可用。该资源已分配到 {3} 域的 {2} 实例。

# CDISA3055W
source: The {0} service is not available on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} ist für die folgenden Ressourcen nicht verfügbar: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で {0} サービスが使用可能でありません: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Служба {0} недоступна на ресурсе {1}. Ресурс выделен домену {2}.
zh_cn: {0} 服务在 {1} 资源上不可用。该资源已分配到 {2} 域。

# CDISA3056W
source: Resuming the {0} resource in order to start the following domain: {1}.
de: Die Ressource {0} wird zum Starten der folgenden Domäne fortgesetzt: {1}.
ja: 次のドメインを開始するために {0} リソースを再開中: {1}。
ru: Возобновляется работа ресурса {0} для запуска следующего домена: {1}.
zh_cn: 正在恢复 {0} 资源以启动 {1} 域。

# CDISA3057W
source: The recommended ulimit values are not set properly for the following resource: {0}. Maximum processes is {1}. Open files is {2}.
de: Die empfohlenen ulimit-Werte sind für die folgende Ressource nicht ordnungsgemäß festgelegt: {0}. Maximale Anzahl Prozesse: {1}. Offene Dateien: {2}.
ja: 次のリソースで推奨される ulimit 値が適切に設定されていません: {0}。最大プロセス数: {1}。オープン・ファイル数: {2}。
ru: Рекомендуемые значения ulimit не заданы надлежащим образом для следующего ресурса: {0}. Максимальное число процессов - {1}. Открыто файлов - {2}.
zh_cn: 未针对 {0} 资源正确地设置建议的 ulimit 值。最大进程数为 {1}。已打开的文件数为 {2}。

# CDISA3058W
source: The {0} system service cannot be disabled on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} kann in der folgenden Ressource nicht inaktiviert werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソースで {0} システム・サービスを無効にできません: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системную службу {0} невозможно отключить на следующем ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: 无法在 {1} 资源上禁用 {0} 系统服务。该资源已分配到 {2} 域。

# CDISA3059W
source: The {0} unregistered service was stopped on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der nicht registrierte Service {0} wurde in der folgenden Ressource gestoppt: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で登録抹消されたサービス {0} が停止されました: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Незарегистрированная служба {0} остановлена на ресурсе {1}. Ресурс выделен домену {2}.
zh_cn: 已在 {1} 资源上停止未注册的服务 {0}。该资源已分配到 {2} 域。

# CDISA3060W
source: The domain property security.runAsRoot=true but the controller is not running as user root on the following resource: {0}. This may prevent user authentication by password.
de: Die Domäneneigenschaft security.runAsRoot ist auf ''true'' gesetzt, aber der Controller wird in der folgenden Ressource nicht als Rootbenutzer ausgeführt: {0}. Dies verhindert möglicherweise die Benutzerauthentifizierung über Kennwörter.
ja: ドメイン・プロパティー security.runAsRoot=true が指定されていますが、コントローラーが次のリソースで root ユーザーとして実行されていません: {0}。これが原因で、パスワードによるユーザー認証ができなくなることがあります。
ru: Задано свойство домена security.runAsRoot=true, но контроллер не работает от имени пользователя root на следующем ресурсе: {0}. Это может воспрепятствовать аутентификации пользователей на основе пароля.
zh_cn: 域属性 security.runAsRoot 已设置为 true，但在 {0} 资源上未以 root 用户身份运行控制器。这可能会阻止通过密码进行用户认证。

# CDISA3061W
source: The hard ulimit values were increased on the following resource: {0}. Maximum processes is {1}. Open files is {2}.
de: Die festen ulimit-Werte wurden in der folgenden Ressource erhöht: {0}. Maximale Anzahl Prozesse: {1}. Offene Dateien: {2}.
ja: 次のリソースでハード ulimit 値が大きくなりました: {0}。最大プロセス数: {1}。オープン・ファイル数: {2}。
ru: Значения жесткого предела ulimit увеличены на следующем ресурсе: {0}. Максимальное число процессов - {1}. Открыто файлов - {2}.
zh_cn: 在 {0} 资源上增大了硬 ulimit 值。最大进程数为 {1}。已打开的文件数为 {2}。

# CDISA3062W
source: The soft ulimit values were increased on the following resource: {0}. Maximum processes is {1}. Open files is {2}.
de: Die veränderlichen ulimit-Werte wurden in der folgenden Ressource erhöht: {0}. Maximale Anzahl Prozesse: {1}. Offene Dateien: {2}.
ja: 次のリソースでソフト ulimit 値が大きくなりました: {0}。最大プロセス数: {1}。オープン・ファイル数: {2}。
ru: Значения мягкого предела ulimit увеличены на следующем ресурсе: {0}. Максимальное число процессов - {1}. Открыто файлов - {2}.
zh_cn: 在 {0} 资源上增大了软 ulimit 值。最大进程数为 {1}。已打开的文件数为 {2}。

# CDISA3063W
source: Unable to reconnect with managed bean: {0} in the {1} instance for the following domain: {2}.
de: Verbindung zu Managed Bean {0} in der Instanz {1} für die Domäne {2} konnte nicht wiederhergestellt werden.
ja: 次のドメインの {1} インスタンス内の Managed Bean {0} に再接続できません: {2}。
ru: Не удается повторно соединиться с управляемым компонентом bean {0} в экземпляре {1} для следующего домена: {2}.
zh_cn: 无法与 {2} 域的 {1} 实例中的受管 Bean {0} 重新建立连接。

# CDISA3064W
source: Change the following path on the fileStoragePath domain property: {0}. Automatic system maintenance utilities, such as tmpwatch, might remove files in the /tmp directory that are needed by IBM Streams services.
de: Ändern Sie den folgenden Pfad in der Domäneneigenschaft fileStoragePath: {0}. Dienstprogramme für die automatische Systemwartung, z. B. tmpwatch, entfernen möglicherweise Dateien aus dem Verzeichnis /tmp, die für IBM Streams-Services erforderlich sind.
ja: fileStoragePath ドメイン・プロパティーの次のパスを変更してください: {0}。tmpwatch などの自動システム保守ユーティリティーが、/tmp ディレクトリーにある IBM Streams サービスで必要なファイルを削除する可能性があります。
ru: Измените следующий путь для свойства домена fileStoragePath: {0}. Такие автоматические утилиты обслуживания системы, как tmpwatch, могут удалить из каталога /tmp файлы, необходимые службам IBM Streams.
zh_cn: 在 fileStoragePath 域属性中更改以下路径：{0}。自动系统维护实用程序（例如，tmpwatch）可以从 /tmp 目录中移除 IBM Streams 服务需要的文件。

# CDISA3065W
source: The {0} service is already restarting on resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} wird in der folgenden Ressource bereits erneut gestartet: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: {0} サービスは、次のリソースで既に再始動中です: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Служба {0} уже перезапускается на ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: 已在 {1} 资源上重新启动 {0} 服务。该资源已分配到 {2} 域。

# CDISA3066W
source: The {0} service is already restarting on resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} wird in der folgenden Ressource bereits erneut gestartet: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} サービスは、次のリソースで既に再始動中です: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Служба {0} уже перезапускается на ресурсе: {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 已在 {1} 资源上重新启动 {0} 服务。该资源已分配到 {3} 域的 {2} 实例。

# CDISA5000E
source: The {0} installation directory does not exist.
de: Das Installationsverzeichnis {0} ist nicht vorhanden.
ja: {0} インストール・ディレクトリーは存在しません。
ru: Каталог установки {0} не существует.
zh_cn: {0} 安装目录不存在。

# CDISA5001E
source: Read permission to the {0} installation directory is required, but is not set.
de: Für das Installationsverzeichnis {0} ist die Leseberechtigung erforderlich, aber nicht festgelegt.
ja: {0} インストール・ディレクトリーに対する読み取り許可が必要ですが、設定されていません。
ru: Требуется разрешение на чтение каталога установки {0}, но оно не задано.
zh_cn: 需要 {0} 安装目录的读许可权，但未设置此许可权。

# CDISA5002E
source: The execute permission to the {0} installation directory is required, but is not set.
de: Für das Installationsverzeichnis {0} ist die Ausführungsberechtigung erforderlich, aber nicht festgelegt.
ja: {0} インストール・ディレクトリーに対する実行許可が必要ですが、設定されていません。
ru: Требуется разрешение на выполнение для каталога установки {0}, но оно не задано.
zh_cn: 需要 {0} 安装目录的执行许可权，但未设置此许可权。

# CDISA5003E
source: IBM Streams was not correctly installed to the following directory: {0}.
de: IBM Streams wurde nicht ordnungsgemäß im folgenden Verzeichnis installiert: {0}.
ja: IBM Streams は次のディレクトリーに正しくインストールされませんでした: {0}。
ru: IBM Streams неправильно установлен в следующем каталоге: {0}.
zh_cn: IBM Streams 未正确安装到以下目录：{0}。

# CDISA5004E
source: The {0} command cannot be invoked by the operating system.
de: Der Befehl {0} kann vom Betriebssystem nicht aufgerufen werden.
ja: オペレーティング・システムはコマンド {0} を起動できません。
ru: Операционная система не может вызвать команду {0}.
zh_cn: 操作系统无法调用 {0} 命令。

# CDISA5005E
source: The operating system cannot successfully run the {0} command. The operating system exception is: {1}.
de: Das Betriebssystem kann den Befehl {0} nicht erfolgreich ausführen. Betriebssystemausnahmebedingung: {1}.
ja: オペレーティング・システムはコマンド {0} を正常に実行できません。オペレーティング・システム例外: {1}。
ru: Операционная система не может успешно выполнить команду {0}. Исключительная ситуация операционной системы: {1}.
zh_cn: 操作系统无法成功运行 {0} 命令。操作系统异常为：{1}。

# CDISA5006E
source: The application service can not be contacted on the following resource: {0}.
de: Der Anwendungsservice kann in der folgenden Ressource nicht kontaktiert werden: {0}.
ja: 次のリソースでアプリケーション・サービスに接触できません: {0}。
ru: С прикладной службой нельзя связаться на следующем ресурсе: {0}.
zh_cn: 无法联系 {0} 资源上的应用程序服务。

# CDISA5007E
source: The {0} instance must be started before you can run the requested operation for the following domain: {1}.
de: Die Instanz {0} muss gestartet werden, bevor Sie die angeforderte Operation für die folgende Domäne ausführen können: {1}.
ja: 次のドメインで要求された操作を実行する前に、{0} インスタンスを開始する必要があります: {1}。
ru: Экземпляр {0} должен быть запущен, прежде чем можно будет выполнить затребованную операцию для следующего домена: {1}.
zh_cn: 必须先启动 {0} 实例，然后您才能对 {1} 域运行所请求的操作。

# CDISA5008E
source: The following directory does not exist: {0}.
de: Das folgende Verzeichnis ist nicht vorhanden: {0}.
ja: 次のディレクトリーは存在しません: {0}。
ru: Следующий каталог не существует: {0}.
zh_cn: {0} 目录不存在。
