Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5377E
source: Failed to register imports for job ID {0} for instance {1}. Cause: {2}
de: Importe für Job-ID {0} konnten für die Instanz {1} nicht registriert werden. Ursache: {2}
ja: インスタンス {1} のジョブ ID {0} のインポートの登録に失敗しました。原因: {2}
ru: Не удалось зарегистрировать операции импорта для ID задания {0} для экземпляра {1}. Причина: {2}
zh_cn: 无法注册实例 {1} 的作业标识 {0} 的导入。原因：{2}

# CDISA5378E
source: Failed to register exports for job ID {0} for instance {1}. Cause: {2}
de: Exporte für Job-ID {0} konnten für die Instanz {1} nicht registriert werden. Ursache: {2}
ja: インスタンス {1} のジョブ ID {0} のエクスポートの登録に失敗しました。原因: {2}
ru: Не удалось зарегистрировать операции экспорта для ID задания {0} для экземпляра {1}. Причина: {2}
zh_cn: 无法注册实例 {1} 的作业标识 {0} 的导出。原因：{2}

# CDISA5379E
source: Failed to register import port for application {0} with governance server {1}. HTTP response code: {2}
de: Der Importport für die Anwendung {0} konnte nicht beim Governance-Server {1} registriert werden. HTTP-Antwortcode: {2}
ja: ガバナンス・サーバー {1} へのアプリケーション {0} のインポート・ポートの登録に失敗しました。HTTP 応答コード: {2}
ru: Не удалось зарегистрировать порт импорта для приложения {0} на сервере регулировки {1}. Код ответа HTTP: {2}
zh_cn: 无法向管控服务器 {1} 注册应用程序 {0} 的导入端口。HTTP 响应码：{2}

# CDISA5380E
source: Failed to register export port for application {0} with governance server {1}. HTTP response code: {2}
de: Der Exportport für die Anwendung {0} konnte nicht beim Governance-Server {1} registriert werden. HTTP-Antwortcode: {2}
ja: ガバナンス・サーバー {1} へのアプリケーション {0} のエクスポート・ポートの登録に失敗しました。HTTP 応答コード: {2}
ru: Не удалось зарегистрировать порт экспорта для приложения {0} на сервере регулировки {1}. Код ответа HTTP: {2}
zh_cn: 无法向管控服务器 {1} 注册应用程序 {0} 的导出端口。HTTP 响应码：{2}

# CDISA5381E
source: Failed to register imports for application {0} with governance server {1}. Cause: {2}
de: Importe für die Anwendung {0} konnten nicht beim Governance-Server {1} registriert werden. Ursache: {2}
ja: ガバナンス・サーバー {1} へのアプリケーション {0} のインポートの登録に失敗しました。原因: {2}
ru: Не удалось зарегистрировать операции импорта для приложения {0} на сервере регулировки {1}. Причина: {2}
zh_cn: 无法向管控服务器 {1} 注册应用程序 {0} 的导入。原因：{2}

# CDISA5382E
source: Failed to register exports for application {0} with governance server {1}. Cause: {2}
de: Exporte für die Anwendung {0} konnten nicht beim Governance-Server {1} registriert werden. Ursache: {2}
ja: ガバナンス・サーバー {1} へのアプリケーション {0} のエクスポートの登録に失敗しました。原因: {2}
ru: Не удалось зарегистрировать операции экспорта для приложения {0} на сервере регулировки {1}. Причина: {2}
zh_cn: 无法向管控服务器 {1} 注册应用程序 {0} 的导出。原因：{2}

# CDISA5383I
source: Imports for application {0} has been registered with governance server {1}.
de: Importe für die Anwendung {0} wurden beim Governance-Server {1} registriert.
ja: アプリケーション {0} のインポートがガバナンス・サーバー {1} に登録されました。
ru: Операции импорта для приложения {0} зарегистрированы на сервере регулировки {1}.
zh_cn: 已向管控服务器 {1} 注册应用程序 {0} 的导入。

# CDISA5384I
source: Exports for application {0} has been registered with governance server {1}.
de: Exporte für die Anwendung {0} wurden beim Governance-Server {1} registriert.
ja: アプリケーション {0} のエクスポートがガバナンス・サーバー {1} に登録されました。
ru: Операции экспорта для приложения {0} зарегистрированы на сервере регулировки {1}.
zh_cn: 已向管控服务器 {1} 注册应用程序 {0} 的导出。

# CDISA5385E
source: Governance catalog user is not set for instance {0}.
de: Der Governance-Katalogbenutzer ist für die Instanz {0} nicht festgelegt.
ja: インスタンス {0} のガバナンス・カタログ・ユーザーが設定されていません。
ru: Пользователь каталога регулировки не задан для экземпляра {0}.
zh_cn: 未设置实例 {0} 的管控目录用户。

# CDISA5386E
source: Governance catalog password is not set for instance {0}.
de: Das Governance-Katalogkennwort ist für die Instanz {0} nicht festgelegt.
ja: インスタンス {0} のガバナンス・カタログ・パスワードが設定されていません。
ru: Пароль каталога регулировки не задан для экземпляра {0}.
zh_cn: 未设置实例 {0} 的管控目录密码。

# CDISA5387E
source: Unexpected error while retrieving governance catalog credential for instance {0}. Cause: {1}
de: Unerwarteter Fehler beim Abrufen des Governance-Katalogberechtigungsnachweises für Instanz {0}. Ursache: {1}
ja: インスタンス {0} のガバナンス・カタログ資格情報の取得中に予期しないエラーが発生しました。原因: {1}
ru: Неожиданная ошибка при получении учетных данных каталога регулировки для экземпляра {0}. Причина: {1}
zh_cn: 检索实例 {0} 的管控目录凭证时发生意外错误。原因：{1}

# CDISA5388E
source: Failed to register source operator for operator {0} with governance server {1}. HTTP response code: {2}
de: Der Quellenoperator für den Operator {0} konnte nicht beim Governance-Server {1} registriert werden. HTTP-Antwortcode: {2}
ja: ガバナンス・サーバー {1} へのオペレーター {0} のソース・オペレーターの登録に失敗しました。HTTP 応答コード: {2}
ru: Не удалось зарегистрировать исходный оператор для оператора {0} на сервере регулировки {1}. Код ответа HTTP: {2}
zh_cn: 无法向管控服务器 {1} 注册操作程序 {0} 的源操作程序。HTTP 响应码：{2}

# CDISA5389I
source: Source operator {0} has been registered with governance server {1}.
de: Der Quellenoperator {0} wurde beim Governance-Server {1} registriert.
ja: ソース・オペレーター {0} がガバナンス・サーバー {1} に登録されました。
ru: Исходный оператор {0} зарегистрирован на сервере регулировки {1}.
zh_cn: 已向管控服务器 {1} 注册源操作程序 {0}。

# CDISA5390E
source: Failed to register source operator {0} with governance server {1}. Cause: {2}
de: Der Quellenoperator {0} konnte nicht beim Governance-Server {1} registriert werden. Ursache: {2}
ja: ガバナンス・サーバー {1} へのソース・オペレーター {0} の登録に失敗しました。原因: {2}
ru: Не удалось зарегистрировать исходный оператор {0} на сервере регулировки {1}. Причина: {2}
zh_cn: 无法向管控服务器 {1} 注册源操作程序 {0}。原因：{2}

# CDISA5391E
source: Failed to register sink operator for operator {0} with governance server {1}. HTTP response code: {2}
de: Der Senkenoperator für den Operator {0} konnte nicht beim Governance-Server {1} registriert werden. HTTP-Antwortcode: {2}
ja: ガバナンス・サーバー {1} へのオペレーター {0} のシンク・オペレーターの登録に失敗しました。HTTP 応答コード: {2}
ru: Не удалось зарегистрировать оператор уменьшения для оператора {0} на сервере регулировки {1}. Код ответа HTTP: {2}
zh_cn: 无法向管控服务器 {1} 注册操作程序 {0} 的 Sink 操作程序。HTTP 响应码：{2}

# CDISA5392I
source: Sink operator {0} has been registered with governance server {1}.
de: Der Senkenoperator {0} wurde beim Governance-Server {1} registriert.
ja: シンク・オペレーター {0} がガバナンス・サーバー {1} に登録されました。
ru: Оператор уменьшения {0} зарегистрирован на сервере регулировки {1}.
zh_cn: 已向管控服务器 {1} 注册 Sink 操作程序 {0}。

# CDISA5393E
source: Failed to register sink operator {0} with governance server {1}. Cause: {2}
de: Der Senkenoperator {0} konnte nicht beim Governance-Server {1} registriert werden. Ursache: {2}
ja: ガバナンス・サーバー {1} へのシンク・オペレーター {0} の登録に失敗しました。原因: {2}
ru: Не удалось зарегистрировать оператор уменьшения {0} на сервере регулировки {1}. Причина: {2}
zh_cn: 无法向管控服务器 {1} 注册 Sink 操作程序 {0}。原因：{2}

# CDISA5394E
source: Trusted origin value {0} is not valid.
de: Der Wert {0} für vertrauenswürdigen Ursprünge ist nicht gültig.
ja: トラステッド・オリジン値 {0} は無効です。
ru: Доверенное исходное значение {0} является недопустимым.
zh_cn: 可信来源值 {0} 无效。

# CDISA5395E
source: The version of application bundle {0} is not supported by instance {1}.
de: Die Version von Anwendungsbundle {0} wird von der Instanz {1} nicht unterstützt.
ja: アプリケーション・バンドル {0} のバージョンがインスタンス {1} でサポートされません。
ru: Версия пакета приложения {0} не поддерживается экземпляром {1}.
zh_cn: 应用程序捆绑包 {0} 的版本不受实例 {1} 支持。

# CDISA5396E
source: Failed to register source operator for operator {0} with governance server {1}.
de: Der Quellenoperator für den Operator {0} konnte nicht beim Governance-Server {1} registriert werden.
ja: ガバナンス・サーバー {1} へのオペレーター {0} のソース・オペレーターの登録に失敗しました。
ru: Не удалось зарегистрировать исходный оператор для оператора {0} на сервере регулировки {1}.
zh_cn: 无法向管控服务器 {1} 注册操作程序 {0} 的源操作程序。

# CDISA5397E
source: Failed to register governance server. Data={0}. Cause: {1}
de: Die Registrierung des Governance-Servers ist fehlschlagen. Daten: {0}. Ursache: {1}
ja: ガバナンス・サーバーの登録に失敗しました。データ={0}。原因: {1}
ru: Не удалось зарегистрировать сервер регулировки. Данные={0}. Причина: {1}
zh_cn: 无法注册管控服务器。数据为 {0}。原因：{1}

# CDISA5400E
source: The {0} user is not authorized to add a job to the following job group: {1}.
de: Der Benutzer {0} ist nicht zum Hinzufügen eines Jobs zur folgenden Jobgruppe berechtigt: {1}.
ja: {0} ユーザーには、次のジョブ・グループにジョブを追加する権限がありません: {1}。
ru: Пользователю {0} не разрешено добавлять задания к следующей группе заданий: {1}.
zh_cn: {0} 用户无权向 {1} 作业组添加作业。

# CDISA5401E
source: The {0} service cannot be contacted on the following resource: {1}.
de: Der Systemservice {0} kann in der folgenden Ressource nicht kontaktiert werden: {1}.
ja: 次のリソースで {0} サービスに接触できません: {1}。
ru: Со службой {0} нельзя связаться на следующем ресурсе: {1}.
zh_cn: 无法在 {1} 资源上联系 {0} 服务。

# CDISA5402E
source: The {0} user is not authorized to edit the following job: {1}. The job is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Bearbeiten des folgenden Jobs berechtigt: {1}. Der Job ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のジョブを編集する権限がありません: {1}。ジョブは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено изменять следующее задание: {1}. Задание выделено экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权编辑 {1} 作业。该作业已分配到 {3} 域的 {2} 实例。

# CDISA5403E
source: The {0} user is not authorized to delete the following job: {1}. The job is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Löschen des folgenden Jobs berechtigt: {1}. Der Job ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のジョブを削除する権限がありません: {1}。ジョブは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено удалять следующее задание: {1}. Задание выделено экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权删除 {1} 作业。该作业已分配到 {3} 域的 {2} 实例。

# CDISA5404E
source: The {0} user is not authorized to submit jobs to the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Übergeben von Jobs an die Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスにジョブをサブミットする権限がありません: {2}。
ru: Пользователю {0} не разрешено передавать задания в экземпляр {1} для следующего домена: {2}.
zh_cn: {0} 用户无权将作业提交给 {2} 域的 {1} 实例。

# CDISA5405E
source: The {0} user is not authorized to edit the following job: {1}. The job is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Bearbeiten des folgenden Jobs berechtigt: {1}. Der Job ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のジョブを編集する権限がありません: {1}。ジョブは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено изменять следующее задание: {1}. Задание выделено экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权编辑 {1} 作业。该作业已分配到 {3} 域的 {2} 实例。

# CDISA5406E
source: IBM Streams could not get PE connection information based on the runtime connection information {0} for the {1} domain and the {2} instance.
de: IBM Streams konnte keine PE-Verbindungsinformationen auf der Basis der Laufzeitverbindungsinformationen {0} für die Domäne {1} und die Instanz {2} abrufen.
ja: IBM Streams が、{1} ドメインおよび {2} インスタンスのランタイム接続情報 {0} に基づいて PE 接続情報を取得できませんでした。
ru: Продукту IBM Streams не удалось получить информацию о соединении PE на основе информации о соединении среды выполнения {0} для домена {1} и экземпляра {2}.
zh_cn: IBM Streams 无法根据 {1} 域 {2} 实例的运行时连接信息 {0} 获取 PE 连接信息。

# CDISA5407E
source: The {0} application configuration already exists in the following domain: {1}.
de: Die Anwendungskonfiguration {0} ist bereits in der folgenden Domäne vorhanden: {1}.
ja: {0} アプリケーション構成は次のドメイン内に既に存在します: {1}。
ru: Конфигурация приложения {0} уже существует в следующем домене: {1}.
zh_cn: 应用程序配置 {0} 已存在于 {1} 域中。

# CDISA5408E
source: The {0} application configuration does not exist in the following domain: {1}.
de: Die Anwendungskonfiguration {0} ist in der folgenden Domäne nicht vorhanden: {1}.
ja: {0} アプリケーション構成は次のドメイン内に存在しません: {1}。
ru: Конфигурация приложения {0} не существует в следующем домене: {1}.
zh_cn: 应用程序配置 {0} 未存在于 {1} 域中。

# CDISA5409E
source: The {0} user is not authorized to see the list of application configurations created for following domain: {1}.
de: Der Benutzer {0} ist nicht zum Anzeigen der Liste der Anwendungskonfigurationen berechtigt, die für die folgende Domäne erstellt wurden: {1}.
ja: {0} ユーザーには、次のドメイン用に作成されたアプリケーション構成のリストを表示する権限がありません: {1}。
ru: Пользователь {0} не авторизован для просмотра списка конфигураций приложения, созданных для следующего домена: {1}.
zh_cn: {0} 用户无权查看为 {1} 域创建的应用程序配置列表。

# CDISA5410E
source: The {0} user is not authorized to create a new application configuration for following domain: {1}.
de: Der Benutzer {0} ist nicht zum Erstellen einer neuen Anwendungskonfiguration für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインの新規アプリケーション構成を作成する権限がありません: {1}。
ru: Пользователю {0} не разрешено создавать новую конфигурацию приложения для следующего домена: {1}.
zh_cn: {0} 用户无权为 {1} 域创建新的应用程序配置。

# CDISA5411E
source: The {0} user is not authorized to view the {1} application configuration for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Anzeigen der Anwendungskonfiguration {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} アプリケーション構成を表示する権限がありません: {2}。
ru: Пользователю {0} не разрешено просматривать конфигурацию приложения {1} для следующего домена: {2}.
zh_cn: {0} 用户无权查看 {2} 域的应用程序配置 {1}。

# CDISA5412E
source: The {0} user is not authorized to modify the {1} application configuration for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Modifizieren der Anwendungskonfiguration {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} アプリケーション構成を変更する権限がありません: {2}。
ru: Пользователю {0} не разрешено изменять конфигурацию приложения {1} для следующего домена: {2}.
zh_cn: {0} 用户无权修改 {2} 域的应用程序配置 {1}。

# CDISA5413E
source: The {0} user is not authorized to delete the {1} application configuration from the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Löschen der Anwendungskonfiguration {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインから {1} アプリケーション構成を削除する権限がありません: {2}。
ru: Пользователю {0} не разрешено удалять конфигурацию приложения {1} из следующего домена: {2}.
zh_cn: {0} 用户无权从 {2} 域中删除应用程序配置 {1}。

# CDISA5414E
source: The specified certificate alias or specified PKCS #12 password is not valid.
de: Der angegebene Zertifikatsaliasname oder das angegebene PKCS-#12-Kennwort ist nicht gültig.
ja: 指定された証明書別名または指定された PKCS #12 パスワードは無効です。
ru: Указанный алиас сертификата или указанный пароль PKCS #12 являются недействительными.
zh_cn: 指定的证书别名或指定的 PKCS #12 密码无效。

# CDISA5415E
source: The specified PKCS #12 password is not valid.
de: Das angegebene PKCS-#12-Kennwort ist nicht gültig.
ja: 指定された PKCS #12 パスワードは無効です。
ru: Указанный пароль PKCS #12 является недействительным.
zh_cn: 指定的 PKCS #12 密码无效。

# CDISA5416E
source: The specified certificate alias is not valid.
de: Der angegebene Zertifikatsaliasname ist nicht gültig.
ja: 指定された証明書別名は無効です。
ru: Указанный алиас сертификата является недействительным.
zh_cn: 指定的证书别名无效。

# CDISA5417E
source: Error checking managed bean permissions. The message is: {0}.
de: Fehler bei der Prüfung von Managed-Bean-Berechtigungen. Nachricht: {0}.
ja: Managed Bean 許可のチェック中にエラーが発生しました。メッセージ: {0}。
ru: Ошибка при проверке разрешений на доступ к управляемым компонентам bean. Сообщение: {0}.
zh_cn: 检查受管 Bean 许可权时出错。消息如下：{0}。

# CDISA5418E
source: The management API request is not valid for the specified instance.
de: Die Management-API-Anforderung ist für die angegebene Instanz nicht gültig.
ja: 指定されたインスタンスに対する管理 API 要求は無効です。
ru: Требование API управления является недействительным для указанного экземпляра.
zh_cn: 管理 API 请求对于指定的实例而言无效。

# CDISA5419E
source: The value for the following property must be numeric: {0}.
de: Der Wert für die folgende Eigenschaft muss numerisch sein: {0}.
ja: 次のプロパティーの値は数値でなければなりません: {0}。
ru: Значение для следующего свойства должно быть числовым: {0}.
zh_cn: {0} 属性的值必须是数字。

# CDISA5420E
source: The initial JVM size of {0} cannot be greater than the maximum JVM size of {1}.
de: Die JVM-Anfangsgröße {0} darf nicht größer als die maximale JVM-Größe {1} sein.
ja: 初期 JVM サイズ ({0}) を最大 JVM サイズ ({1}) より大きくすることはできません。
ru: Первоначальный размер JVM, равный {0}, не должен превышать максимальный размер JVM, равный {1}.
zh_cn: 初始 JVM 大小 {0} 不能大于最大 JVM 大小 {1}。

# CDISA5421E
source: The following value for the {0} property is not valid: {1}. The property value must be {2} or greater.
de: Der folgende Wert für die Eigenschaft {0} ist nicht gültig: {1}. Der Eigenschaftswert muss mindestens {2} sein.
ja: {0} プロパティーの次の値は無効です: {1}。プロパティー値は {2} 以上でなければなりません。
ru: Следующее значение для свойства {0} недопустимо: {1}. Значение свойства должно быть {2} или больше.
zh_cn: {0} 属性的值 {1} 无效。该属性值必须为 {2} 或更大的值。

# CDISA5422E
source: The following property is not valid: {0}.
de: Die folgende Eigenschaft ist nicht gültig: {0}.
ja: 次のプロパティーは無効です: {0}。
ru: Следующее свойство недопустимо: {0}.
zh_cn: {0} 属性无效。

# CDISA5423E
source: The {0} domain did not upgrade to version: {1}. The domain is running at version {2}, which does not support the upgrade operation.
de: Für die Domäne {0} wurde kein Upgrade auf Version {1} durchgeführt. Die Domäne wird für Version {2} ausgeführt, die die Upgradeoperation nicht unterstützt.
ja: {0} ドメインは次のバージョンにアップグレードされませんでした: {1}。ドメインがバージョン {2} で実行されているため、アップグレード操作がサポートされません。
ru: Домен {0} не обновлен до версии {1}. Домен работает в версии {2}, не поддерживающей операцию по обновлению.
zh_cn: {0} 域未升级到 V{1}。该域正在以 V{2} 运行，此版本不支持升级操作。

# CDISA5424E
source: The domain controller service can only be started by the user root or the {0} user who started the following domain: {1}.
de: Der Domänen-Controller-Service kann nur vom Rootbenutzer oder vom Benutzer {0}, der die folgende Domäne gestartet hat, gestartet werden: {1}.
ja: ドメイン・コントローラー・サービスを開始できるのは、root ユーザーまたは次のドメインを開始した {0} ユーザーのみです: {1}。
ru: Службу контроллера домена может запустить только пользователь root или пользователь {0}, который запустил следующий домен: {1}.
zh_cn: 域控制器服务只能由 root 用户或启动了 {1} 域的 {0} 用户启动。

# CDISA5425E
source: You cannot start the domain controller as an unregistered service. The {1} system service is already defined for the {0} domain on the following resource: {2}.
de: Sie können den Domänencontroller nicht als nicht registrierten Service starten. Der Systemservice {1} wurde bereits für die Domäne {0} in der folgenden Ressource definiert: {2}.
ja: ドメイン・コントローラーを未登録サービスとして開始できません。{1} システム・サービスが次のリソースで {0} ドメインに対して既に定義されています: {2}。
ru: Вы не можете запустить контроллер домена как незарегистрированную службу. Системная служба {1} уже определена для домена {0} на следующем ресурсе: {2}.
zh_cn: 您无法将域控制器作为未注册的服务启动。已在 {2} 资源上为 {0} 域定义 {1} 系统服务。

# CDISA5426E
source: The following domain must be created and started when the current user is not the user root: {0}.
de: Die folgende Domäne muss erstellt und gestartet werden, wenn der aktuelle Benutzer nicht der Rootbenutzer ist: {0}.
ja: 現行ユーザーが root ユーザーでない場合、次のドメインを作成して開始する必要があります: {0}。
ru: Указанный ниже домен должен быть создан и запущен, когда текущий пользователь не является пользователем root: {0}.
zh_cn: 如果当前用户不是 root 用户，那么必须创建并启动 {0} 域。

# CDISA5427E
source: The domain controller process cannot be stopped by {0} user. The domain was started by {1} user for the following domain: {2}.
de: Der Domänencontrollerprozess kann nicht vom Benutzer {0} gestoppt werden. Die Domäne wurde vom Benutzer {1} für die folgende Domäne gestartet: {2}.
ja: {0} ユーザーはドメイン・コントローラー・プロセスを停止できません。ドメインは次のドメインの {1} ユーザーによって開始されました: {2}。
ru: Пользователь {0} не может остановить процесс контроллера домена. Домен был запущен пользователем {1} для следующего домена: {2}.
zh_cn: 域控制器进程无法由 {0} 用户停止。该域是由 {2} 域的 {1} 用户启动的。

# CDISA5428E
source: The {0} service failed to start for the {2} domain on the following resource: {1}.
de: Der Service {0} konnte für die Domäne {2} in der folgenden Ressource nicht gestartet werden: {1}.
ja: 次のリソース上で {2} ドメインの {0} サービスの開始に失敗しました: {1}。
ru: Не удалось запустить службу {0} для домена {2} на следующем ресурсе: {1}.
zh_cn: 无法在 {1} 资源上启动 {2} 域的 {0} 服务。

# CDISA5429E
source: The request cannot be processed on the controller service for the {0} domain. The controller service is not running as a registered service on the following resource: {1}.
de: Die Anforderung kann im Controller-Service für die Domäne {0} nicht verarbeitet werden. Der Controller-Service wird nicht als registrierter Service in der folgenden Ressource ausgeführt: {1}.
ja: {0} ドメインのコントローラー・サービスで要求を処理できません。コントローラー・サービスが次のリソースで登録済みサービスとして実行されていません: {1}。
ru: Невозможно обработать требование для службы контроллера для домена {0}. Служба контроллера не работает как зарегистрированная служба на следующем ресурсе: {1}.
zh_cn: 在 {0} 域的控制器服务上无法处理该请求。控制器服务并非作为已注册的服务在 {1} 资源上运行。

# CDISA5430E
source: The unregistered domain controller process cannot be determined for the following domain: {0}. You must specify the ZooKeeper connection string.
de: Der nicht registrierte Domänencontrollerprozess kann für die folgende Domäne nicht bestimmt werden: {0}. Sie müssen die ZooKeeper-Verbindungszeichenfolge angeben.
ja: 次のドメインの未登録ドメイン・コントローラー・プロセスを判別できません: {0}。ZooKeeper 接続ストリングを指定する必要があります。
ru: Невозможно определить незарегистрированный процесс контроллера домена для следующего домена: {0}. Нужно задать строку соединения ZooKeeper.
zh_cn: 无法确定 {0} 域的未注册域控制器进程。必须指定 ZooKeeper 连接字符串。

# CDISA5431E
source: The {0} application configuration already exists in the following instance: {1}.
de: Die Anwendungskonfiguration {0} ist in der folgenden Instanz bereits vorhanden: {1}.
ja: {0} アプリケーション構成は次のインスタンス内に既に存在します: {1}。
ru: Конфигурация приложения {0} уже существует в следующем экземпляре: {1}.
zh_cn: 应用程序配置 {0} 已存在于 {1} 实例中。

# CDISA5432E
source: The {0} application configuration does not exist in the following instance: {1}.
de: Die Anwendungskonfiguration {0} ist in der folgenden Instanz nicht vorhanden: {1}.
ja: {0} アプリケーション構成は次のインスタンス内に存在しません: {1}。
ru: Конфигурация приложения {0} не существует в следующем экземпляре: {1}.
zh_cn: 应用程序配置 {0} 未存在于 {1} 实例中。

# CDISA5433E
source: The {0} user is not authorized to list application configurations for following instance: {1}.
de: Der Benutzer {0} ist nicht zum Auflisten von Anwendungskonfigurationen für die folgende Instanz berechtigt: {1}.
ja: {0} ユーザーには、次のインスタンスのアプリケーション構成をリストする権限がありません: {1}。
ru: Пользователю {0} не разрешено вызывать список конфигураций приложения для следующего экземпляра: {1}.
zh_cn: {0} 用户无权列示 {1} 实例的应用程序配置。

# CDISA5434E
source: The {0} user is not authorized to create a new application configuration for following instance: {1}.
de: Der Benutzer {0} ist nicht zum Erstellen einer neuen Anwendungskonfiguration für die folgende Instanz berechtigt: {1}.
ja: {0} ユーザーには、次のインスタンスの新規アプリケーション構成を作成する権限がありません: {1}。
ru: Пользователю {0} не разрешено создавать новую конфигурацию приложения для следующего экземпляра: {1}.
zh_cn: {0} 用户无权为 {1} 实例创建新的应用程序配置。

# CDISA5435E
source: The {0} user is not authorized to view the {1} application configuration for the following instance: {2}.
de: Der Benutzer {0} ist nicht zum Anzeigen der Anwendungskonfiguration {1} für die folgende Instanz berechtigt: {2}.
ja: {0} ユーザーには、次のインスタンスの {1} アプリケーション構成を表示する権限がありません: {2}。
ru: Пользователю {0} не разрешено просматривать конфигурацию приложения {1} для следующего экземпляра: {2}.
zh_cn: {0} 用户无权查看 {2} 实例的应用程序配置 {1}。
