Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5436E
source: The {0} user is not authorized to modify the {1} application configuration for the following instance: {2}.
de: Der Benutzer {0} ist nicht zum Modifizieren der Anwendungskonfiguration {1} für die folgende Instanz berechtigt: {2}.
ja: {0} ユーザーには、次のインスタンスの {1} アプリケーション構成を変更する権限がありません: {2}。
ru: Пользователю {0} не разрешено изменять конфигурацию приложения {1} для следующего экземпляра: {2}.
zh_cn: {0} 用户无权修改 {2} 实例的应用程序配置 {1}。

# CDISA5437E
source: The {0} user is not authorized to remove the {1} application configuration from the following instance: {2}.
de: Der Benutzer {0} ist nicht zum Entfernen der Anwendungskonfiguration {1} aus der folgenden Instanz berechtigt: {2}.
ja: {0} ユーザーには、次のインスタンスから {1} アプリケーション構成を削除する権限がありません: {2}。
ru: Пользователю {0} не разрешено удалять конфигурацию приложения {1} из следующего экземпляра: {2}.
zh_cn: {0} 用户无权从 {2} 实例中移除应用程序配置 {1}。

# CDISA5438E
source: Error trying to establish a management connection to the {0} instance for the following domain: {1}.
de: Fehler beim Versuch, eine Managementverbindung zur Instanz {0} für die folgende Domäne herzustellen: {1}.
ja: 次のドメインの {0} インスタンスへの管理接続の確立中にエラーが発生しました: {1}。
ru: Ошибка при попытке установить соединение управления с экземпляром {0} для следующего домена: {1}.
zh_cn: 尝试与 {1} 域的 {0} 实例建立管理连接时出错。

# CDISA5439E
source: The {0} user is not authorized to upgrade the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Durchführen eines Upgrades für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインをアップグレードする権限がありません: {1}。
ru: Пользователю {0} не разрешено обновлять следующий домен: {1}.
zh_cn: {0} 用户无权升级 {1} 域。

# CDISA5440E
source: The {0} user is not authorized to upgrade the following instance: {1}.
de: Der Benutzer {0} ist nicht zum Durchführen eines Upgrades für die folgende Instanz berechtigt: {1}.
ja: {0} ユーザーには、次のインスタンスをアップグレードする権限がありません: {1}。
ru: Пользователю {0} не разрешено обновлять следующий экземпляр: {1}.
zh_cn: {0} 用户无权升级 {1} 实例。

# CDISA5441E
source: The {0} instance did not upgrade to version: {1}. Upgrade is not allowed for instances that have active jobs.
de: Für die Instanz {0} wurde kein Upgrade auf Version {1} durchgeführt. Für Instanzen mit aktiven Jobs ist ein Upgrade nicht zulässig.
ja: {0} インスタンスは次のバージョンにアップグレードされませんでした: {1}。アクティブなジョブがあるインスタンスに対しては、アップグレードは許可されません。
ru: Экземпляр {0} не обновлен до версии {1}. Обновление не допускается для экземпляров, у которых есть активные задания.
zh_cn: {0} 实例未升级到 V{1}。对于具有活动作业的实例，不允许升级。

# CDISA5442E
source: The unexpected errors following this message occurred while running the following system command: {0}
de: Die unerwarteten Fehler, die auf diese Nachricht folgen, sind beim Ausführen des folgenden Systembefehls aufgetreten: {0}
ja: 次のシステム・コマンドの実行中に、このメッセージの後に示されている予期しないエラーが発生しました: {0}
ru: Произошли неожиданные ошибки после этого сообщения при выполнении следующей системной команды: {0}
zh_cn: 运行以下系统命令时，在显示此消息后发生意外错误：{0}

# CDISA5443E
source: The {0} system service cannot be enabled on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} kann in der folgenden Ressource nicht aktiviert werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソースで {0} システム・サービスを有効にできません: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системную службу {0} невозможно включить на следующем ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: 无法在 {1} 资源上启用 {0} 系统服务。该资源已分配到 {2} 域。

# CDISA5444E
source: The {0} instance cannot be started at version {2} because the {1} domain is running at version {3}. You must upgrade the domain before starting the instance.
de: Die Instanz {0} kann nicht für Version {2} gestartet werden, da die Domäne {1} für Version {3} ausgeführt wird. Sie müssen ein Upgrade für die Domäne durchführen, bevor Sie die Instanz starten.
ja: {1} ドメインがバージョン {3} で実行されているため、{0} インスタンスをバージョン {2} で開始できません。インスタンスを開始する前にドメインをアップグレードする必要があります。
ru: Не удается запустить экземпляр {0} на уровне версии {2}, так как домен {1} работает на уровне версии {3}. Надо обновить домен прежде, чем запустить экземпляр.
zh_cn: 无法以 V{2} 启动 {0} 实例，因为 {1} 域正在以 V{3} 运行。必须先升级该域，然后再启动该实例。

# CDISA5445E
source: The {0} instance did not upgrade to version: {2}. You must upgrade the {1} domain before upgrading the instance.
de: Für die Instanz {0} wurde kein Upgrade auf Version {2} durchgeführt. Sie müssen ein Upgrade für die Domäne {1} durchführen, bevor Sie ein Upgrade für die Instanz durchführen.
ja: {0} インスタンスは次のバージョンにアップグレードされませんでした: {2}。インスタンスをアップグレードする前に {1} ドメインをアップグレードする必要があります。
ru: Экземпляр {0} не обновлен до версии {2}. Надо обновить домен {1} прежде, чем обновлять экземпляр.
zh_cn: {0} 实例未升级到 V{2}。必须先升级 {1} 域，然后再升级该实例。

# CDISA5446E
source: The {0} domain did not upgrade to version: {1}. The domain is running at version {2} so an upgrade is not required.
de: Für die Domäne {0} wurde kein Upgrade auf Version {1} durchgeführt. Die Domäne wird für Version {2} ausgeführt. Daher ist ein Upgrade nicht erforderlich.
ja: {0} ドメインは次のバージョンにアップグレードされませんでした: {1}。ドメインはバージョン {2} で実行されているため、アップグレードが不要です。
ru: Домен {0} не обновлен до версии {1}. Домен работает на уровне версии {2}, поэтому обновление не требуется.
zh_cn: {0} 域未升级到 V{1}。该域正在以 V{2} 运行，因此无需进行升级。

# CDISA5447E
source: The {0} domain did not upgrade to version: {1}. The instance is running at version {2} so an upgrade is not required.
de: Für die Domäne {0} wurde kein Upgrade auf Version {1} durchgeführt. Die Instanz wird für Version {2} ausgeführt. Daher ist ein Upgrade nicht erforderlich.
ja: {0} ドメインは次のバージョンにアップグレードされませんでした: {1}。インスタンスはバージョン {2} で実行されているため、アップグレードが不要です。
ru: Домен {0} не обновлен до версии {1}. Экземпляр работает на уровне версии {2}, поэтому обновление не требуется.
zh_cn: {0} 域未升级到 V{1}。该实例正在以 V{2} 运行，因此无需进行升级。

# CDISA5448E
source: The {0} instance cannot be started from streams version {2} because the {1} domain is running at version {3}. You must upgrade the domain before starting the instance or use a compatible streams installation.
de: Die Instanz {0} kann nicht über Streams Version {2} gestartet werden, da die Domäne {1} für Version {3} ausgeführt wird. Sie müssen ein Upgrade für die Domäne durchführen, bevor Sie die Instanz starten, oder eine kompatible Streams-Installation verwenden.
ja: {1} ドメインがバージョン {3} で実行されているため、{0} インスタンスを Streams バージョン {2} から開始できません。インスタンスを開始する前にドメインをアップグレードするか、互換性のある Streams インストールを使用する必要があります。
ru: Не удается запустить экземпляр {0} на уровне версии Streams {2}, так как домен {1} работает на уровне версии {3}. Прежде чем запускать экземпляр или использовать совместимую установку потоков, нужно обновить домен.
zh_cn: 无法从 {2} 版 Streams 启动 {0} 实例，因为 {1} 域正在版本 {3} 上运行。必须先升级域，然后才能启动实例或使用兼容的流安装。

# CDISA5449E
source: The following application configuration property is required: {0}.
de: Die folgende Anwendungskonfigurationseigenschaft ist erforderlich: {0}.
ja: 次のアプリケーション構成プロパティーは必須です: {0}。
ru: Требуется следующее свойство конфигурации приложения: {0}.
zh_cn: 以下应用程序配置属性是必需项：{0}。

# CDISA5450E
source: Unable to connect to the IBM Watson IoT Platform. For more information, see the following error message: {0}.
de: Es kann keine Verbindung zu IBM Watson IoT Platform hergestellt werden. Weitere Informationen finden Sie in der folgenden Nachricht: {0}.
ja: IBM Watson IoT Platform に接続できません。詳しくは、次のエラー・メッセージを参照してください: {0}。
ru: Не удалось соединиться с IBM Watson IoT Platform. Дополнительную информацию смотрите в следующем сообщении об ошибке: {0}.
zh_cn: 无法连接到 IBM Watson IoT Platform。有关更多信息，请参阅以下错误消息：{0}。

# CDISA5451E
source: Unable to access the IBM Watson Iot Platform. The HTTP code is: {0}. For more information, see the following error message: {1}.
de: Auf IBM Watson Iot Platform kann nicht zugegriffen werden. HTTP-Code: {0}. Weitere Informationen finden Sie in der folgenden Nachricht: {1}.
ja: IBM Watson Iot Platform にアクセスできません。HTTP コード: {0}。詳しくは、次のエラー・メッセージを参照してください: {1}。
ru: Не удалось получить доступ к IBM Watson Iot Platform. Код HTTP: {0}. Дополнительную информацию смотрите в следующем сообщении об ошибке: {1}.
zh_cn: 无法访问 IBM Watson Iot Platform。HTTP 代码为 {0}。有关更多信息，请参阅以下错误消息：{1}。

# CDISA5452E
source: The {0} device manager plugin could not be loaded. The following class could not be located in the class path: {1}.
de: Das Plug-in für den Einheitenmanager {0} konnte nicht geladen werden. Die folgende Klasse konnte nicht im Klassenpfad lokalisiert werden: {1}.
ja: {0} デバイス・マネージャー・プラグインをロードできませんでした。クラスパスで次のクラスを見つけることができませんでした: {1}。
ru: Не удалось загрузить модуль plugin менеджера устройств {0}. Не удалось найти следующий класс в пути классов: {1}.
zh_cn: 无法装入 {0} 设备管理器插件。在类路径中找不到类 {1}。

# CDISA5453E
source: The {0} device manager plugin cannot be loaded. The {1} class does not implement the required interface.
de: Das Plug-in für den Einheitenmanager {0} kann nicht geladen werden. Die Klasse {1} implementiert die erforderliche Schnittstelle nicht.
ja: {0} デバイス・マネージャー・プラグインをロードできません。{1} クラスで必要なインターフェースが実装されていません。
ru: Не удается загрузить модуль plugin менеджера устройств {0}. Класс {1} не реализует необходимый интерфейс.
zh_cn: 无法装入 {0} 设备管理器插件。{1} 类未实现必需的接口。

# CDISA5454E
source: Unexpected error retrieving information for job: {0}. The message is: {1}.
de: Unerwarteter Fehler beim Abrufen von Informationen für Job: {0}. Nachricht: {1}.
ja: 次のジョブの情報の取得中に予期しないエラーが発生しました: {0}。メッセージ: {1}。
ru: Неожиданная ошибка при получении информации для задания: {0}. Сообщение: {1}.
zh_cn: 检索 {0} 作业的信息时发生意外错误。消息如下：{1}。

# CDISA5455E
source: The {0} domain did not upgrade to version: {1}. The upgrade operation is not supported for domains running at an preliminary release.
de: Für die Domäne {0} wurde kein Upgrade auf Version {1} durchgeführt. Die Upgradeoperation wird für Domänen nicht unterstützt, die mit einer Vorabversion ausgeführt werden.
ja: {0} ドメインは次のバージョンにアップグレードされませんでした: {1}。事前リリースで実行されているドメインではアップグレード操作はサポートされません。
ru: Домен {0} не обновлен до версии {1}. Операция обновления не поддерживается для доменов, работающих на уровне предварительного выпуска.
zh_cn: {0} 域未升级到 V{1}。正在运行初级发行版的域不支持升级操作。

# CDISA5456E
source: The {0} instance did not upgrade to version: {1}. The upgrade operation is not supported for domains running at an preliminary release.
de: Für die Instanz {0} wurde kein Upgrade auf Version {1} durchgeführt. Die Upgradeoperation wird für Domänen nicht unterstützt, die mit einer Vorabversion ausgeführt werden.
ja: {0} インスタンスは次のバージョンにアップグレードされませんでした: {1}。事前リリースで実行されているドメインではアップグレード操作はサポートされません。
ru: Экземпляр {0} не обновлен до версии {1}. Операция обновления не поддерживается для доменов, работающих на уровне предварительного выпуска.
zh_cn: {0} 实例未升级到 V{1}。正在运行初级发行版的域不支持升级操作。

# CDISA5457E
source: The {0} instance did not upgrade to version: {1}. You cannot upgrade instances when the domain.determineInstanceStartAsVersion property is set to false and the instance.startAsVersion property is specified.
de: Für die Instanz {0} wurde kein Upgrade auf Version {1} durchgeführt. Sie können kein Upgrade für Instanzen durchführen, wenn die Eigenschaft domain.determineInstanceStartAsVersion property auf ''false'' gesetzt und die Eigenschaft instance.startAsVersion angegeben ist.
ja: {0} インスタンスは次のバージョンにアップグレードされませんでした: {1}。domain.determineInstanceStartAsVersion プロパティーが false に設定されていて、instance.startAsVersion プロパティーが指定されている場合、インスタンスをアップグレードできません。
ru: Экземпляр {0} не обновлен до версии {1}. Нельзя обновить экземпляры, если для свойства domain.determineInstanceStartAsVersion задано значение false и задано свойство instance.startAsVersion.
zh_cn: {0} 实例未升级到 V{1}。当 domain.determineInstanceStartAsVersion 属性设置为 false 且指定了 instance.startAsVersion 属性时，您无法升级实例。

# CDISA5458E
source: The {0} instance did not upgrade to version: {1}. You must start the instance to finish the upgrade process.
de: Für die Instanz {0} wurde kein Upgrade auf Version {1} durchgeführt. Sie müssen die Instanz starten, um den Upgradeprozess fertigzustellen.
ja: {0} インスタンスは次のバージョンにアップグレードされませんでした: {1}。アップグレード・プロセスを完了するには、インスタンスを開始する必要があります。
ru: Экземпляр {0} не обновлен до версии {1}. Чтобы завершить процесс обновления, нужно запустить экземпляр.
zh_cn: {0} 实例未升级到 V{1}。您必须启动该实例才能完成升级过程。

# CDISA5459E
source: The {0} resource in the {1} domain does not have the following tag: {2}.
de: Die Ressource {0} in der Domäne {1} hat den folgenden Tag nicht: {2}.
ja: {1} ドメイン内の {0} リソースに次のタグがありません: {2}。
ru: У ресурса {0} в домене {1} нет следующего тега: {2}.
zh_cn: {1} 域中的 {0} 资源没有以下标记：{2}。

# CDISA5460E
source: The {0} tag is reserved. Only custom tags are allowed to be restricted.
de: Der Tag {0} ist reserviert. Nur angepasste Tags dürfen eingeschränkt werden.
ja: {0} タグは予約済みです。制限できるタグはカスタム・タグのみです。
ru: Тег {0} зарезервирован. Органичивать разрешается только пользовательские теги.
zh_cn: {0} 标记是保留标记。只允许限制定制标记。

# CDISA5461E
source: The {0} resource cannot be restricted because it is currently in use by the {1} instance(s) in the {2} domain.
de: Die Ressource {0} kann nicht eingeschränkt werden, da sie zurzeit von der Instanz bzw. den Instanzen {1} in der Domäne {2} verwendet wird.
ja: {0} リソースは、{2} ドメイン内の {1} インスタンスによって現在使用中であるため、制限できません。
ru: Невозможно ограничить ресурс {0}, так как в настоящий момент он используется экземплярами {1} в домене {2}.
zh_cn: 无法限制 {0} 资源，这是因为 {2} 域中的 {1} 实例当前正在使用该资源。

# CDISA5462E
source: The specified value is not valid for the following parameter: {0}.
de: Der angegebene Wert ist für den folgenden Parameter nicht gültig: {0}.
ja: 次のパラメーターに指定された値は無効です: {0}。
ru: Указанное значение является недопустимым для следующего параметра: {0}.
zh_cn: 指定的值对于 {0} 参数而言无效。

# CDISA5463E
source: The following resource cannot be restricted: {0}. The resource is currently in use by the following PE(s): {1}
de: Die folgende Ressource kann nicht eingeschränkt werden: {0}. Die Ressource wird zurzeit von den folgenden Verarbeitungselementen verwendet: {1}
ja: 次のリソースを制限できません: {0}。このリソースは次の PE によって現在使用中です: {1}
ru: Следующий ресурс невозможно ограничить: {0}. Ресурс в настоящий момент используется следующими PE: {1}
zh_cn: 无法限制 {0} 资源。以下 PE 当前正在使用该资源：{1}

# CDISA5464W
source: Value: {0} is unrecognized for property: {1}. Continuing with value: {2}.
de: Der Wert {0} wird für die Eigenschaft {1} nicht erkannt. Es wird mit dem folgenden Wert fortgefahren: {2}.
ja: 次のプロパティーの値 {0} は認識されません: {1}。次の値を使用して続行します: {2}。
ru: Значение {0} является нераспознанным для свойства {1}. Работа продолжается со значением: {2}.
zh_cn: 无法识别属性 {1} 的值 {0}。正在继续使用值 {2}。

# CDISA5465E
source: The following application configuration property was not specified correctly: {0}. The incorrect value is: {1}.
de: Die folgende Anwendungskonfigurationseigenschaft wurde nicht ordnungsgemäß angegeben: {0}. Falscher Wert: {1}.
ja: 次のアプリケーション構成プロパティーが正しく指定されませんでした: {0}。誤った値: {1}。
ru: Следующее свойство конфигурации приложения задано неправильно: {0}. Неправильное значение: {1}.
zh_cn: 未正确指定应用程序配置属性 {0}。值 {1} 不正确。

# CDISA5466E
source: The following ZooKeeper server might be down {0}:{1}. You might need to restart the service.
de: Der folgende ZooKeeper-Server ist möglicherweise inaktiv: {0}:{1}. Sie müssen den Service möglicherweise erneut starten.
ja: 次の ZooKeeper サーバーがダウンしている可能性があります - {0}:{1}。サービスを再始動する必要がある場合があります。
ru: Возможно, следующий сервер ZooKeeper не работает {0}: {1}. Возможно, вам придется перезапустить службу.
zh_cn: 以下 ZooKeeper 服务器可能已停止：{0}:{1}。您可能需要重新启动服务。

# CDISA5467E
source: {0} tag(s) cannot be restricted on the {1} resource in domain {2}. The {3} instance has the following active PE(s): {4}.
de: Der Tag bzw. die Tags {0} kann bzw. können in der Ressource {1} in der Domäne {2} nicht eingeschränkt werden. Die Instanz {3} hat die folgenden aktiven Verarbeitungselemente: {4}.
ja: ドメイン {2} 内の {1} リソースで {0} タグを制限できません。{3} インスタンスに次のアクティブ PE が含まれています: {4}。
ru: Теги {0} нельзя ограничить на ресурсе {1} в домене {2}. В экземпляре {3} есть следующие активные PE: {4}.
zh_cn: 无法在域 {2} 中的 {1} 资源上限制 {0} 标记。{3} 实例具有以下活动的 PE：{4}。

# CDISA5468E
source: The {0} tag is not restricted on the {1} resource in the {2} domain.
de: Der Tag {0} wird nicht in der Ressource {1} in der Domäne {2} eingeschränkt.
ja: {0} タグは、{2} ドメイン内の {1} リソースで制限されていません。
ru: Тег {0} не ограничен на ресурсе {1} в домене {2}.
zh_cn: 未在 {2} 域中的 {1} 资源上限制 {0} 标记。

# CDISA5469E
source: The following domain failed to upgrade: {0}.
de: Für die folgende Domäne konnte kein Upgrade durchgeführt werden: {0}.
ja: 次のドメインのアップグレードに失敗しました: {0}。
ru: Не удалось обновить следующий домен: {0}.
zh_cn: 无法升级 {0} 域。

# CDISA5470E
source: IBM Streams could not get operator information based on the connection information {0} for the {1} domain and the {2} instance.
de: IBM Streams konnte keine Operatorinformationen auf der Basis der Verbindungsinformationen {0} für die Domäne {1} und die Instanz {2} abrufen.
ja: IBM Streams が、{1} ドメインおよび {2} インスタンスの接続情報 {0} に基づいてオペレーター情報を取得できませんでした。
ru: Продукту IBM Streams не удалось получить информацию об операторе на основе информации о соединении {0} для домена {1} и экземпляра {2}.
zh_cn: IBM Streams 无法根据 {1} 域 {2} 实例的连接信息 {0} 获取操作程序信息。

# CDISA5471E
source: The following job name does not exist: {0}.
de: Der folgende Jobname ist nicht vorhanden: {0}.
ja: 次のジョブ名は存在しません: {0}。
ru: Следующее имя задания не существует: {0}.
zh_cn: 作业名 {0} 不存在。

# CDISA5472E
source: You must have write permissions for the {0} installation directory.
de: Sie benötigen Schreibberechtigungen für das Installationsverzeichnis {0}.
ja: {0} インストール・ディレクトリーに対する書き込み許可が必要です。
ru: Необходимо иметь разрешения на запись для каталога установки {0}.
zh_cn: 您必须具有对 {0} 安装目录的写许可权。

# CDISA5473E
source: The {0} user is not authorized to list builds for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Auflisten von Builds für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのビルドをリストする権限がありません: {1}。
ru: Пользователю {0} не разрешено получать список сборок для следующего домена: {1}.
zh_cn: {0} 用户无权列示 {1} 域的构建。

# CDISA5474E
source: The {0} user is not authorized to create a new build for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Erstellen eines neuen Builds für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインの新規ビルドを作成する権限がありません: {1}。
ru: Пользователю {0} не разрешено создавать новую сборку для следующего домена: {1}.
zh_cn: {0} 用户无权为 {1} 域创建新构建。

# CDISA5475E
source: The {0} user is not authorized to access the {1} build for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Zugriff auf den Build {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} ビルドにアクセスする権限がありません: {2}。
ru: Пользователю {0} не разрешено получать доступ к сборке {1} для следующего домена: {2}.
zh_cn: {0} 用户无权访问 {2} 域的 {1} 构建。

# CDISA5476E
source: The {0} user is not authorized to modify the {1} build for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Modifizieren des Builds {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} ビルドを変更する権限がありません: {2}。
ru: Пользователю {0} не разрешено изменять сборку {1} для следующего домена: {2}.
zh_cn: {0} 用户无权修改 {2} 域的 {1} 构建。

# CDISA5477E
source: The {0} user is not authorized to remove the {1} build from the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Entfernen des Builds {1} aus der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインから {1} ビルドを削除する権限がありません: {2}。
ru: Пользователю {0} не разрешено удалять сборку {1} из следующего домена: {2}.
zh_cn: {0} 用户无权从 {2} 域中移除 {1} 构建。

# CDISA5478E
source: The {0} build does not exist for the following domain: {1}.
de: Der Build {0} ist für die folgende Domäne nicht vorhanden: {1}.
ja: 次のドメインの {0} ビルドは存在しません: {1}。
ru: Сборка {0} не существует для следующего домена: {1}.
zh_cn: {1} 域的 {0} 构建不存在。

# CDISA5479E
source: The {0} build resource is not available for the following domain: {1}.
de: Die Buildressource {0} ist für die folgende Domäne nicht verfügbar: {1}.
ja: 次のドメインの {0} ビルド・リソースは使用可能でありません: {1}。
ru: Ресурс сборки {0} недоступен для следующего домена: {1}.
zh_cn: {0} 构建资源不可用于 {1} 域。

# CDISA5480E
source: No build resources are available for the following domain: {0}.
de: Für die folgende Domäne sind keine Buildressourcen verfügbar: {0}.
ja: 次のドメインで使用可能なビルド・リソースがありません: {0}。
ru: Нет никаких ресурсов сборки, которые были бы доступны для следующего домена: {0}.
zh_cn: 没有任何构建资源可用于 {0} 域。

# CDISA5481E
source: The {0} build has already completed for the following domain: {1}.
de: Der Build {0} wurde bereits für die folgende Domäne abgeschlossen: {1}.
ja: 次のドメインの {0} ビルドは既に完了しています: {1}。
ru: Сборка {0} уже завершена для следующего домена: {1}.
zh_cn: {1} 域的 {0} 构建已完成。

# CDISA5482E
source: The {0} build is already building for the following domain: {1}.
de: Der Build {0} wird bereits für die folgende Domäne erstellt: {1}.
ja: 次のドメインの {0} ビルドは既にビルド中です: {1}。
ru: Сборка {0} уже работает для следующего домена: {1}.
zh_cn: 已在生成 {1} 域的 {0} 构建。

# CDISA5483E
source: The {0} build has not been submitted for the following domain: {1}.
de: Der Build {0} wurde für die folgende Domäne nicht übergeben: {1}.
ja: 次のドメインの {0} ビルドはサブミットされていません: {1}。
ru: Сборка {0} не передана для следующего домена: {1}.
zh_cn: 尚未提交 {1} 域的 {0} 构建。

# CDISA5484E
source: The {0} build has not completed successfully for the following domain: {1}. The build artifact is not available.
de: Der Build {0} wurde für die folgende Domäne nicht erfolgreich abgeschlossen: {1}. Das Buildartefakt ist nicht verfügbar.
ja: 次のドメインの {0} ビルドは正常に完了しませんでした: {1}。ビルド成果物が使用可能でありません。
ru: Сборка {0} не завершена успешно для следующего домена: {1}. Артефакт сборки недоступен.
zh_cn: {1} 域的 {0} 构建尚未成功完成。构建工件不可用。

# CDISA5485E
source: Unable to locate the {0} build artifact for the following build: {1}.
de: Das Buildartefakt {0} für den folgenden Build kann nicht lokalisiert werden: {1}.
ja: 次のビルドの {0} ビルド成果物を見つけることができません: {1}。
ru: Не удается найти артефакт сборки {0} для следующей сборки: {1}.
zh_cn: 找不到 {1} 构建的 {0} 构建工件。

# CDISA5486E
source: The {0} build archive could not be unpackaged on the following build resource: {1}.
de: Das Buildarchiv {0} konnte nicht in der folgenden Buildressource entpackt werden: {1}.
ja: 次のビルド・リソースで {0} ビルド・アーカイブを解凍できませんでした: {1}。
ru: Не удалось распаковать архив сборки {0} на следующем ресурсе сборки: {1}.
zh_cn: 无法在 {1} 构建资源上解压缩 {0} 构建归档。

# CDISA5487E
source: The following build archive file extension is not supported: {0}.
de: Die folgende Buildarchivdateierweiterung wird nicht unterstützt: {0}.
ja: 次のビルド・アーカイブ・ファイル拡張子はサポートされません: {0}。
ru: Указанное ниже расширение файла архива сборки не поддерживается: {0}.
zh_cn: 不支持以下构建归档文件扩展名：{0}。

# CDISA5488E
source: The {0} build failed for the following domain: {1}.
de: Der Build {0} ist für die folgende Domäne fehlgeschlagen: {1}.
ja: 次のドメインの {0} ビルドが失敗しました: {1}。
ru: Сборка {0} завершилась неудачно для следующего домена: {1}.
zh_cn: {1} 域的 {0} 构建失败。

# CDISA5489E
source: The build configuration properties were not supplied for the following build: {0}.
de: Die Buildkonfigurationseigenschaften wurden für den folgenden Build nicht angegeben: {0}.
ja: 次のビルドのビルド構成プロパティーが指定されませんでした: {0}。
ru: Свойства конфигурации сборки не предоставлены для следующей сборки: {0}.
zh_cn: 没有为 {0} 构建提供构建配置属性。

# CDISA5490E
source: No build resources are available for the following domain: {0}.
de: Für die folgende Domäne sind keine Buildressourcen verfügbar: {0}.
ja: 次のドメインで使用可能なビルド・リソースがありません: {0}。
ru: Нет никаких ресурсов сборки, которые были бы доступны для следующего домена: {0}.
zh_cn: 没有任何构建资源可用于 {0} 域。

# CDISA5491E
source: The following build identifier is not valid: {0}.
de: Die folgende Buildkennung ist nicht gültig: {0}.
ja: 次のビルド ID は無効です: {0}。
ru: Следующий идентификатор сборки недопустим: {0}.
zh_cn: 构建标识 {0} 无效。
