Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5079E
source: The {0} service failed to start on the following resource: {1}. The following user does not have the correct permissions: {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Der folgende Benutzer hat nicht die erforderlichen Berechtigungen: {2}.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。次のユーザーは正しい許可を備えていません: {2}。
ru: Не удалось запустить службу {0} на ресурсе {1}. У указанного ниже пользователя нет необходимых разрешений: {2}.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。{2} 用户没有正确的许可权。

# CDISA5080E
source: {0} is not a valid role name. Either its size is too large or it includes some invalid characters.
de: {0} ist kein gültiger Rollenname. Er ist entweder zu lang oder er enthält ungültige Zeichen.
ja: {0} は有効なロール名でありません。サイズが大きすぎるか、無効文字が含まれています。
ru: {0} - недопустимое имя роли. Либо размер слишком велик, либо содержатся какие-то недопустимые символы.
zh_cn: {0} 是无效角色名。此名称过长，或者它包含一些无效字符。

# CDISA5081E
source: {0} is not a valid job group name. Either its size is too large or it includes some invalid characters.
de: {0} ist kein gültiger Jobgruppenname. Er ist entweder zu lang oder er enthält ungültige Zeichen.
ja: {0} は有効なジョブ・グループ名でありません。サイズが大きすぎるか、無効文字が含まれています。
ru: {0} - недопустимое имя группы заданий. Либо размер слишком велик, либо содержатся какие-то недопустимые символы.
zh_cn: {0} 是无效作业组名称。此名称过长，或者它包含一些无效字符。

# CDISA5082E
source: An unexpected zookeeper related error occurred. The error message is ''{0}''.
de: Ein unerwarteter ZooKeeper-Fehler ist aufgetreten. Fehlernachricht: ''{0}''.
ja: 予期しない ZooKeeper 関連のエラーが発生しました。エラー・メッセージは「{0}」です。
ru: Неожиданная ошибка, связанная с zookeeper. Сообщение об ошибке: ''{0}''.
zh_cn: 发生了与 ZooKeeper 相关的意外错误。错误消息为“{0}”。

# CDISA5083E
source: The {0} service failed to start on the following resource: {1}. The following port is already in use: {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Der folgende Port wird bereits verwendet: {2}.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。次のポートは既に使用中です: {2}。
ru: Не удалось запустить службу {0} на ресурсе {1}. Следующий порт уже используется: {2}.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。端口 {2} 已在使用。

# CDISA5084E
source: The {0} service is not available for the following domain: {1}.
de: Der Service {0} ist für die folgende Domäne nicht verfügbar: {1}.
ja: 次のドメインの {0} サービスは使用可能でありません: {1}。
ru: Служба {0} недоступна для следующего домена: {1}.
zh_cn: {0} 服务不可用于 {1} 域。

# CDISA5085E
source: The {0} service is not available on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} ist für die folgenden Ressourcen nicht verfügbar: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で {0} サービスが使用可能でありません: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Служба {0} недоступна на ресурсе {1}. Ресурс выделен домену {2}.
zh_cn: {0} 服务在 {1} 资源上不可用。该资源已分配到 {2} 域。

# CDISA5086E
source: The {0} service is not available for the {1} instance in the following domain: {2}.
de: Der Service {0} ist für die Instanz {1} in der folgenden Domäne nicht verfügbar: {2}.
ja: 次のドメイン内の {1} インスタンスの {0} サービスは使用可能でありません: {2}。
ru: Служба {0} недоступна для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 服务不可用于 {2} 域中的 {1} 实例。

# CDISA5087E
source: The {0} service is not available on the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} ist für die folgenden Ressourcen nicht verfügbar: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: 次のリソース上で {0} サービスが使用可能でありません: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Служба {0} недоступна на ресурсе {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: {0} 服务在 {1} 资源上不可用。该资源已分配到 {3} 域的 {2} 实例。

# CDISA5088E
source: The following domain is corrupted: {0}.
de: Die folgende Domäne ist beschädigt: {0}.
ja: 次のドメインは破損しています: {0}。
ru: Следующий домен запорчен: {0}.
zh_cn: {0} 域已损坏。

# CDISA5089E
source: An unexpected error occurred. The error message is ''{0}''.
de: Ein unerwarteter Fehler ist aufgetreten. Fehlernachricht: ''{0}''.
ja: 予期しないエラーが発生しました。エラー・メッセージは「{0}」です。
ru: Неожиданная ошибка. Сообщение об ошибке: ''{0}''.
zh_cn: 发生意外错误。错误消息为“{0}”。

# CDISA5090E
source: {0} is not a valid domain name. Either its size is too large or it includes some invalid characters.
de: {0} ist kein gültiger Domänenname. Er ist entweder zu lang oder er enthält ungültige Zeichen.
ja: {0} は有効なドメイン・ネームでありません。サイズが大きすぎるか、無効文字が含まれています。
ru: {0} - недопустимое имя домена. Либо размер слишком велик, либо содержатся какие-то недопустимые символы.
zh_cn: {0} 是无效域名。此名称过长，或者它包含一些无效字符。

# CDISA5091E
source: {0} is not a valid instance name. Either its size is too large or it includes some invalid characters.
de: {0} ist kein gültiger Instanzname. Er ist entweder zu lang oder er enthält ungültige Zeichen.
ja: {0} は有効なインスタンス名でありません。サイズが大きすぎるか、無効文字が含まれています。
ru: {0} - недопустимое имя экземпляра. Либо размер слишком велик, либо содержатся какие-то недопустимые символы.
zh_cn: {0} 是无效实例名称。此名称过长，或者它包含一些无效字符。

# CDISA5092E
source: The {0} service failed to start on the following resource: {1}. All ports are in use.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Alle Ports werden verwendet.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。すべてのポートが使用中です。
ru: Не удалось запустить службу {0} на ресурсе {1}. Все порты используются.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。所有端口都在使用中。

# CDISA5093E
source: The {0} instance is corrupted for the following domain: {1}.
de: Die Instanz {0} ist für die folgende Domäne beschädigt: {1}.
ja: 次のドメインの {0} インスタンスは破損しています: {1}。
ru: Экземпляр {0} запорчен для следующего домена: {1}.
zh_cn: {1} 域的 {0} 实例已损坏。

# CDISA5094E
source: The {0} user is not authorized to list available hosts for following domain: {1}.
de: Der Benutzer {0} ist nicht zum Auflisten verfügbarer Hosts für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインの使用可能なホストをリストする権限がありません: {1}。
ru: Пользователю {0} не разрешено получать список доступных хостов для следующего домена: {1}.
zh_cn: {0} 用户无权列示 {1} 域的可用主机。

# CDISA5095E
source: The {0} user is not authorized to view the domain configuration for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Anzeigen der Domänenkonfiguration für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのドメイン構成を表示する権限がありません: {1}。
ru: Пользователю {0} не разрешено просматривать конфигурацию для следующего домена: {1}.
zh_cn: {0} 用户无权查看 {1} 域的域配置。

# CDISA5096E
source: The {0} user is not authorized to modify the configuration for following domain: {1}.
de: Der Benutzer {0} ist nicht zum Modifizieren der Konfiguration für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインの構成を変更する権限がありません: {1}。
ru: Пользователю {0} не разрешено изменять конфигурацию для следующего домена: {1}.
zh_cn: {0} 用户无权修改 {1} 域的配置。

# CDISA5097E
source: The {0} user is not authorized to create a new instance for following domain: {1}.
de: Der Benutzer {0} ist nicht zum Erstellen einer neuen Instanz für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインの新規インスタンスを作成する権限がありません: {1}。
ru: Пользователю {0} не разрешено создавать новый экземпляр для следующего домена: {1}.
zh_cn: {0} 用户无权为 {1} 域创建新实例。

# CDISA5098E
source: The user must be the user root.
de: Der Benutzer muss der Rootbenutzer sein.
ja: ユーザーは root ユーザーでなければなりません。
ru: Пользователь должен быть пользователем root.
zh_cn: 该用户必须是 root 用户。

# CDISA5099E
source: The {0} system service already exists on the following resource: {1}. The system service is defined for the following domain: {2}.
de: Der Systemservice {0} ist in der folgenden Ressource bereits vorhanden: {1}. Der Systemservice ist für die folgende Domäne definiert: {2}.
ja: {0} システム・サービスは次のリソースに既に存在します: {1}。システム・サービスは次のドメイン用に定義されています: {2}。
ru: Системная служба {0} уже существует на следующем ресурсе: {1}. Системная служба определена для следующего домена: {2}.
zh_cn: {0} 系统服务已存在于 {1} 资源上。已为 {2} 域定义该系统服务。

# CDISA5100E
source: The {0} service did not start successfully on any resources.
de: Der Service {0} wurde in keiner Ressource erfolgreich gestartet.
ja: {0} サービスがどのリソースでも正常に開始しませんでした。
ru: Служба {0} не запустилась успешно ни на одном ресурсе.
zh_cn: 未在任何资源上成功启动 {0} 服务。

# CDISA5101E
source: The following directory cannot be created: {0}.
de: Das folgende Verzeichnis kann nicht erstellt werden: {0}.
ja: 次のディレクトリーを作成できません: {0}。
ru: Следующий каталог невозможно создать: {0}.
zh_cn: 无法创建 {0} 目录。

# CDISA5102E
source: The owner and group of the {0} directory cannot be changed to {1} user and {2} group.
de: Der Eigner und die Gruppe des Verzeichnisses {0} können nicht in den Benutzer {1} und die Gruppe {2} geändert werden.
ja: {0} ディレクトリーの所有者とグループを {1} ユーザーおよび {2} グループに変更できません。
ru: Владельца и группу для каталога {0} нельзя изменить на пользователя {1} и группу {2}.
zh_cn: 无法将 {0} 目录的所有者和组更改为 {1} 用户和 {2} 组。

# CDISA5103E
source: The group permissions of the {0} directory cannot be set to {1}.
de: Die Gruppenberechtigungen des Verzeichnisses {0} können nicht auf {1} gesetzt werden.
ja: {0} ディレクトリーのグループ許可を {1} に設定できません。
ru: Задать {1} в качестве разрешений группы для каталога {0} нельзя.
zh_cn: 无法将 {0} 目录的组许可权设置为 {1}。

# CDISA5104E
source: The group of the {0} directory cannot be changed to {1} group.
de: Die Gruppe des Verzeichnisses {0} kann nicht in die Gruppe {1} geändert werden.
ja: {0} ディレクトリーのグループを {1} グループに変更できません。
ru: Группу для каталога {0} нельзя изменить на группу {1}.
zh_cn: 无法将 {0} 目录的组更改为 {1} 组。

# CDISA5105E
source: The following file is missing from the installation: {0}.
de: Die folgende Datei fehlt in der Installation: {0}.
ja: 次のファイルがインストール済み環境で欠落しています: {0}。
ru: Указанный ниже файл отсутствует в установке: {0}.
zh_cn: 安装中缺少 {0} 文件。

# CDISA5106E
source: The {0} symlink cannot be created to the following active script file: {1}.
de: Die symbolische Verbindung {0} zur folgenden aktiven Scriptdatei kann nicht erstellt werden: {1}.
ja: 次のアクティブ・スクリプト・ファイルへの {0} シンボリック・リンクを作成できません: {1}。
ru: Невозможно создать символьную ссылку {0} в следующем активном файле сценария: {1}.
zh_cn: 无法创建指向活动脚本文件 {1} 的 {0} 符号链接。

# CDISA5107E
source: The {0} system service cannot be configured on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} kann in der folgenden Ressource nicht konfiguriert werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソースで {0} システム・サービスを構成できません: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системную службу {0} невозможно сконфигурировать на следующем ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: 无法在 {1} 资源上配置 {0} 系统服务。该资源已分配到 {2} 域。

# CDISA5108E
source: The {0} service does not exist as a system service or an unregistered service on the following resource: {1}. The domain associated with the service is: {2}.
de: Der Service {0} ist in der folgenden Ressource nicht als Systemservice oder nicht registrierter Service vorhanden: {1}. Dem Service zugeordnete Domäne: {2}.
ja: {0} サービスが次のリソースでシステム・サービスおよび未登録サービスとして存在しません: {1}。サービスに関連付けられているドメイン: {2}。
ru: Служба {0} не существует как системная служба или незарегистрированная служба на следующем ресурсе: {1}. Домен, связанный со службой: {2}.
zh_cn: {0} 服务未作为系统服务或未注册的服务存在于 {1} 资源上。与该服务相关联的域为 {2}。

# CDISA5109E
source: The {0} system service failed to start on the following resource: {1}. The domain associated with the system service is: {2}.
de: Der Systemservice {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Dem Systemservice zugeordnete Domäne: {2}.
ja: 次のリソース上で {0} システム・サービスの開始に失敗しました: {1}。システム・サービスに関連付けられているドメイン: {2}。
ru: Не удалось запустить системную службу {0} на ресурсе {1}. Домен, связанный с системной службой: {2}.
zh_cn: 无法在 {1} 资源上启动 {0} 系统服务。与该系统服务相关联的域为 {2}。

# CDISA5110E
source: The {0} system service must be started before you can run the requested operation on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} muss gestartet werden, bevor Sie die angeforderte Operation in der folgenden Ressource ausführen können: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソースで要求された操作を実行する前に、{0} システム・サービスを開始する必要があります: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системная служба {0} должна быть запущена, прежде чем можно будет выполнить затребованную операцию на следующем ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: 必须先启动 {0} 系统服务，然后您才能在资源 {1} 上运行所请求的操作。该资源已分配到 {2} 域。

# CDISA5111E
source: The {0} service failed to stop on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestoppt werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で {0} サービスの停止に失敗しました: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Не удалось запустить службу {0} на ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: 无法在 {1} 资源上停止 {0} 服务。该资源已分配到 {2} 域。

# CDISA5112E
source: The {0} system service is already started on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} wurde bereits in der folgenden Ressource gestartet: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: {0} システム・サービスは次のリソースで既に開始されています: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системная служба {0} уже запущена на следующем ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: {1} 资源上已启动 {0} 系统服务。该资源已分配到 {2} 域。

# CDISA5113E
source: {0} is not a valid application configuration name. Either its size is too large or it includes some invalid characters.
de: {0} ist kein gültiger Anwendungskonfigurationsname. Er ist entweder zu lang oder er enthält ungültige Zeichen.
ja: {0} は有効なアプリケーション構成名でありません。サイズが大きすぎるか、無効文字が含まれています。
ru: {0} не является действительнем именем конфигурации приложения. Либо размер слишком велик, либо содержатся какие-то недопустимые символы.
zh_cn: {0} 是无效应用程序配置名称。此名称过长，或者它包含一些无效字符。

# CDISA5114E
source: The {0} system service was removed with warnings from the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} wurde mit Warnungen aus der folgenden Ressource entfernt: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: {0} システム・サービスが次のリソースから削除されましたが、警告が出されました: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системная служба {0} удалена с предупреждениями от следующего ресурса: {1}. Ресурс выделен домену {2}.
zh_cn: 已从 {1} 资源中移除 {0} 系统服务，但存在警告。该资源已分配到 {2} 域。

# CDISA5115E
source: The {0} user is not authorized to view system logs for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Anzeigen von Systemprotokollen für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのシステム・ログを表示する権限がありません: {1}。
ru: Пользователю {0} не разрешено просматривать системные журналы для следующего домена: {1}.
zh_cn: {0} 用户无权查看 {1} 域的系统日志。

# CDISA5116E
source: The {0} user is not authorized to view application logs for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Anzeigen von Anwendungsprotokollen für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのアプリケーション・ログを表示する権限がありません: {2}。
ru: Пользователю {0} не разрешено просматривать журналы приложений для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权查看 {2} 域中的 {1} 实例的应用程序日志。

# CDISA5117E
source: The {0} user is not authorized to the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht für die Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスに対する権限がありません: {2}。
ru: Пользователю {0} не разрешено работать с экземпляром {1} для следующего домена: {2}.
zh_cn: 未授权 {0} 用户使用 {2} 域的 {1} 实例。

# CDISA5118E
source: The {0} log file does not exist on the following resource: {1}.
de: Die Protokolldatei {0} ist in der folgenden Ressource nicht vorhanden: {1}.
ja: {0} ログ・ファイルは次のリソースで存在しません: {1}。
ru: Файл журнала {0} не существует на следующем ресурсе: {1}.
zh_cn: {0} 日志文件未存在于 {1} 资源上。

# CDISA5119E
source: Log retrieval timed out for the {0} resource in the following domain: {1}.
de: Beim Protokollabruf für die Ressource {0} in der folgenden Domäne wurde das zulässige Zeitlimit überschritten: {1}.
ja: 次のドメイン内の {0} リソースでログ取得がタイムアウトになりました: {1}。
ru: Истек тайм-аут получения журнала для ресурса {0} в следующем домене: {1}.
zh_cn: 对 {1} 域中的 {0} 资源执行日志检索时发生超时。

# CDISA5120E
source: The {0} user is not authorized to view system logs for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Anzeigen von Systemprotokollen für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのシステム・ログを表示する権限がありません: {2}。
ru: Пользователю {0} не разрешено просматривать системные журналы для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权查看 {2} 域中的 {1} 实例的系统日志。

# CDISA5121E
source: The {0} user is not authorized to read data for the following view: {1}. The view is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Anzeigen von Daten für die folgende Ansicht berechtigt: {1}. Die Ansicht ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のビューのデータを読み取る権限がありません: {1}。ビューは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено читать данные для следующего представления: {1}. Представление выделено экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权读取 {1} 视图的数据。该视图已分配到 {3} 域的 {2} 实例。

# CDISA5122E
source: The tuple definition for the stream associated with {0} view has changed. The view cannot be started.
de: Die Tupeldefinition für den der Ansicht {0} zugeordneten Datenstrom wurde geändert. Die Ansicht kann nicht gestartet werden.
ja: {0} ビューに関連付けられているストリームのタプル定義が変更されています。ビューを開始できません。
ru: Определение кортежа для потока, связанного с представлением {0}, изменилось. Представление не удается запустить.
zh_cn: 与 {0} 视图相关联的流的元组定义已更改。无法启动该视图。

# CDISA5123E
source: The {0} user is not authorized to access the following view: {1}. The view is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Zugriff auf die folgende Ansicht berechtigt: {1}. Die Ansicht ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のビューにアクセスする権限がありません: {1}。ビューは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено получать доступ к следующему представлению: {1}. Представление выделено экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权访问 {1} 视图。该视图已分配到 {3} 域的 {2} 实例。

# CDISA5124E
source: The {0} host cannot be removed from following domain: {1}. The host is currently starting.
de: Der Host {0} kann nicht aus der folgenden Domäne entfernt werden: {1}. Der Host wird zurzeit gestartet.
ja: {0} ホストを次のドメインから削除できません: {1}。ホストは現在開始中です。
ru: Хост {0} невозможно удалить из следующего домена: {1}. Хост сейчас запускается.
zh_cn: 无法从 {1} 域中移除 {0} 主机。该主机当前正在启动。

# CDISA5125E
source: {0} is not a valid build name. Either its size is too large or it includes some invalid characters.
de: {0} ist kein gültiger Buildname. Er ist entweder zu lang oder er enthält ungültige Zeichen.
ja: {0} は有効なビルド名でありません。サイズが大きすぎるか、無効文字が含まれています。
ru: {0} не является действительным именем сборки. Либо размер слишком велик, либо содержатся какие-то недопустимые символы.
zh_cn: {0} 是无效构建名称。此名称过长，或者它包含一些无效字符。

# CDISA5128E
source: The {0} resource cannot be quiesced for the following domain: {1}. The resource is the only available resource in the domain.
de: Die Ressource {0} kann für die folgende Domäne nicht in den Quiescemodus versetzt werden: {1}. Die Ressource ist die einzige verfügbare Ressource in der Domäne.
ja: 次のドメインの {0} リソースを静止できません: {1}。このリソースはドメイン内の使用可能な唯一のリソースです。
ru: Не удалось стабилизировать ресурс {0} для следующего домена: {1}. Ресурс - единственный имеющийся ресурс в домене.
zh_cn: 无法使 {1} 域的 {0} 资源停顿。该资源是该域中唯一可用的资源。

# CDISA5129E
source: The name supplied contains characters that are not valid.
de: Der angegebene Name enthält ungültige Zeichen.
ja: 指定された名前には、無効な文字が含まれています。
ru: Введенное имя содержит недопустимые символы.
zh_cn: 所提供的名称包含无效字符。

# CDISA5130E
source: The description supplied contains characters that are not valid.
de: Die angegebene Beschreibung enthält ungültige Zeichen.
ja: 指定された説明には、無効な文字が含まれています。
ru: Введенное описание содержит недопустимые символы.
zh_cn: 所提供的描述包含无效字符。

# CDISA5131E
source: The {0} user is not authorized to add a host or add a service to a host for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Hinzufügen eines Hosts oder zum Hinzufügen eines Service zu einem Host für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインでのホストの追加およびホストへのサービスの追加を行う権限がありません: {1}。
ru: Пользователю {0} не разрешено добавлять хост или добавлять службу на хост для следующего домена: {1}.
zh_cn: {0} 用户无权为 {1} 域添加主机或向该域的主机添加服务。

# CDISA5132E
source: The {0} user is not authorized to remove a host or remove a service from a host for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Entfernen eines Hosts oder zum Entfernen eines Service von einem Host für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインでのホストの削除およびホストからのサービスの削除を行う権限がありません: {1}。
ru: Пользователю {0} не разрешено удалять хост или удалять службу с хоста для следующего домена: {1}.
zh_cn: {0} 用户无权从 {1} 域中移除主机或从该域的主机中移除服务。

# CDISA5133E
source: The {0} user is not authorized to view a host and its services for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Anzeigen eines Hosts und der zugehörigen Services für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのホストおよびそのサービスを表示する権限がありません: {1}。
ru: Пользователю {0} не разрешено просматривать хост и его службы для следующего домена: {1}.
zh_cn: {0} 用户无权查看 {1} 域的主机及其服务。

# CDISA5134E
source: The {0} user is not authorized to change the attributes of a host for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Ändern der Attribute eines Hosts für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのホストの属性を変更する権限がありません: {1}。
ru: Пользователю {0} не разрешено изменять атрибуты хоста для следующего домена: {1}.
zh_cn: {0} 用户无权更改 {1} 域的主机属性。

# CDISA5135E
source: The {0} user is not authorized to access data for the following job: {1}. The job is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Zugriff auf Daten für den folgenden Job berechtigt: {1}. Der Job ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のジョブのデータにアクセスする権限がありません: {1}。ジョブは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено получать доступ к данным для следующего задания: {1}. Задание выделено экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权访问 {1} 作业的数据。该作业已分配到 {3} 域的 {2} 实例。

# CDISA5136E
source: The {0} host cannot be removed from the following domain: {1}. The host is the only host in the domain and the domain is started.
de: Der Host {0} kann nicht aus der folgenden Domäne entfernt werden: {1}. Der Host ist der einzige Host in der Domäne und die Domäne ist gestartet.
ja: {0} ホストを次のドメインから削除できません: {1}。このホストはドメイン内の唯一のホストであり、ドメインが開始されています。
ru: Хост {0} невозможно удалить из следующего домена: {1}. Хост - единственный хост в домене, и домен запущен.
zh_cn: 无法从 {1} 域中移除 {0} 主机。该主机是该域中的唯一主机，并且该域已启动。

# CDISA5137E
source: The {0} user is not authorized to stop the following service: {1}. The service is allocated to the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Stoppen des folgenden Service berechtigt: {1}. Der Service ist der folgenden Domäne zugeordnet: {2}.
ja: {0} ユーザーには、次のサービスを停止する権限がありません: {1}。サービスは次のドメインに割り振られています: {2}。
ru: Пользователю {0} не разрешено останавливать следующую службу: {1}. Ресурс выделен следующему домену: {2}.
zh_cn: {0} 用户无权停止 {1} 服务。该服务已分配到 {2} 域。
