Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsRuntimeMessages_*.xlf
Languages: ko, pt_br

# CDISR1303I
source: The Streams Application Manager is starting a canceljob for job ID {0}.
ko: Streams Application Manager가 작업 ID {0}에 대한 canceljob을 시작하는 중입니다.
pt_br: O Streams Application Manager está iniciando um cancelamento de tarefa para o ID de tarefa {0}.

# CDISR1304I
source: The Streams Application Manager finished the canceljob event for job ID {0}.
ko: Streams Application Manager가 작업 ID {0}에 대한 canceljob 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento de cancelamento de tarefa para o ID de tarefa {0}.

# CDISR1305I
source: The Streams Application Manager unregistered job ID {0}.
ko: Streams Application Manager가 작업 ID {0}을(를) 등록 취소했습니다.
pt_br: O Streams Application Manager cancelou o registro do ID de tarefa {0}.

# CDISR1307I
source: The Streams Application Manager finished the stoppe event for the processing element ID {0}.
ko: Streams Application Manager가 처리 요소 ID {0}에 대한 stoppe 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento stoppe para o ID do elemento de processamento {0}.

# CDISR1310I
source: The Streams Application Manager finished the stoppe event for job ID {0}.
ko: Streams Application Manager가 작업 ID {0}에 대한 stoppe 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento stoppe para o ID da tarefa {0}.

# CDISR1312I
source: The Streams Application Manager finished the restartpe event for the processing element ID {0}.
ko: Streams Application Manager가 처리 요소 ID {0}에 대한 restartpe 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento restartpe para o ID do elemento de processamento {0}.

# CDISR1314I
source: The Streams Application Manager finished the restartpe event for the processing element ID {0} on the {1} host.
ko: Streams Application Manager가 {1} 호스트에서 처리 요소 ID {0}에 대한 restartpe 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento restartpe para o ID do elemento de processamento {0} no host {1}.

# CDISR1316I
source: The Streams Application Manager finished the restartpe event for the following job: {0}.
ko: Streams Application Manager가 {0} 작업에 대한 restartpe 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento restartpe para a tarefa a seguir: {0}.

# CDISR1317I
source: The processing element ID {0} is in the running state in the Streams Application Manager. It is running with process ID {1} of resource {2}.
ko: 처리 요소 ID {0}이(가) Streams Application Manager에서 실행 중 상태입니다. {2} 자원의 프로세스 ID {1}(으)로 실행 중입니다.
pt_br: O ID do elemento de processamento {0} está no estado de execução no Streams Application Manager. Ele está em execução com o ID do processo {1} do recurso {2}.

# CDISR1319I
source: The Streams Application Manager finished the updatepe event for processing element ID {0}.
ko: Streams Application Manager가 처리 요소 ID {0}에 대한 updatepe 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento updatepe para o ID do elemento de processamento {0}.

# CDISR1321I
source: The Streams Application Manager finished the updatepe event for job ID {0}.
ko: Streams Application Manager가 작업 ID {0}에 대한 updatepe 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento updatepe para o ID da tarefa {0}.

# CDISR1322I
source: The Streams Application Manager finished updating processing element ID {0} with the {1} configuration.
ko: Streams Application Manager가 {1} 구성의 처리 요소 ID {0} 갱신을 완료했습니다.
pt_br: O Streams Application Manager concluiu o ID do elemento de processamento de atualização {0} com a configuração {1}.

# CDISR1324I
source: The Streams Application Manager finished the addStreamProperty event for output port ID {0}.
ko: Streams Application Manager가 출력 포트 ID {0}에 대한 addStreamProperty 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento addStreamProperty para o ID da porta de saída {0}.

# CDISR1326I
source: The Streams Application Manager finished the addStreamProperties event for output port ID {0}.
ko: Streams Application Manager가 출력 포트 ID {0}에 대한 addStreamProperties 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento addStreamProperties para o ID da porta de saída {0}.

# CDISR1327I
source: The Streams Application Manager finished adding the {0} stream properties to output port ID {1}.
ko: Streams Application Manager가 출력 포트 ID {1}에 {0} 스트림 특성 추가를 완료했습니다.
pt_br: O Streams Application Manager concluiu a inclusão das propriedades do fluxo {0} no ID da porta de saída {1}.

# CDISR1331I
source: The Streams Application Manager finished the setStreamProperties event for output port ID {0}.
ko: Streams Application Manager가 출력 포트 ID {0}에 대한 setStreamProperties 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento setStreamProperties para o ID da porta de saída {0}.

# CDISR1332I
source: The Streams Application Manager finished setting the {0} stream properties for output port ID {1}.
ko: Streams Application Manager가 출력 포트 ID {1}에 {0} 스트림 특성 설정을 완료했습니다.
pt_br: O Streams Application Manager concluiu a configuração das propriedades do fluxo {0} para o ID da porta de saída {1}.

# CDISR1336I
source: The Streams Application Manager finished the removeStreamProperties event for output port ID {0}.
ko: Streams Application Manager가 출력 포트 ID {0}에 대한 removeStreamProperties 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento removeStreamProperties para o ID da porta de saída {0}.

# CDISR1337I
source: The Streams Application Manager finished removing the {0} stream properties from output port ID {1}.
ko: Streams Application Manager가 출력 포트 ID {1}에서 {0} 스트림 특성 제거를 완료했습니다.
pt_br: O Streams Application Manager concluiu a remoção das propriedades do fluxo {0} do ID da porta de saída {1}.

# CDISR1339I
source: The Streams Application Manager finished the setSubscription event for input port ID {0}.
ko: Streams Application Manager가 입력 포트 ID {0}에 대한 setSubscription 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento setSubscription para o ID da porta de entrada {0}.

# CDISR1340I
source: The Streams Application Manager finished setting the {0} subscription for input port ID {1}.
ko: Streams Application Manager가 입력 포트 ID {1}에 {0} 서브스크립션 설정을 완료했습니다.
pt_br: O Streams Application Manager concluiu a configuração da assinatura {0} para o ID da porta de entrada {1}.

# CDISR1342I
source: The Streams Application Manager finished the setFilter event for input port ID {0}.
ko: Streams Application Manager가 입력 포트 ID {0}에 대한 setFilter 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento setFilter para o ID da porta de entrada {0}.

# CDISR1343I
source: The Streams Application Manager finished setting the {0} filter for input port ID {1}.
ko: Streams Application Manager가 입력 포트 ID {1}에 {0} 필터 설정을 완료했습니다.
pt_br: O Streams Application Manager concluiu a configuração do filtro {0} para o ID da porta de entrada {1}.

# CDISR1345I
source: The Streams Application Manager finished the openStreamView event for view ID {0}.
ko: Streams Application Manager가 보기 ID {0}에 대한 openStreamView 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento openStreamView para o ID de visualização {0}.

# CDISR1346I
source: The Streams Application Manager finished opening the {0} view for job ID {1}.
ko: Streams Application Manager가 작업 ID {1}에 대한 {0} 보기 열기를 완료했습니다.
pt_br: O Streams Application Manager concluiu a abertura da visualização {0} para o ID da tarefa {1}.

# CDISR1348I
source: The Streams Application Manager finished a closeStreamView event for the {0} view.
ko: Streams Application Manager가 {0} 보기에 대한 closeStreamView 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu um evento closeStreamView para a visualização {0}.

# CDISR1349I
source: The Streams Application Manager closed the {0} view.
ko: Streams Application Manager가 {0} 보기를 닫았습니다.
pt_br: O Streams Application Manager encerrou a visualização {0}.

# CDISR1351I
source: The Streams Application Manager finished a setStreamViewProperties event for the {0} view.
ko: Streams Application Manager가 {0} 보기에 대한 setStreamViewProperties 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu um evento setStreamViewProperties para a visualização {0}.

# CDISR1352I
source: The Streams Application Manager set the {0} view with the following properties: {1}.
ko: Streams Application Manager가 {1} 특성으로 {0} 보기를 설정했습니다.
pt_br: O Streams Application Manager configurou a visualização {0} com as propriedades a seguir: {1}.

# CDISR1353E
source: The job submission for the application failed because there is more than one operator-driven start operator in a consistent region.
ko: 일관성 있는 영역에 둘 이상의 연산자 구동 시작 연산자가 있으므로 애플리케이션의 작업 제출에 실패했습니다.
pt_br: O envio de tarefa para o aplicativo falhou porque há mais de um operador de início orientado por operador em uma região consistente.

# CDISR1354I
source: The following IBM Streams application host is added: {0}.
ko: IBM Streams 애플리케이션 호스트 {0}을(를) 추가했습니다.
pt_br: O host de aplicativos IBM Streams a seguir é incluído: {0}.

# CDISR1355I
source: The following IBM Streams application host is removed: {0}.
ko: IBM Streams 애플리케이션 호스트 {0}을(를) 제거했습니다.
pt_br: O host de aplicativos IBM Streams a seguir é removido: {0}.

# CDISR1356I
source: The state of the {0} resource is updated to {1}.
ko: {0} 자원의 상태를 {1}(으)로 갱신했습니다.
pt_br: O estado do recurso {0} é atualizado para {1}.

# CDISR1357E
source: The application did not start because the following configuration parameters cannot be used for the same job submission: {0}.
ko: 구성 매개변수 {0}을(를) 동일한 작업 제출에 사용할 수 없으므로 애플리케이션이 시작되지 않았습니다.
pt_br: O aplicativo não foi iniciado porque os parâmetros de configuração a seguir não podem ser usados para o mesmo envio de tarefa: {0}.

# CDISR1358E
source: The Streams Application Manager encountered the following internal error: {0}.
ko: Streams Application Manager에서 내부 오류 {0}이(가) 발생했습니다.
pt_br: O Streams Application Manager encontrou o erro interno a seguir: {0}.

# CDISR1359E
source: The job submission or preview failed because the consistent region configuration contains too many start operators that are operator driven.
ko: 일관성 있는 영역 구성에 연산자 구동 시작 연산자가 지나치게 많이 포함되어 있어 작업 제출 또는 미리보기에 실패했습니다.
pt_br: Falha na visualização ou envio de tarefa porque a configuração de região consistente contém muitos operadores de início orientados por operador.

# CDISR1360E
source: The application did not start because it was compiled on an IBM Streams version that is not supported by the current version.
ko: 현재 버전에 지원되지 않는 IBM Streams 버전에서 애플리케이션이 컴파일되었기 때문에 시작되지 않았습니다.
pt_br: O aplicativo não foi iniciado porque foi compilado em uma versão do IBM Streams não suportada pela versão atual.

# CDISR1370E
source: The Streams Application Manager did not recover state data because the following error occurred: {0}.
ko: {0} 오류가 발생했으므로 Streams Application Manager가 상태 데이터를 복구하지 못했습니다.
pt_br: O Streams Application Manager não recuperou dados de estado porque ocorreu o erro a seguir: {0}.

# CDISR1371E
source: The job preview failed because of the following error: {0}.
ko: {0} 오류로 인해 작업 미리보기에 실패했습니다.
pt_br: Falha na visualização da tarefa devido ao erro a seguir: {0}.

# CDISR1372E
source: The job submission or preview failed because the following operator configuration parameter is not valid: {0}.
ko: 연산자 구성 매개변수 {0}이(가) 유효하지 않아 작업 제출 또는 미리보기에 실패했습니다.
pt_br: Falha na visualização ou no envio de tarefa porque o parâmetro de configuração do operador a seguir não é válido: {0}.

# CDISR1373E
source: The operation failed because the format of the following operator configuration parameter is not valid: {0}. The correct syntax is {1}.
ko: 연산자 구성 매개변수 {0}의 형식이 유효하지 않기 때문에 조작이 실패했습니다. 올바른 구문은 {1}입니다.
pt_br: A operação falhou porque o formato do parâmetro de configuração do operador a seguir não é válido: {0}. A sintaxe correta é {1}.

# CDISR1374E
source: The operation failed because an error occurred while parsing the following job configuration overlay file: {0}. The error is: {1}.
ko: 작업 구성 겹쳐쓰기 파일 {0}을(를) 구문 분석하는 중에 오류가 발생했기 때문에 조작이 실패했습니다. 오류는 {1}입니다.
pt_br: A operação falhou porque um erro ocorreu ao analisar o arquivo de sobreposição de configuração de tarefa a seguir: {0}. O erro é: {1}.

# CDISR1375W
source: No tuples will be imported or exported for this application because it is running in standalone mode.
ko: 애플리케이션이 독립형 모드로 실행 중이므로 이 애플리케이션에 대한 튜플을 임포트하거나 익스포트할 수 없습니다.
pt_br: Nenhuma tupla será importada ou exportada para esse aplicativo porque ele está em execução no modo independente.

# CDISR1376W
source: The {0} annotation is not supported in applications that are running in standalone mode.
ko: {0} 어노테이션이 독립형 모드로 실행 중인 애플리케이션에 지원되지 않습니다.
pt_br: A anotação {0} não é suportada em aplicativos que estão em execução no modo independente.

# CDISR1377W
source: The {0} configuration is not supported in applications that are running in standalone mode.
ko: {0} 구성이 독립형 모드로 실행 중인 애플리케이션에 지원되지 않습니다.
pt_br: A configuração {0} não é suportada em aplicativos que estão em execução no modo independente.

# CDISR1378E
source: The application did not start because the streams::pe.display submission-time parameter or the DISPLAY environment variable is not set.
ko: streams::pe.display 제출 시간 매개변수 또는 DISPLAY 환경 변수를 설정하지 않았으므로 애플리케이션이 시작되지 않았습니다.
pt_br: O aplicativo não foi iniciado porque o parâmetro streams::pe.display submission-time ou a variável de ambiente DISPLAY não estão configurados.

# CDISR1379I
source: The Streams Application Manager added the {1} custom metric for job ID {0}. The kind of metric is: {2}. This metric provides the following information: {3}.
ko: Streams Application Manager가 작업 ID {0}에 대한 {1} 사용자 정의 메트릭을 추가했습니다. 메트릭의 종류는 {2}입니다. 이 메트릭은 {3} 정보를 제공합니다.
pt_br: O Streams Application Manager incluiu a métrica customizada {1} para o ID da tarefa {0}. O tipo de métrica é: {2}. Essa métrica fornece as informações a seguir: {3}.

# CDISR1380I
source: The Streams Application Manager created processing element {0} for job ID {1}. This processing element includes the following operators: {2}.
ko: Streams Application Manager가 작업 ID {1}의 처리 요소 {0}을(를) 작성했습니다. 이 처리 요소에 {2} 연산자가 있습니다.
pt_br: O Streams Application Manager criou o elemento de processamento {0} para o ID da tarefa {1}. Esse elemento de processamento inclui os operadores a seguir: {2}.

# CDISR1381E
source: The operation did not complete because the operator at index {0} for job ID {1} was not found.
ko: 작업 ID {1}에 대한 인덱스 {0}의 연산자를 찾을 수 없으므로 조작이 완료되지 않았습니다.
pt_br: A operação não foi concluída porque o operador no índice {0} para o ID da tarefa {1} não foi localizado.

# CDISR1382E
source: The operation did not complete for operator {1}. The operator input port at index {0} for job ID {2} was not found.
ko: {1} 연산자에 대한 조작이 완료되지 않았습니다. 작업 ID {2}에 대한 인덱스 {0}의 연산자 입력 포트가 없습니다.
pt_br: A operação não foi concluída para o operador {1}. A porta de entrada do operador no índice {0} para o ID da tarefa {2} não foi localizada.

# CDISR1383E
source: The operation did not complete for operator {1}. The operator output port at index {0} for job ID {2} was not found.
ko: {1} 연산자에 대한 조작이 완료되지 않았습니다. 작업 ID {2}에 대한 인덱스 {0}의 연산자 출력 포트가 없습니다.
pt_br: A operação não foi concluída para o operador {1}. A porta de saída do operador no índice {0} para o ID da tarefa {2} não foi localizada.

# CDISR1384E
source: The operation did not complete for PE ID {1}. The PE input port ID {0} for job ID {2} was not found.
ko: PE ID {1}에 대한 조작이 완료되지 않았습니다. 작업 ID {2}에 대한 PE 입력 포트 ID {0}이(가) 없습니다.
pt_br: A operação não foi concluída para o ID do PE {1}. O ID da porta de entrada do PE {0} para o ID da tarefa {2} não foi localizado.

# CDISR1385E
source: The operation did not complete for PE ID {1}. The PE output port ID {0} for job ID {2} was not found.
ko: PE ID {1}에 대한 조작이 완료되지 않았습니다. 작업 ID {2}에 대한 PE 출력 포트 ID {0}이(가) 없습니다.
pt_br: A operação não foi concluída para o ID do PE {1}. O ID da porta de saída do PE {0} para o ID da tarefa {2} não foi localizado.

# CDISR1386E
source: The operation did not complete because the PE connection ID {0} was not found.
ko: PE 연결 ID {0}을(를) 찾을 수 없으므로 조작이 완료되지 않았습니다.
pt_br: A operação não foi concluída porque o ID de conexão do PE {0} não foi localizado.

# CDISR1387E
source: The information for job ID {0} could not be retrieved because the job composite for the job was invalid.
ko: 작업에 대한 작업 컴포지트가 유효하지 않으므로 작업 ID {0}에 대한 정보를 검색할 수 없습니다.
pt_br: As informações para o ID de tarefa {0} não puderam ser recuperadas porque a tarefa composta para a tarefa era inválida.

# CDISR1388E
source: One or more processing elements for job ID {0} did not start.
ko: 작업 ID {0}에 대한 하나 이상의 처리 요소가 시작되지 않았습니다.
pt_br: Um ou mais elementos de processamento para o ID da tarefa {0} não foram iniciados.

# CDISR1389E
source: The operation did not complete because a processing element was not found for operator {0}.
ko: 연산자 {0}의 처리 요소가 없으므로 조작이 완료되지 않았습니다.
pt_br: A operação não foi concluída porque um elemento de processamento não foi localizado para o operador {0}.

# CDISR1390E
source: A lock was already acquired for task: {0}.
ko: {0} 태스크에 대한 잠금을 이미 획득했습니다.
pt_br: Um bloqueio já foi adquirido para a tarefa: {0}.

# CDISR1391E
source: A state transition could not complete from {0} to {1} because it was invalid.
ko: {0}에서 {1}(으)로의 상태 전이가 유효하지 않으므로 완료되지 않습니다.
pt_br: Uma transição de estado não pôde ser concluída de {0} para {1} porque era inválida.

# CDISR1392E
source: The following SPL type was unrecognized: {0}.
ko: SPL 유형 {0}을(를) 인식할 수 없습니다.
pt_br: O tipo SPL a seguir era desconhecido: {0}.

# CDISR1393E
source: The system could not retrieve the name or address of the local host.
ko: 시스템이 로컬 호스트의 이름 또는 주소를 검색할 수 없습니다.
pt_br: O sistema não pôde recuperar o nome ou endereço do host local.

# CDISR1394E
source: The system could not serialize object [{0}]. The error message is {1}.
ko: 시스템이 [{0}] 오브젝트를 직렬화할 수 없습니다. 오류 메시지는 {1}입니다.
pt_br: O sistema não pôde serializar o objeto [{0}]. A mensagem de erro é {1}.

# CDISR1395E
source: The system could not deserialize object [{0}]. The error message is {1}.
ko: 시스템이 [{0}] 오브젝트를 직렬화 해제할 수 없습니다. 오류 메시지는 {1}입니다.
pt_br: O sistema não pôde desserializar o objeto [{0}]. A mensagem de erro é {1}.

# CDISR1396E
source: The Streams Application Manager did not recover state for {0} because the following error occurred: {1}.
ko: {1} 오류가 발생했으므로 Streams Application Manager가 {0}의 상태를 복구하지 못했습니다.
pt_br: O Streams Application Manager não recuperou o estado para {0} porque ocorreu o erro a seguir: {1}.

# CDISR1397E
source: Processing element ID {0} does not exist for job {1}.
ko: {1} 작업에 대한 처리 요소 ID {0}이(가) 존재하지 않습니다.
pt_br: O ID de elemento de processamento {0} não existe para a tarefa {1}.

# CDISR1398I
source: The Streams Application Manager finished the update operators event for the following job: {0}.
ko: Streams Application Manager에서 {0} 작업에 대한 연산자 갱신 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento de operadores de atualização para a tarefa a seguir: {0}.

# CDISR1399E
source: Operator name {0} does not exist in job {1}.
ko: {1} 작업에 연산자 이름 {0}이(가) 존재하지 않습니다.
pt_br: O nome do operador {0} não existe na tarefa {1}.

# CDISR1400E
source: The processing elements {0} must be stopped before it can be restarted.
ko: 처리 요소 {0}을(를) 재시작하려면 먼저 해당 처리 요소를 중지해야 합니다.
pt_br: Os elementos de processamento {0} devem ser interrompidos antes de poderem ser reiniciados.

# CDISR1402I
source: The following processing element (PE) IDs were started: {0}. The PEs are in the {1} instance in the {2} domain.
ko: 처리 요소(PE) ID {0}이(가) 시작되었습니다. 해당 PE는 {2} 도메인의 {1} 인스턴스에 있습니다.
pt_br: Os IDs de elemento de processamento (PE) a seguir foram iniciados: {0}. Os PEs estão na instância {1} no domínio {2}.

# CDISR1403I
source: The following processing element (PE) IDs were stopped: {0}. The PEs are in the {1} instance in the {2} domain.
ko: 처리 요소(PE) ID {0}이(가) 중지되었습니다. 해당 PE는 {2} 도메인의 {1} 인스턴스에 있습니다.
pt_br: Os IDs de elemento de processamento (PE) a seguir foram interrompidos: {0}. Os PEs estão na instância {1} no domínio {2}.

# CDISR1404I
source: The following processing elements (PEs) were removed: {0}. The following processing elements were added: {1}. The PEs are in the {2} instance in the {3} domain.
ko: 처리 요소(PE) {0}이(가) 제거되었습니다. 처리 요소 {1}이(가) 추가되었습니다. 해당 PE는 {3} 도메인의 {2} 인스턴스에 있습니다.
pt_br: Os elementos de processamento (PEs) a seguir foram removidos: {0}. Os elementos de processamento a seguir foram incluídos: {1}. Os PEs estão na instância {2} no domínio {3}.

# CDISR1405E
source: The parallel region name specification {0} is ambiguous. The name specification matches {1} for application id {2}. Only one matching logical parallel region name is allowed.
ko: 병렬 영역 이름 스펙 {0}이(가) 앰비규어스입니다. 이름 스펙이 애플리케이션 ID {2}의 {1}과(와) 일치합니다. 일치하는 논리적 병렬 영역 이름이 하나만 허용됩니다.
pt_br: A especificação do nome da região paralela {0} é ambígua. A especificação do nome corresponde ao {1} para o ID do aplicativo {2}. Apenas um nome de região paralela lógica correspondente é permitido.

# CDISR1406E
source: The {0} value is not valid for the {1} attribute. This attribute is in the following section: {2}.
ko: {1} 속성에 대해 {0} 값이 유효하지 않습니다. 이 속성은 {2} 섹션에 있습니다.
pt_br: O valor {0} não é válido para o atributo {1}. Esse atributo está na seguinte seção: {2}.

# CDISR1407E
source: The updateoperators operation for job id {0} failed because the following affected operators were found to be in a consistent region: {1}.
ko: 영향을 받는 {1} 연산자가 일관성 있는 영역에 있으므로 작업 ID {0}에 대한 updateoperators 조작이 실패했습니다.
pt_br: A operação updateoperators para o ID da tarefa {0} falhou porque os seguintes operadores afetados foram considerados como estando em uma região consistente: {1}.

# CDISR1408E
source: The value of ''{0}'' is specified for the ''{1}'' attribute, but no target operators are specified. This attribute is in the following section in the job configuration overlay: ''{2}''.
ko: ''{1}'' 속성에 ''{0}'' 값이 지정되었지만 대상 연산자가 지정되지 않았습니다. 이 속성은 작업 구성 겹쳐쓰기의 ''{2}'' 섹션에 있습니다.
pt_br: O valor de ''{0}'' está especificado para o atributo ''{1}'', mas nenhum operador de destino está especificado. Esse atributo está na seção a seguir na sobreposição de configuração de tarefa: ''{2}''.

# CDISR1409E
source: The operator name specification {0} does not match any operators in job {1}.
ko: 연산자 이름 스펙 {0}이(가) {1} 작업에 있는 연산자와 일치하지 않습니다.
pt_br: A especificação do nome do operador {0} não corresponde a nenhum operador na tarefa {1}.

# CDISR1410E
source: The operation failed for job {0} because the application description language (ADL) string cannot be retrieved from the application cache repository or an application resource.
ko: 애플리케이션 캐시 저장소 또는 애플리케이션 자원에서 애플리케이션 설명 언어(ADL) 문자열을 검색할 수 없기 때문에 {0} 작업에 대한 조작이 실패했습니다.
pt_br: A operação falhou para a tarefa {0} porque não foi possível recuperar a sequência da linguagem de descrição de aplicativo (ADL) do cache do aplicativo ou de um recurso de aplicativo.

# CDISR1411E
source: The parallel region name specification {0} does not match any parallel regions for application id {1}.
ko: 병렬 영역 이름 스펙 {0}이(가) 애플리케이션 ID {1}에 대한 병렬 영역과 일치하지 않습니다.
pt_br: A especificação do nome da região paralela {0} não corresponde a nenhuma região paralela para o ID do aplicativo {1}.

# CDISR1412E
source: The operation failed because an updateoperators operation is in progress.
ko: updateoperators 조작을 진행 중이기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque uma operação updateoperators está em andamento.
