Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA9017E
source: Failed to create a thread on resource {0}. This can be caused by the specified ulimit settings. Make sure the ulimit setting for nproc is set to the recommended size.
de: Es konnte kein Thread in Ressource {0} erstellt werden. Dies kann durch die angegebenen ulimit-Einstellungen verursacht werden. Stellen Sie sicher, dass die ulimit-Einstellung für nproc auf die empfohlene Größe gesetzt ist.
ja: リソース {0} でのスレッドの作成に失敗しました。指定されている ulimit 設定がこの原因である可能性があります。nproc の ulimit 設定が推奨サイズに設定されていることを確認してください。
ru: Не удалось создать поток на ресурсе {0}. Это может быть вызвано заданными параметрами ulimit. Убедитесь, что в качестве значения параметра ulimit для nproc задан рекомендуемый размер.
zh_cn: 无法在资源 {0} 上创建线程。这可能是由于指定的 ulimit 设置所致。请确保 nproc 的 ulimit 设置设定为建议的大小。

# MSG1
source: Authenticating using certificates failed with the following message. If you want to use certificates to authenticate, you will need to correct the error and try again; or to continue with the request, you will need to authenticate with a user id and password: {0}
de: Die Authentifizierung über Zertifikate ist mit der folgenden Nachricht fehlgeschlagen. Wenn Sie Zertifikate für die Authentifizierung verwenden wollen, müssen Sie den Fehler korrigieren und es erneut versuchen. Wenn Sie aber mit der Anforderung fortfahren wollen, müssen Sie sich mit einer Benutzer-ID und einem Kennwort authentifizieren: {0}
ja: 証明書を使用した認証が失敗し、次のメッセージが出されました。証明書を使用して認証する場合、エラーを修正して再試行する必要があります。あるいは、要求を続行する場合、ユーザー ID とパスワードを使用して認証する必要があります: {0}
ru: Аутентификация с использованием сертификатов завершилась неудачно со следующим сообщением. Если вы хотите использовать сертификаты для аутентификации, вам нужно устранить ошибку и повторить попытку, либо, чтобы продолжить работу с требованием, нужно пройти аутентификацию с использованием ID пользователя и пароля: {0}
zh_cn: 使用证书进行认证失败，并返回以下消息。如果要使用证书进行认证，那么您需要更正该错误并重试；或者，要继续完成请求，您需要使用用户标识和密码进行认证：{0}

# MSG2
source: <undefined>
de: <nicht-definiert>
ru: <не определен>
