Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5009E
source: The {0} user does not have the correct permissions to the following directory: {1}.
de: Der Benutzer {0} hat nicht die erforderlichen Berechtigungen für das folgende Verzeichnis: {1}.
ja: {0} ユーザーが次のディレクトリーに対する正しい許可を備えていません: {1}。
ru: У пользователя {0} нет необходимых разрешений на доступ к следующему каталогу: {1}.
zh_cn: {0} 用户没有 {1} 目录的正确许可权。

# CDISA5010E
source: The {0} log4j configuration file could not be read for the following domain: {1}. The auditlog service will not be able to perform auditing.
de: Die log4j-Konfigurationsdatei {0} konnte für die folgende Domäne nicht gelesen werden: {1}. Der auditlog-Service wird keine Prüfung ausführen können.
ja: 次のドメインの {0} log4j 構成ファイルを読み取ることができませんでした: {1}。auditlog サービスは監査を実行できません。
ru: Не удалось прочитать файл конфигурации log4j {0} для следующего домена: {1}. Служба auditlog не сможет выполнить аудит.
zh_cn: 无法读取 {1} 域的 log4j 配置文件 {0}。审计日志服务将无法执行审计。

# CDISA5011E
source: An error occurred while the operation was reading the following application ADL file: {0}. The error is: {1}
de: Ein Fehler ist aufgetreten, während die Operation die folgende Anwendungs-ADL-Datei gelesen hat: {0}. Fehler: {1}
ja: 操作で次のアプリケーション ADL ファイルを読み取っているときにエラーが発生しました: {0}。エラー: {1}
ru: Произошла ошибка, когда операция читала следующий файл ADL приложения: {0}. Ошибка: {1}
zh_cn: 操作读取应用程序 ADL 文件 {0} 时发生错误。错误如下：{1}

# CDISA5012E
source: The {0} log directory could not be created on the {1} resource by the following user: {2}.
de: Der folgende Benutzer konnte das Protokollverzeichnis {0} in der Ressource {1} nicht erstellen: {2}.
ja: 次のユーザーによって {1} リソースで {0} ログ・ディレクトリーを作成できませんでした: {2}。
ru: Указанному ниже пользователю не удалось создать каталог журналов {0} на ресурсе {1}: {2}.
zh_cn: {2} 用户无法在 {1} 资源上创建 {0} 日志目录。

# CDISA5013E
source: The {0} domain is not configured for an external resource manager. The domain.externalResourceManager property must be set prior to configuring a tag definition.
de: Die Domäne {0} ist nicht für einen Manager für externe Ressourcen konfiguriert. Die Eigenschaft domain.externalResourceManager muss vor dem Konfigurieren einer Tagdefinition festgelegt werden.
ja: {0} ドメインは外部リソース・マネージャー用に構成されていません。タグ定義を構成する前に、domain.externalResourceManager プロパティーを設定する必要があります。
ru: Домен {0} не сконфигурирован для внешнего менеджера ресурсов. Прежде чем конфигурировать определение тега, должно быть задано свойство domain.externalResourceManager.
zh_cn: 未针对外部资源管理器配置 {0} 域。必须先设置 domain.externalResourceManager 属性，然后再配置标记定义。

# CDISA5014E
source: The definition for the {0} tag is not formatted correctly. Consult the {1} resource manager documentation for the proper syntax. Error is: {2}
de: Die Definition für den Tag {0} ist nicht ordnungsgemäß formatiert. Die ordnungsgemäße Syntax finden Sie in der Dokumentation zum Ressourcenmanager {1}. Fehler: {2}
ja: {0} タグの定義が正しくフォーマット設定されていません。適切な構文について、{1} リソース・マネージャーの資料を参照してください。エラー: {2}
ru: Определение тега {0} сформатировано неправильно. Смотрите правильный синтаксис в документации по менеджеру ресурсов {1}. Ошибка: {2}
zh_cn: {0} 标记定义的格式不正确。请查阅 {1} 资源管理器文档以了解正确的语法。错误如下：{2}

# CDISA5015E
source: The controller service can not be started on the following rsource: {0}. SSH is not allowed for the following domain: {1}.
de: Der Controller-Service kann in der folgenden Ressource nicht gestartet werden: {0}. SSH ist für die folgende Domäne nicht zulässig: {1}.
ja: 次のリソースでコントローラー・サービスを開始できません: {0}。次のドメインで SSH が許可されません: {1}。
ru: Службу контроллера невозможно запустить на следующем ресурсе: {0}. У SSH нет полномочий для следующего домена: {1}.
zh_cn: 无法在 {0} 资源上启动控制器服务。{1} 域不允许使用 SSH。

# CDISA5016E
source: An error occurred while the operation was removing the SSH ID file. The error is: {0}.
de: Ein Fehler ist aufgetreten, während die Operation die SSH-ID-Datei entfernt hat. Fehler: {0}.
ja: 操作によって SSH ID ファイルが削除されているときに、エラーが発生しました。エラー: {0}。
ru: Произошла ошибка, когда операция удаляла файл ID SSH. Ошибка: {0}.
zh_cn: 操作移除 SSH 标识文件时发生错误。错误为：{0}。

# CDISA5017E
source: The following parameter is required: {0}.
de: Der folgende Parameter ist erforderlich: {0}.
ja: 次のパラメーターは必須です: {0}。
ru: Требуется следующий параметр: {0}.
zh_cn: 以下参数是必需项：{0}。

# CDISA5018E
source: The requested URL was not found on the server.
de: Die angeforderte URL wurde nicht auf dem Server gefunden.
ja: 要求された URL がサーバー上で見つかりませんでした。
ru: Требуемый URL не найден на сервере.
zh_cn: 在服务器上找不到请求的 URL。

# CDISA5019E
source: The requested URL is missing the request identifier.
de: In der angeforderten URL fehlt die Anforderungskennung.
ja: 要求された URL で要求 ID が欠落しています。
ru: В затребованном URL отсутствует идентификатор требования.
zh_cn: 请求的 URL 缺少请求标识。

# CDISA5020E
source: The content type attribute was not specified on the HTTP request.
de: Das Inhaltstypattribut wurde in der HTTP-Anforderung nicht angegeben.
ja: HTTP 要求でコンテンツ・タイプ属性が指定されませんでした。
ru: Атрибут типа содержимого не задан в требовании HTTP.
zh_cn: HTTP 请求中未指定内容类型属性。

# CDISA5021E
source: The following content type is not supported by the HTTP request: {0}.
de: Der folgende Inhaltstyp wird von der HTTP-Anforderung nicht unterstützt: {0}.
ja: 次のコンテンツ・タイプは HTTP 要求でサポートされません: {0}。
ru: Указанный ниже тип содержимого не поддерживается требованием HTTP: {0}.
zh_cn: HTTP 请求不支持以下内容类型：{0}。

# CDISA5022E
source: The following content type is not correct for the HTTP request: {0}. Expected {1}.
de: Der folgende Inhaltstyp ist für die HTTP-Anforderung nicht korrekt: {0}. Erwartet: {1}.
ja: 次のコンテンツ・タイプは HTTP 要求では正しくありません: {0}。予期される値: {1}。
ru: Указанный ниже тип содержимого является неправильным для требования HTTP: {0}. Ожидалось {1}.
zh_cn: 内容类型 {0} 对于 HTTP 请求而言不正确。期望的内容类型为 {1}。

# CDISA5023E
source: The following build user could not be created on the build resource: {0}.
de: Der folgende Buildbenutzer konnte in der Buildressource nicht erstellt werden: {0}.
ja: ビルド・リソースで次のビルド・ユーザーを作成できません: {0}。
ru: Не удалось создать указанного ниже пользователя сборки на ресурсе сборки: {0}.
zh_cn: 无法在构建资源上创建构建用户 {0}。

# CDISA5024E
source: Connection to the JMX service is not currently active.
de: Die Verbindung zum JMX-Service ist zurzeit nicht aktiv.
ja: JMX サービスへの接続は現在アクティブでありません。
ru: Соединение со службой JMX сейчас неактивно.
zh_cn: 与 JMX 服务的连接当前未处于活动状态。

# CDISA5025E
source: An error occurred during the generation of the keys for the secure shell environment.
de: Beim Generieren der Schlüssel für die Secure Shell-Umgebung ist ein Fehler aufgetreten.
ja: セキュア・シェル環境のための鍵の生成中に、エラーが発生しました。
ru: Произошла ошибка при генерировании ключей для среды оболочки защиты.
zh_cn: 为安全 Shell 环境生成密钥期间发生错误。

# CDISA5026E
source: An error occurred when permissions on the secure shell environment directory were set.
de: Beim Festlegen von Berechtigungen für das Secure Shell-Umgebungsverzeichnis ist ein Fehler aufgetreten.
ja: セキュア・シェル環境ディレクトリーでの許可の設定時にエラーが発生しました。
ru: Произошла ошибка, когда назначались разрешения для каталога среды оболочки защиты.
zh_cn: 设置对安全 Shell 环境目录的许可权时发生错误。

# CDISA5027E
source: An error occurred during the creation of the authorized keys file for the secure shell environment.
de: Beim Erstellen der Datei mit berechtigten Schlüsseln für die Secure Shell-Umgebung ist ein Fehler aufgetreten.
ja: セキュア・シェル環境のための許可済み鍵ファイルの作成中に、エラーが発生しました。
ru: Произошла ошибка при создании файла авторизованных ключей для среды оболочки защиты.
zh_cn: 为安全 Shell 环境创建授权密钥文件期间发生错误。

# CDISA5028E
source: An error occurred during the generation of the public and private authentication keys.
de: Beim Generieren der öffentlichen und privaten Authentifizierungsschlüssel ist ein Fehler aufgetreten.
ja: 認証用の公開鍵と秘密鍵の生成中に、エラーが発生しました。
ru: Произошла ошибка при генерировании открытых и секретных ключей аутентификации.
zh_cn: 生成公用和专用认证密钥期间发生错误。

# CDISA5029E
source: The user''s permissions do not permit this action. The required permission is: {0}:{1}.
de: Die Berechtigungen des Benutzers lassen diese Aktion nicht zu. Erforderliche Berechtigung: {0}:{1}.
ja: ユーザーの許可ではこのアクションは許可されません。必要な許可: {0}:{1}。
ru: Разрешения пользователя не допускают этого действия. Необходимое разрешение: {0}:{1}.
zh_cn: 用户的许可权不允许执行此操作。所需许可权为：{0}:{1}。

# CDISA5030E
source: The {0} log path is already in use by the {1} domain in the following zookeeper ensemble: {2}. Modify the domainLog.path for the current domain or create a new domain with a unique domain id.
de: Der Protokollpfad {0} wird bereits von der Domäne {1} im folgenden ZooKeeper-Ensemble verwendet: {2}. Modifizieren Sie domainLog.path für die aktuelle Domäne oder erstellen Sie eine neue Domäne mit einer eindeutigen Domänen-ID.
ja: {0} ログ・パスは次の zookeeper アンサンブル内の {1} ドメインによって既に使用中です: {2}。現在のドメインの domainLog.path を変更するか、固有のドメイン ID を持つ新規ドメインを作成してください。
ru: Путь журнала {0} уже используется доменом {1} в следующем комплекте zookeeper: {2}. Измените domainLog.path для текущего домена или создайте новый домен с уникальным ID домена.
zh_cn: {0} 日志路径已由 ZooKeeper 整体 {2} 中的 {1} 域在使用。请修改当前域的 domainLog.path，或创建具有唯一域标识的新域。

# CDISA5031E
source: The {0} resource is not an active build resource. The resource is not active or is missing the build tag.
de: Die Ressource {0} ist keine aktive Buildressource. Die Ressource ist nicht aktiv oder der Build-Tag fehlt.
ja: {0} リソースはアクティブなビルド・リソースではありません。このリソースはアクティブでないか、ビルド・タグが欠落しています。
ru: Ресурс {0} не является активным ресурсом сборки. Ресурс не активен, или у него отсутствует тег сборки.
zh_cn: {0} 资源不是活动的构建资源。该资源未处于活动状态或缺少构建标记。

# CDISA5032E
source: The build.runAsUser property is set for the following build resource: {0}. The build.storagePath property must specify a valid directory to store build data.
de: Die Eigenschaft build.runAsUser ist für die folgende Buildressource festgelegt: {0}. Die Eigenschaft build.storagePath muss ein gültiges Verzeichnis zum Speichern von Builddaten angeben.
ja: 次のビルド・リソースの build.runAsUser プロパティーが設定されています: {0}。build.storagePath プロパティーでビルド・データを保管するための有効なディレクトリーを指定する必要があります。
ru: Свойство build.runAsUser задано для следующего ресурса сборки: {0}. Свойство build.storagePath должно задавать действительный каталог для хранения данных сборки.
zh_cn: 已针对 {0} 构建资源设置 build.runAsUser 属性。build.storagePath 属性必须指定一个用于存储构建数据的有效目录。

# CDISA5033E
source: The network interface for the following mask could not be found: {0}.
de: Die Netzschnittstelle für die folgende Maske wurde nicht gefunden: {0}.
ja: 次のマスクのネットワーク・インターフェースが見つかりませんでした: {0}。
ru: Не удалось найти сетевой интерфейс для следующей маски: {0}.
zh_cn: 找不到 {0} 掩码的网络接口。

# CDISA5034E
source: The {0} user does not own the requested authentication token.
de: Der Benutzer {0} ist nicht der Eigner des angeforderten Authentifizierungstokens.
ja: {0} ユーザーは要求された認証トークンを所有していません。
ru: Пользователь {0} не является владельцем затребованного маркера аутентификации.
zh_cn: {0} 用户未拥有所请求的认证令牌。

# CDISA5035E
source: The specified configuration is not in valid JSON format.
de: Die angegebene Konfiguration hat kein gültiges JSON-Format.
ja: 指定された構成は有効な JSON フォーマットでありません。
ru: Указанная конфигурация не представлена в допустимом формате JSON.
zh_cn: 指定的配置未采用有效的 JSON 格式。

# CDISA5036E
source: If the configuration is for fileSystem backend store, Dir must be specified; if the configuration is for redis backend store, shards, replicas and replicaGroups must be specified.
de: Ist die Konfiguration für den fileSystem-Back-End-Speicher, muss 'Dir' angegeben werden; ist die Konfiguration für den redis-Back-End-Speicher, müssen 'shards', 'replicas' und 'replicaGroups' angegeben werden.
ja: 構成が fileSystem バックエンド・ストア用のものである場合、Dir を指定する必要があります。構成が redis バックエンド・ストア用のものである場合、shards、replicas、および replicaGroups を指定する必要があります。
ru: Если конфигурация предназначена для внутреннего склада файловой системы, необходимо задать каталог; если конфигурация предназначена для внутреннего склада redis, нужно задать фрагменты (shard), реплики и группы реплик.
zh_cn: 如果配置是用于 fileSystem 后端存储，那么必须指定 Dir；如果配置是用于 redis 后端存储，那么必须指定 shards、replicas 和 replicaGroups。

# CDISA5037E
source: The following value for the {0} property is invalid: {1}
de: Der folgende Wert für die Eigenschaft {0} ist ungültig: {1}
ja: {0} プロパティーの次の値は無効です: {1}
ru: Следующее значение для свойства {0} недопустимо: {1}
zh_cn: {0} 属性的值 {1} 无效

# CDISA5038E
source: The value for the {0} property is invalid.
de: Der Wert für die Eigenschaft {0} ist ungültig.
ja: {0} プロパティーの値が無効です。
ru: Значение для свойства {0} недопустимо.
zh_cn: {0} 属性的值无效。

# CDISA5039E
source: No value was specified for the {0} property.
de: Für die Eigenschaft {0} wurde kein Wert angegeben.
ja: {0} プロパティーの値が指定されていません。
ru: Не задано никакого значения для свойства {0}.
zh_cn: 没有对 {0} 属性指定值。

# CDISA5040E
source: The following security object does not exist: {0}.
de: Das folgende Sicherheitsobjekt ist nicht vorhanden: {0}.
ja: 次のセキュリティー・オブジェクトは存在しません: {0}。
ru: Следующий объект защиты не существует: {0}.
zh_cn: 安全对象 {0} 不存在。

# CDISA5041E
source: The controller service is already running on the {0} resource for the following domain: {1}.
de: Der Controller-Service wird bereits in der Ressource {0} für die folgende Domäne ausgeführt: {1}.
ja: コントローラー・サービスは次のドメインの {0} リソースで既に実行されています: {1}。
ru: Служба контроллера уже работает на ресурсе {0} для следующего домена: {1}.
zh_cn: 控制器服务已在 {1} 域的 {0} 资源上运行。

# CDISA5042E
source: The {0} service is temporarily unavailable; it is initializing on the following resource: {1}. The service has the following process id: {2}.
de: Der Service {0} ist vorübergehend nicht verfügbar; er wird in der folgenden Ressource initialisiert: {1}. Der Service hat die folgende Prozess-ID: {2}.
ja: {0} サービスは一時的に使用不可です。このサービスは次のリソースで初期化中です: {1}。サービスのプロセス ID は {2} です。
ru: Служба {0} временно недоступна; она инициализируется на следующем ресурсе: {1}. ID процесса службы: {2}.
zh_cn: {0} 服务暂时不可用；它正在以下资源上初始化：{1}。该服务具有进程标识 {2}。

# CDISA5043E
source: The {0} resource running on the {1} host has failed for the following resource manager: {2}.
de: Die Ressource {0}, die auf dem Host {1} ausgeführt wird, ist für den folgenden Ressourcenmanager fehlgeschlagen: {2}.
ja: {1} ホスト上で実行されている {0} リソースが次のリソース・マネージャーによって失敗しました: {2}。
ru: Ресурс {0}, работающий на хосте {1}, завершился неудачно для следующего менеджера ресурсов: {2}.
zh_cn: 在 {1} 主机上运行的 {0} 资源对以下资源管理器失效：{2}。

# CDISA5049E
source: An error occurred creating the following domain: {0}.
de: Beim Erstellen der folgenden Domäne ist ein Fehler aufgetreten: {0}.
ja: 次のドメインの作成中にエラーが発生しました: {0}。
ru: Произошла ошибка при создании следующего домена: {0}.
zh_cn: 创建 {0} 域时发生错误。

# CDISA5050E
source: The following domain already exists: {0}.
de: Die folgende Domäne ist bereits vorhanden: {0}.
ja: 次のドメインは既に存在します: {0}。
ru: Следующий домен уже существует: {0}.
zh_cn: {0} 域已存在。

# CDISA5051E
source: The following domain is active; it can not be removed: {0}.
de: Die folgende Domäne ist aktiv und kann nicht entfernt werden: {0}.
ja: 次のドメインはアクティブであるため、削除できません: {0}。
ru: Следующий домен активен; его нельзя удалить: {0}.
zh_cn: {0} 域处于活动状态；无法将其移除。

# CDISA5052E
source: An error occurred removing the following domain: {0}.
de: Beim Entfernen der folgenden Domäne ist ein Fehler aufgetreten: {0}.
ja: 次のドメインの削除中にエラーが発生しました: {0}。
ru: Произошла ошибка при удалении следующего домена: {0}.
zh_cn: 移除 {0} 域时发生错误。

# CDISA5053E
source: The following domain failed to start: {0}.
de: Die folgende Domäne konnte nicht gestartet werden: {0}.
ja: 次のドメインの開始に失敗しました: {0}。
ru: Не удалось запустить следующий домен: {0}.
zh_cn: 无法启动 {0} 域。

# CDISA5054E
source: The following domain failed to stop: {0}.
de: Die folgende Domäne konnte nicht gestoppt werden: {0}.
ja: 次のドメインの停止に失敗しました: {0}。
ru: Не удалось остановить следующий домен: {0}.
zh_cn: 无法停止 {0} 域。

# CDISA5055E
source: The following domain is already started: {0}.
de: Die folgende Domäne ist bereits gestartet: {0}.
ja: 次のドメインは既に開始されています: {0}。
ru: Следующий домен уже запущен: {0}.
zh_cn: {0} 域已启动。

# CDISA5056E
source: The following domain is not currently started: {0}.
de: Die folgende Domäne ist zurzeit nicht gestartet: {0}.
ja: 次のドメインは現在開始されていません: {0}。
ru: Следующий домен сейчас не запущен: {0}.
zh_cn: 当前未启动 {0} 域。

# CDISA5057E
source: The {0} user is not authorized to start the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Starten der folgenden Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインを開始する権限がありません: {1}。
ru: Пользователю {0} не разрешено запускать следующий домен: {1}.
zh_cn: {0} 用户无权启动 {1} 域。

# CDISA5058E
source: The {0} user is not authorized to stop the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Stoppen der folgenden Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインを停止する権限がありません: {1}。
ru: Пользователю {0} не разрешено останавливать следующий домен: {1}.
zh_cn: {0} 用户无权停止 {1} 域。

# CDISA5059E
source: The {0} user is not authorized to remove the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Entfernen der folgenden Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインを削除する権限がありません: {1}。
ru: Пользователю {0} не разрешено удалять следующий домен: {1}.
zh_cn: {0} 用户无权移除 {1} 域。

# CDISA5060E
source: The following domain has at least one active instance: {0}. Stop all instances prior to stopping the domain or use the force option. The following instance is still active: {1}.
de: Die folgende Domäne hat mindestens eine aktive Instanz: {0}. Stoppen Sie alle Instanzen, bevor Sie die Domäne stoppen, oder verwenden Sie die Option --force. Die folgende Instanz ist noch aktiv: {1}.
ja: 次のドメインには少なくとも 1 つのアクティブ・インスタンスがあります: {0}。ドメインを停止する前にすべてのインスタンスを停止するか、force オプションを使用してください。次のインスタンスがまだアクティブです: {1}。
ru: У следующего домена есть по крайней мере один активный экземпляр: {0}. Остановите все экземпляры перед остановкой домена или используйте опцию force. Следующий экземпляр все еще активен: {1}.
zh_cn: {0} 域至少有一个活动实例。请先停止所有实例然后再停止该域，或者使用 force 选项。{1} 实例仍处于活动状态。

# CDISA5061E
source: The following domain does not exist: {0}.
de: Die folgende Domäne ist nicht vorhanden: {0}.
ja: 次のドメインは存在しません: {0}。
ru: Следующий домен не существует: {0}.
zh_cn: {0} 域不存在。

# CDISA5062E
source: An error occurred creating the {0} instance in following domain: {1}.
de: Beim Erstellen der Instanz {0} in der folgenden Domäne ist ein Fehler aufgetreten: {1}.
ja: 次のドメインでの {0} インスタンスの作成中にエラーが発生しました: {1}。
ru: Произошла ошибка при создании экземпляра {0} в следующем домене: {1}.
zh_cn: 在 {1} 域中创建 {0} 实例时发生错误。

# CDISA5063E
source: The {0} instance already exists for the following domain: {1}.
de: Die Instanz {0} ist bereits für die folgende Domäne vorhanden: {1}.
ja: 次のドメインの {0} インスタンスは既に存在します: {1}。
ru: Экземпляр {0} уже существует для следующего домена: {1}.
zh_cn: {1} 域的 {0} 实例已存在。

# CDISA5064E
source: The {0} instance is active for the following domain: {1}. It can not be removed.
de: Die Instanz {0} ist für die folgende Domäne aktiv: {1}. Sie kann nicht entfernt werden.
ja: 次のドメインの {0} インスタンスはアクティブです: {1}。削除できません。
ru: Экземпляр {0} активен для следующего домена: {1}. Его нельзя удалить.
zh_cn: {1} 域的 {0} 实例处于活动状态。无法移除该实例。

# CDISA5065E
source: An error occurred removing the {0} instance from the following domain: {1}.
de: Beim Entfernen der Instanz {0} aus der folgenden Domäne ist ein Fehler aufgetreten: {1}.
ja: 次のドメインからの {0} インスタンスの削除中にエラーが発生しました: {1}。
ru: Произошла ошибка при удалении экземпляра {0} из следующего домена: {1}.
zh_cn: 从 {1} 域中移除 {0} 实例时发生错误。

# CDISA5066E
source: The {0} instance failed to start for the following domain: {1}.
de: Die Instanz {0} konnte für die folgende Domäne nicht gestartet werden: {1}.
ja: 次のドメインの {0} インスタンスの開始に失敗しました: {1}。
ru: Не удалось запустить экземпляр {0} для следующего домена: {1}.
zh_cn: 无法针对 {1} 域启动 {0} 实例。

# CDISA5067E
source: The {0} instance failed to stop for the following domain: {1}.
de: Die Instanz {0} konnte für die folgende Domäne nicht gestoppt werden: {1}.
ja: 次のドメインの {0} インスタンスの停止に失敗しました: {1}。
ru: Не удалось остановить экземпляр {0} для следующего домена: {1}.
zh_cn: 无法针对 {1} 域停止 {0} 实例。

# CDISA5068E
source: The {0} user is not authorized to start the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Starten der Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスを開始する権限がありません: {2}。
ru: Пользователю {0} не разрешено запускать экземпляр {1} для следующего домена: {2}.
zh_cn: {0} 用户无权启动 {2} 域的 {1} 实例。

# CDISA5069E
source: The {0} user is not authorized to stop the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Stoppen der Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスを停止する権限がありません: {2}。
ru: Пользователю {0} не разрешено останавливать экземпляр {1} для следующего домена: {2}.
zh_cn: {0} 用户无权停止 {2} 域的 {1} 实例。

# CDISA5070E
source: The {0} user is not authorized to remove the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Entfernen der Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスを削除する権限がありません: {2}。
ru: Пользователю {0} не разрешено удалять экземпляр {1} для следующего домена: {2}.
zh_cn: {0} 用户无权移除 {2} 域的 {1} 实例。

# CDISA5071E
source: The {0} instance does not exist for the following domain: {1}.
de: Die Instanz {0} ist für die folgende Domäne nicht vorhanden: {1}.
ja: 次のドメインの {0} インスタンスは存在しません: {1}。
ru: Экземпляр {0} не существует для следующего домена: {1}.
zh_cn: {1} 域的 {0} 实例不存在。

# CDISA5072E
source: The {0} instance is not started for the following domain: {1}.
de: Die Instanz {0} wurde für die folgende Domäne nicht gestartet: {1}.
ja: 次のドメインの {0} インスタンスは開始されていません: {1}。
ru: Экземпляр {0} не запущен для следующего домена: {1}.
zh_cn: 未针对 {1} 域启动 {0} 实例。

# CDISA5073E
source: The {0} instance is already started for the following domain: {1}.
de: Die Instanz {0} wurde bereits für die folgende Domäne gestartet: {1}.
ja: 次のドメインの {0} インスタンスは既に開始されています: {1}。
ru: Экземпляр {0} уже запущен для следующего домена: {1}.
zh_cn: 已针对 {1} 域启动 {0} 实例。

# CDISA5074E
source: The {0} service failed to start on the following resource: {1}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。
ru: Не удалось запустить службу {0} на ресурсе {1}.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。

# CDISA5075E
source: {0} of {1} {2} services failed to start on the following resource: {3}.
de: {0} von {1} {2}-Services konnten in der folgenden Ressource nicht gestartet werden: {3}.
ja: {1} 個の {2} サービスのうち {0} 個が次のリソースで開始に失敗しました: {3}。
ru: Службы {2} в количестве {0} из {1} не удалось запустить на следующем ресурсе: {3}.
zh_cn: 无法在 {3} 资源上启动 {0} 个（共 {1} 个）{2} 服务。

# CDISA5076E
source: The {0} service timed out while starting on the following resource: {1}.
de: Der Service {0} hat beim Starten in der folgenden Ressource das zulässige Zeitlimit überschritten: {1}.
ja: {0} サービスが次のリソース上で開始中にタイムアウトになりました: {1}。
ru: Тайм-аут службы {0} во время запуска на ресурсе {1}.
zh_cn: 在 {1} 资源上启动 {0} 服务时发生超时。

# CDISA5077E
source: {0} of {1} {2} services timed out while starting on the following resource: {3}.
de: {0} von {1} {2}-Services haben beim Starten in der folgenden Ressource das zulässige Zeitlimit überschritten: {3}.
ja: {1} 個の {2} サービスのうち {0} 個が次のリソースで開始中にタイムアウトになりました: {3}。
ru: Произошел тайм-аут служб {2} в количестве {0} из {1} при их запуске на следующем ресурсе: {3}.
zh_cn: 在 {3} 资源上启动时，{0} 个（共 {1} 个）{2} 服务超时。

# CDISA5078E
source: The {0} service failed to start on the following resource: {1}. The following user does not exist: {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht gestartet werden: {1}. Der folgende Benutzer ist nicht vorhanden: {2}.
ja: 次のリソース上で {0} サービスの開始に失敗しました: {1}。次のユーザーは存在しません: {2}。
ru: Не удалось запустить службу {0} на ресурсе {1}. Следующий пользователь не существует: {2}.
zh_cn: 无法在 {1} 资源上启动 {0} 服务。{2} 用户不存在。
