Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsRuntimeMessages_*.xlf
Languages: ko, pt_br

# CDISR0001E
source: An unexpected error occurred in the name service.
ko: 이름 서비스에 예기치 않은 오류가 발생했습니다.
pt_br: Ocorreu um erro inesperado no serviço de nomes.

# CDISR0002E
source: The {0} record cannot be registered because that name already exists in the name service.
ko: 이름이 이미 이름 서비스에 있으므로 {0} 레코드를 등록할 수 없습니다.
pt_br: O registro {0} não pode ser feito porque o nome já existe no serviço de nomes.

# CDISR0003E
source: The following record name cannot be found in the name service: {0}.
ko: 이름 서비스에 레코드 이름 {0}이(가) 없습니다.
pt_br: O nome do registro a seguir não pode ser localizado no serviço de nomes: {0}.

# CDISR0004E
source: The name service cannot retrieve data for record name {0}. The error is: {1}.
ko: 이름 서비스가 레코드 이름 {0}에 대한 데이터를 검색할 수 없습니다. 오류는 {1}입니다.
pt_br: O serviço de nomes não pode recuperar dados para o nome do registro {0}. O erro é: {1}.

# CDISR0006E
source: The name service cannot be started because required information about the domain ID is missing.
ko: 도메인 ID에 대한 필수 정보가 누락되었으므로 이름 서비스를 시작할 수 없습니다.
pt_br: O serviço de nomes não pode ser iniciado porque informações necessárias sobre o ID do domínio estão ausentes.

# CDISR0007E
source: The name service cannot be started because required information about the name server is missing.
ko: 이름 서버에 대한 필수 정보가 누락되었으므로 이름 서비스를 시작할 수 없습니다.
pt_br: O serviço de nomes não pode ser iniciado porque informações necessárias sobre o servidor de nome estão ausentes.

# CDISR0008E
source: The name service cannot be started because required information about the instance ID is missing.
ko: 인스턴스 ID에 대한 필수 정보가 누락되었으므로 이름 서비스를 시작할 수 없습니다.
pt_br: O serviço de nomes não pode ser iniciado porque informações necessárias sobre o ID da instância estão ausentes.

# CDISR0009E
source: An internal error occurred because the STREAMS_NS environment variable is required, but was not configured.
ko: STREAMS_NS 환경 변수가 필수이지만 구성되지 않았으므로 내부 오류가 발생했습니다.
pt_br: Ocorreu um erro interno porque a variável de ambiente STREAMS_NS é necessária, mas não foi configurada.

# CDISR0010E
source: The name service encountered an internal error. The following name service configuration is not valid: {0}.
ko: 이름 서비스에 내부 오류가 발생했습니다. 이름 서비스 구성 {0}이(가) 유효하지 않습니다.
pt_br: O serviço de nomes encontrou um erro interno. A configuração de serviço de nomes a seguir não é válida: {0}.

# CDISR0011E
source: The format of the contents of the following name record is not valid: {0}.
ko: 이름 레코드 {0}의 컨텐츠 형식이 유효하지 않습니다.
pt_br: O formato do conteúdo do registro de nome a seguir não é válido: {0}.

# CDISR0012E
source: The name service cannot create or access the following storage directory: {0}. The error is: {1}.
ko: 이름 서비스가 {0} 스토리지 디렉토리를 작성하거나 액세스할 수 없습니다. 오류는 {1}입니다.
pt_br: O serviço de nomes não pode criar ou acessar o diretório de armazenamento a seguir: {0}. O erro é: {1}.

# CDISR0013E
source: The following object cannot be successfully registered to the name service: {0}. The error is: {1}.
ko: {0} 오브젝트를 이름 서비스에 등록할 수 없습니다. 오류는 {1}입니다.
pt_br: O objeto a seguir não pode ser registrado com sucesso para o serviço de nomes: {0}. O erro é: {1}.

# CDISR0014E
source: The following object cannot be successfully unregistered to the name service: {0}. The error is: {1}.
ko: {0} 오브젝트를 이름 서비스에서 등록 취소할 수 없습니다. 오류는 {1}입니다.
pt_br: O objeto a seguir não pode ter o registrado cancelado com sucesso para o serviço de nomes: {0}. O erro é: {1}.

# CDISR0015E
source: The following directory cannot be successfully removed: {0}. The error is: {1}.
ko: {0} 디렉토리를 제거할 수 없습니다. 오류는 {1}입니다.
pt_br: O diretório a seguir não pode ser removido com sucesso: {0}. O erro é: {1}.

# CDISR0016E
source: The name service cannot successfully finish the operation since {0} is not a directory.
ko: {0}이(가) 디렉토리가 아니므로 이름 서비스가 조작을 완료할 수 없습니다.
pt_br: O serviço de nomes não pode concluir a operação com sucesso, já que {0} não é um diretório.

# CDISR0017E
source: The name service cannot successfully register the user object with invalid applicationScope or label settings.
ko: 이름 서비스가 applicationScope 또는 레이블 설정이 유효하지 않은 사용자 오브젝트를 등록할 수 없습니다.
pt_br: O serviço de nomes não pode registrar o objeto de usuário com sucesso com configurações de rótulo ou applicationScope inválidas.

# CDISR0500E
source: Processing element ID {0} did not start because the ID is not valid.
ko: 처리 요소 ID {0}이(가) 유효하지 않으므로 이 ID가 시작되지 않았습니다.
pt_br: O ID de elemento de processamento {0} não foi iniciado porque o ID não é válido.

# CDISR0501E
source: The runtime services encountered an internal error. The error is: {0}.
ko: 런타임 서비스에 내부 오류가 발생했습니다. 오류는 {0}입니다.
pt_br: Os serviços de tempo de execução encontraram um erro interno. O erro é: {0}.

# CDISR0502E
source: IBM Streams encountered an error when connecting to the ZooKeeper service: {0}. The error is: {1}. This error might be caused by network problems.
ko: ZooKeeper 서비스 {0}에 연결하는 중에 IBM Streams에 오류가 발생했습니다. 오류는 {1}입니다. 이 오류는 네트워크 문제점으로 인해 발생할 수 있습니다.
pt_br: O IBM Streams encontrou um erro ao se conectar ao serviço ZooKeeper: {0}. O erro é: {1}. Esse erro pode ser causado por problemas de rede.

# CDISR0506E
source: IBM Streams encountered a remote procedure call error when connecting to the following service: {0}. The error is: {1}. This error might be caused by network problems.
ko: {0} 서비스에 연결하는 중에 IBM Streams에 원격 프로시저 호출(RPC) 오류가 발생했습니다. 오류는 {1}입니다. 이 오류는 네트워크 문제점으로 인해 발생할 수 있습니다.
pt_br: O IBM Streams encontrou um erro de chamada de procedimento remoto ao se conectar ao serviço a seguir: {0}. O erro é: {1}. Esse erro pode ser causado por problemas de rede.

# CDISR0700I
source: The {0} property for the service was set to the following value: {1}. The service is {2}.
ko: 서비스의 {0} 특성을 {1} 값으로 설정했습니다. 서비스는 {2}입니다.
pt_br: A propriedade {0} para o serviço foi configurada para o valor a seguir: {1}. O serviço é {2}.

# CDISR1001E
source: The Streams Application Manager cannot restart the processing element ID {0}. In the application source code for Job ID {1}, the operators that the processing element executes are configured so that they cannot be restarted.
ko: Streams Application Manager가 처리 요소 ID {0}을(를) 재시작할 수 없습니다. 작업 ID {1}의 애플리케이션 소스 코드에서 처리 요소가 실행하는 연산자를 재시작할 수 없도록 구성했습니다.
pt_br: O Streams Application Manager não pode reiniciar o ID do elemento de processamento {0}. No código-fonte do aplicativo para o ID da tarefa {1}, os operadores que o elemento de processamento executa são configurados para que não possam ser reiniciados.

# CDISR1014E
source: The {0} property name was not found.
ko: {0} 특성 이름이 없습니다.
pt_br: O nome da propriedade {0} não foi localizado.

# CDISR1027E
source: The processing element ID {0} was not found.
ko: 처리 요소 ID {0}이(가) 없습니다.
pt_br: O ID de elemento de processamento {0} não foi localizado.

# CDISR1030E
source: An unexpected exception occurred in the Streams Application Manager.
ko: Streams Application Manager에서 예기치 않은 예외가 발생했습니다.
pt_br: Ocorreu uma exceção inesperada no Streams Application Manager.

# CDISR1038E
source: An internal error occurred in the Streams Application Manager.
ko: Streams Application Manager에서 내부 오류가 발생했습니다.
pt_br: Ocorreu um erro interno no Streams Application Manager.

# CDISR1039E
source: The Streams Application Manager is not available.
ko: Streams Application Manager가 사용 불가능합니다.
pt_br: O Streams Application Manager não está disponível.

# CDISR1042E
source: The following output port ID is not valid: {0}.
ko: 출력 포트 ID {0}이(가) 유효하지 않습니다.
pt_br: O ID da porta de saída a seguir não é válido: {0}.

# CDISR1043E
source: The processing element ID {0} must be stopped before it can be restarted.
ko: 처리 요소 ID {0}을(를) 재시작하려면 먼저 중지해야 합니다.
pt_br: O ID de elemento de processamento {0} deve ser parado antes de ser reiniciado.

# CDISR1044E
source: The following job ID was not found: {0}.
ko: 작업 ID {0}이(가) 없습니다.
pt_br: O ID da tarefa a seguir não foi localizado: {0}.

# CDISR1049E
source: The {0} property already exists.
ko: {0} 특성이 이미 있습니다.
pt_br: A propriedade {0} já existe.

# CDISR1101E
source: The Streams Application Manager cannot find the tupleType with the {0} index.
ko: Streams Application Manager는 인덱스가 {0}인 tupleType을 찾을 수 없습니다.
pt_br: O Streams Application Manager não pode localizar tupleType com o índice {0}.

# CDISR1102E
source: The Streams Application Manager cannot find the hostpool with the {0} index.
ko: Streams Application Manager는 인덱스가 {0}인 호스트 풀을 찾을 수 없습니다.
pt_br: O Streams Application Manager não pode localizar o conjunto de hosts com o índice {0}.

# CDISR1103E
source: The Streams Application Manager cannot find the library with the {0} index.
ko: Streams Application Manager는 인덱스가 {0}인 라이브러리를 찾을 수 없습니다.
pt_br: O Streams Application Manager não pode localizar a biblioteca com o índice {0}.

# CDISR1105E
source: The operation cannot be completed because the job ID {0} is in the terminating state.
ko: 작업 ID {0}이(가) 종료 중 상태이므로 조작을 완료할 수 없습니다.
pt_br: A operação não pode ser concluída porque o ID da tarefa {0} está no estado finalizado.

# CDISR1110E
source: The Streams Application Manager cannot route the current notification to the controller service because an older notification request is still pending.
ko: 이전 알림 요청이 보류 중이므로 Streams Application Manager가 현재 알림을 제어기 서비스로 경로지정할 수 없습니다.
pt_br: O Streams Application Manager não pode rotear a notificação atual para o serviço do controlador porque uma solicitação de notificação antiga ainda está pendente.

# CDISR1111E
source: The Streams Application Manager cannot send the routing notification because newer notifications were already sent.
ko: 최신 알림을 이미 보냈으므로 Streams Application Manager가 경로지정 알림을 보낼 수 없습니다.
pt_br: O Streams Application Manager não pode enviar uma notificação de roteamento porque notificações mais novas já foram enviadas.

# CDISR1130E
source: The {0} input port was not declared a name-based or property-based import port.
ko: {0} 입력 포트를 이름 기반 또는 특성 기반 임포트 포트로 선언하지 않았습니다.
pt_br: A porta de entrada {0} não foi declarada uma porta de importação baseada em nome ou baseada em propriedade.

# CDISR1134E
source: The operation cannot be completed because job ID {0} is in the terminated state.
ko: 작업 ID {0}이(가) 종료됨 상태이므로 조작을 완료할 수 없습니다.
pt_br: A operação não pode ser concluída porque o ID da tarefa {0} está no estado finalizado.

# CDISR1135E
source: The processing elements of job ID {0} cannot be stopped at this time.
ko: 현재 작업 ID {0}의 처리 요소를 중지할 수 없습니다.
pt_br: Os elementos de processamento do ID da tarefa {0} não podem ser interrompidos neste momento.

# CDISR1137E
source: The Streams Application Manager cannot complete the operation because the processing element ID {0} is stopping or was already stopped.
ko: 처리 요소 ID {0}을(를) 중지하는 중이거나 이미 중지했으므로 Streams Application Manager가 조작을 완료할 수 없습니다.
pt_br: O Streams Application Manager não pode concluir a operação porque o ID do elemento de processamento {0} está parando ou já está parado.

# CDISR1142E
source: The processing element ID {0} cannot be restarted. The automatic retry count of {1} was exceeded.
ko: 처리 요소 ID {0}을(를) 재시작할 수 없습니다. 자동 재시도 횟수 {1}을(를) 초과했습니다.
pt_br: O ID do elemento de processamento {0} não pode ser reiniciado. A contagem de novas tentativas automática de {1} foi excedida.

# CDISR1143E
source: The submission parameters in the following list are either ambiguous, missing, or not valid: {0}.
ko: {0} 목록의 제출 매개변수가 앰비규어스하거나 누락되었거나 유효하지 않습니다.
pt_br: Os parâmetros de envio na lista a seguir são ambíguos, ausentes ou não válidos: {0}.

# CDISR1144E
source: The job submission parameters are not correct.
ko: 작업 제출 매개변수가 올바르지 않습니다.
pt_br: Os parâmetros de envio de tarefa não estão corretos.

# CDISR1145E
source: The validation of the job submission parameter failed.
ko: 작업 제출 매개변수의 유효성 검증에 실패했습니다.
pt_br: A validação do parâmetro de envio de tarefa falhou.

# CDISR1146E
source: The following job submission parameter is required, but it is missing: {0}.
ko: 작업 제출 매개변수 {0}이(가) 필수이지만 누락되었습니다.
pt_br: O parâmetro de envio de tarefa a seguir é obrigatório, mas está ausente: {0}.

# CDISR1147E
source: The following job submission parameter was specified multiple times: {0}. A parameter can be specified only once.
ko: 작업 제출 매개변수 {0}을(를) 여러 번 지정했습니다. 매개변수는 한 번만 지정할 수 있습니다.
pt_br: O parâmetro de envio de tarefa a seguir foi especificado várias vezes: {0}. Um parâmetro pode ser especificado somente uma vez.

# CDISR1148E
source: The following job submission parameter is ambiguous: {0}. This job submission parameter matches {1}.
ko: 작업 제출 매개변수 {0}이(가) 앰비규어스합니다. 이 작업 제출 매개변수가 {1}과(와) 일치합니다.
pt_br: O parâmetro de envio de tarefa a seguir é ambíguo: {0}. Esse parâmetro de envio de tarefa corresponde a {1}.

# CDISR1149W
source: The following job submission parameter is not known to the application: {0}. The application ignored this parameter.
ko: 작업 제출 매개변수 {0}이(가) 애플리케이션에 알려지지 않았습니다. 애플리케이션이 이 매개변수를 무시했습니다.
pt_br: O parâmetro de envio de tarefa a seguir não é conhecido para o aplicativo: {0}. O aplicativo ignorou esse parâmetro.

# CDISR1150E
source: An error occurred when the subscription of the input port was updated from {0} to {1}.
ko: 입력 포트의 서브스크립션을 {0}에서 {1}(으)로 갱신했을 때 오류가 발생했습니다.
pt_br: Ocorreu um erro quando a assinatura da porta de entrada foi atualizada de {0} para {1}.

# CDISR1151E
source: The name-based import subscription cannot be updated for the following import port: {0}.
ko: 임포트 포트 {0}에 대한 이름 기반 임포트 서브스크립션을 갱신할 수 없습니다.
pt_br: A assinatura de importação baseada em nome não pode ser atualizada para a porta de importação a seguir: {0}.

# CDISR1154E
source: The Streams Application Manager client failed to collect the job logs. The error is: {0}.
ko: Streams Application Manager 클라이언트가 작업 로그 수집에 실패했습니다. 오류는 {0}입니다.
pt_br: O cliente Streams Application Manager falhou ao coletar os logs da tarefa. O erro é: {0}.

# CDISR1155I
source: The Streams Application Manager is starting a submitjob event with application {0}.
ko: Streams Application Manager가 애플리케이션 {0}에서 submitJob 이벤트를 시작하는 중입니다.
pt_br: O Streams Application Manager está iniciando um evento de envio de tarefa com o aplicativo {0}.

# CDISR1156I
source: The Streams Application Manager finished the submitjob event for the following job: {0}.
ko: Streams Application Manager가 {0} 작업의 submitjob 이벤트를 완료했습니다.
pt_br: O Streams Application Manager concluiu o evento de envio de tarefa para a tarefa a seguir: {0}.

# CDISR1157E
source: The following stream view ID is not valid: {0}.
ko: 스트림 보기 ID {0}이(가) 유효하지 않습니다.
pt_br: O ID de visualização do fluxo a seguir não é válido: {0}.

# CDISR1158E
source: The job cannot be submitted because the DISPLAY environment variable is not defined.
ko: DISPLAY 환경 변수를 정의하지 않았으므로 작업을 제출할 수 없습니다.
pt_br: A tarefa não pode ser enviada porque a variável de ambiente DISPLAY não está definida.

# CDISR1159E
source: The Streams Application Manager failed to register job ID {0} with the Authentication and Authorization Service. The error is: {1}.
ko: Streams Application Manager가 작업 ID {0}을(를) 인증 및 권한 부여 서비스에 등록하는 데 실패했습니다. 오류는 {1}입니다.
pt_br: O Streams Application Manager falhou ao registrar o ID de tarefa {0} com o Serviço de Autenticação e Autorização. O erro é: {1}.

# CDISR1160E
source: The Streams Application Manager failed to restart a collection of Processing Elements. For more information, see the messages that follow this one. The Processing Elements are: {0}.
ko: Streams Application Manager가 처리 요소 수집을 재시작하는 데 실패했습니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오. 처리 요소는 {0}입니다.
pt_br: O Streams Application Manager falhou ao reiniciar uma coleção de Elementos de Processamento. Para obter mais informações, consulte as mensagens posteriores a esta. Os Elementos de Processamento são: {0}.

# CDISR1161E
source: The Streams Application Manager failed to restart one or more Processing Elements. For more information, see the messages that follow this one.
ko: Streams Application Manager가 하나 이상의 처리 요소를 재시작하는 데 실패했습니다. 자세한 정보는 뒤에 오는 메시지를 참조하십시오.
pt_br: O Streams Application Manager falhou ao reiniciar um ou mais Elementos de Processamento. Para obter mais informações, consulte as mensagens posteriores a esta.

# CDISR1162E
source: The Streams Application Manager cannot open the view of the following stream: {0}.
ko: Streams Application Manager가 {0} 스트림 보기를 열 수 없습니다.
pt_br: O Streams Application Manager não pode abrir a visualização do fluxo a seguir: {0}.

# CDISR1164E
source: {0} is not a valid value for the width of a parallel region.
ko: {0}은(는) 병렬 영역 너비의 유효한 값이 아닙니다.
pt_br: {0} não é um valor válido para a largura de uma região paralela.

# CDISR1165E
source: The operation cannot complete because the following job configuration parameter was specified multiple times: {0}. A parameter can be specified only once.
ko: 작업 구성 매개변수 {0}을(를) 여러 번 지정했으므로 조작을 완료할 수 없습니다. 매개변수는 한 번만 지정할 수 있습니다.
pt_br: A operação não pode ser concluída porque o parâmetro de configuração da tarefa a seguir foi especificado várias vezes: {0}. Um parâmetro pode ser especificado somente uma vez.

# CDISR1166E
source: The operation cannot complete because the following job configuration parameter was specified: {0}. This parameter is not recognized.
ko: 작업 구성 매개변수 {0}을(를) 지정했으므로 조작을 완료할 수 없습니다. 이 매개변수를 인식할 수 없습니다.
pt_br: A operação não pode ser concluída porque o parâmetro de configuração da tarefa a seguir foi especificado: {0}. Esse parâmetro não é reconhecido.

# CDISR1167E
source: The operation cannot complete because the following job name is not valid: {0}. Job names must be unique in the instance.
ko: 작업 이름 {0}이(가) 유효하지 않으므로 조작을 완료할 수 없습니다. 작업 이름이 인스턴스에서 고유해야 합니다.
pt_br: A operação não pode ser concluída porque o nome da tarefa a seguir não é válido: {0}. Nomes de tarefa devem ser exclusivos na instância.

# CDISR1168E
source: The operation cannot complete because checkpoint support is required for the submitted application. Set the instance.checkpointRepository and instance.checkpointRepositoryConfiguration properties for the following instance: {0} and make sure they are valid.
ko: 제출된 애플리케이션에 대한 체크포인트 지원이 필수이므로 조작을 완료할 수 없습니다. {0} 인스턴스에 대한 instance.checkpointRepository 및 instance.checkpointRepositoryConfiguration 특성을 설정한 후 해당 특성이 유효한지 확인하십시오.
pt_br: A operação não pode ser concluída porque o suporte a ponto de verificação é necessário para o aplicativo enviado. Configure as propriedades instance.checkpointRepository e instance.checkpointRepositoryConfiguration para a instância a seguir: {0} e certifique-se de que elas sejam válidas.

# CDISR1170E
source: The {0} user ID is not authorized to perform the following operation: {1}. The user must have the following permissions for the {3} object in the {4} instance: {2}.
ko: {0} 사용자 ID에게 {1} 조작 수행 권한이 부여되지 않았습니다. 사용자에게 {4} 인스턴스의 {3} 오브젝트에 대한 {2} 권한이 있어야 합니다.
pt_br: O ID do usuário {0} não está autorizado a executar a operação a seguir: {1}. O usuário deve ter as permissões a seguir para o objeto {3} na instância {4}: {2}.

# CDISR1171E
source: The transfer of the application bundle file to the hosts that run the job did not complete in the time allowed. The domain ID is: {0}.
ko: 작업을 실행하는 호스트로의 애플리케이션 번들 파일 전송이 허용된 시간 내에 완료되지 않았습니다. 도메인 ID는 {0}입니다.
pt_br: A transferência do arquivo de pacote configurável do aplicativo para os hosts que executam a tarefa não foi concluída no tempo permitido. O ID do domínio é: {0}.

# CDISR1172E
source: The operation cannot complete because capabilities support is required for the submitted application. Set the instance.canSetPeOSCapabilities and instance.runAsUser properties for the following instance: {0}.
ko: 제출된 애플리케이션에 기능 지원이 필수이므로 조작을 완료할 수 없습니다. {0} 인스턴스의 instance.canSetPeOSCapabilities 및 instance.runAsUser 특성을 설정하십시오.
pt_br: A operação não pode ser concluída porque o suporte aos recursos é necessário para o aplicativo enviado. Configure as propriedades instance.canSetPeOSCapabilities e instance.runAsUser para a instância a seguir: {0}.

# CDISR1174E
source: The application did not start because of the following error: {0}.
ko: {0} 오류로 인해 애플리케이션이 시작되지 않았습니다.
pt_br: O aplicativo não foi iniciado devido ao erro a seguir: {0}.

# CDISR1175E
source: The application did not start because the {0} job configuration parameter was set to the following invalid value: {1}.
ko: {0} 작업 구성 매개변수를 유효하지 않은 값 {1}(으)로 설정했으므로 애플리케이션이 시작되지 않았습니다.
pt_br: O aplicativo não foi iniciado porque o parâmetro de configuração de tarefa {0} foi configurado para o valor inválido a seguir: {1}.

# CDISR1176E
source: The application did not start because the {0} and {1} job configuration parameters are both specified. This combination of parameters is not valid for the instance.
ko: {0} 및 {1} 작업 구성 매개변수를 둘 다 지정했으므로 애플리케이션이 시작되지 않았습니다. 인스턴스에 대한 이 매개변수 조합이 유효하지 않습니다.
pt_br: O aplicativo não foi iniciado porque os parâmetros de configuração de tarefa {0} e {1} estão configurados. Essa combinação de parâmetros não é válida para a instância.

# CDISR1177E
source: The Streams Application Manager cannot complete the request on port {0}.
ko: Streams Application Manager가 {0} 포트에서 요청을 완료할 수 없습니다.
pt_br: O Streams Application Manager não pode concluir a solicitação na porta {0}.

# CDISR1179E
source: The operation cannot complete because the {0} hostpool with index {1} is not set up correctly.
ko: 인덱스가 {1}인 {0} 호스트 풀을 올바르게 설정하지 않아 조작을 완료할 수 없습니다.
pt_br: A operação não pode ser concluída porque o conjunto de hosts {0} com o índice {1} não está configurado corretamente.

# CDISR1180E
source: The operator {0} with index {1} has invalid resource set up, such as empty resource setting.
ko: 인덱스가 {1}인 연산자 {0}에 유효하지 않은 자원(예: 빈 자원 설정)이 설정되어 있습니다.
pt_br: O operador {0} com índice {1} tem uma configuração de recurso inválida, como configuração de recurso vazia.

# CDISR1181E
source: The Streams Application Manager could not finish the update operators event for job {0} since the job is running with {1} release.
ko: 해당 작업이 {1} 릴리스에서 실행 중이기 때문에 Streams Application Manager에서 {0} 작업에 대한 연산자 갱신 이벤트를 완료할 수 없습니다.
pt_br: O Streams Application Manager não pôde concluir o evento de operadores de atualização para a tarefa {0} porque a tarefa está em execução com a liberação {1}.

# CDISR1182E
source: The Streams Application Manager could not submit the application as the application was compiled with transport option of llm_rum_tcp or llm_rum_ib, but the instance was configured to enable encryption for transport.
ko: 애플리케이션이 전송 옵션 llm_rum_tcp 또는 llm_rum_ib를 사용하여 컴파일되었지만 전송을 위해 암호화를 사용하도록 인스턴스가 구성되었기 때문에 Streams Application Manager 에서 해당 애플리케이션을 제출할 수 없습니다.
pt_br: O Streams Application Manager não pôde enviar o aplicativo porque ele foi compilado com a opção de transporte de llm_rum_tcp ou llm_rum_ib, mas a instância foi configurada para ativar a criptografia para transporte.

# CDISR1251W
source: The operators in the submitted application were fused by using the default legacy fusion scheme because the application was not compiled on Version 4.2, or later.
ko: 버전 4.2 이상에서 애플리케이션을 컴파일하지 않았으므로 기본 Legacy 결합 스킴을 사용하여 제출된 애플리케이션의 연산자를 결합했습니다.
pt_br: Os operadores no aplicativo enviado foram fundidos usando o esquema de fusão anterior padrão porque o aplicativo não foi compilado na versão 4.2 ou posterior.

# CDISR1252W
source: The operators in the submitted application were fused by using the specified legacy fusion scheme, but some job submission settings were ignored.
ko: 지정된 Legacy 결합 스킴을 사용하여 제출된 애플리케이션의 연산자를 결합했지만 일부 작업 제출 설정이 무시되었습니다.
pt_br: Os operadores no aplicativo enviado foram fundidos usando o esquema de fusão anterior especificado, mas algumas configurações de envio de tarefa foram ignoradas.

# CDISR1300I
source: The Streams Application Manager was started.
ko: Streams Application Manager를 시작했습니다.
pt_br: O Streams Application Manager foi iniciado.

# CDISR1301I
source: The Streams Application Manager was shut down.
ko: Streams Application Manager가 종료되었습니다.
pt_br: O Streams Application Manager foi encerrado.
