Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5549E
source: Build repository item {0} does not exist.
de: Build-Repository-Element {0} ist nicht vorhanden.
ja: ビルド・リポジトリー項目 {0} が存在しません。
ru: Элемент репозитория сборки {0} не существует.
zh_cn: 构建存储库项 {0} 不存在。

# CDISA5550E
source: Application repository item {0} does not exist.
de: Anwendungsrepository-Element {0} ist nicht vorhanden.
ja: アプリケーション・リポジトリー項目 {0} が存在しません。
ru: Элемент репозитория приложения {0} не существует.
zh_cn: 应用程序存储库项 {0} 不存在。

# CDISA5551E
source: The {0} user is not authorized to store an application for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Speichern eine Anwendung für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのアプリケーションを保管する権限がありません: {1}。
ru: Пользователь {0} не авторизован для сохранения приложения для следующего домена: {1}.
zh_cn: {0} 用户无权存储 {1} 域的应用程序。

# CDISA5552E
source: The {0} user is not authorized to access the {1} application for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Zugriff auf die Anwendung {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} アプリケーションにアクセスする権限がありません: {2}。
ru: Пользователь {0} не авторизован на доступ к приложению {1} для следующего домена: {2}.
zh_cn: {0} 用户无权访问 {2} 域的 {1} 应用程序。

# CDISA5553E
source: The {0} user is not authorized to list applications for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Auflisten von Anwendungen für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのアプリケーションをリストする権限がありません: {1}。
ru: Пользователь {0} не авторизован для вызова списка приложений для следующего домена: {1}.
zh_cn: {0} 用户无权列示 {1} 域的应用程序。

# CDISA5554E
source: The {0} user is not authorized to remove the {1} application from the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Entfernen der Anwendung {1} aus der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインから {1} アプリケーションを削除する権限がありません: {2}。
ru: Пользователь {0} не авторизован на удаление приложения {1} из следующего домена: {2}.
zh_cn: {0} 用户无权从 {2} 域中移除 {1} 应用程序。

# CDISA5555E
source: The {0} user is not authorized to modify the following build resource: {1}.
de: Der Benutzer {0} ist nicht zum Ändern der folgenden Buildressource berechtigt: {1}.
ja: {0} ユーザーには、次のビルド・リソースを変更する権限がありません: {1}。
ru: Пользователь {0} не авторизован на изменение следующего ресурса сборки: {1}.
zh_cn: {0} 用户无权修改以下构建资源：{1}。

# CDISA5556I
source: Begin migration of application repository data.
de: Die Migration von Anwendungsrepository-Daten hat begonnen.
ja: アプリケーション・リポジトリー・データのマイグレーションを開始します。
ru: Начните перенастройку данных репозитория приложения.
zh_cn: 开始迁移应用程序存储库数据。

# CDISA5557I
source: Begin migration of build repository data.
de: Die Migration von Build-Repository-Daten hat begonnen.
ja: ビルド・リポジトリー・データのマイグレーションを開始します。
ru: Начните перенастройку данных репозитория сборки.
zh_cn: 开始迁移构建存储库数据。

# CDISA5558I
source: Begin migration of build archive repository data.
de: Die Migration von Buildarchiv-Repository-Daten hat begonnen.
ja: ビルド・アーカイブ・リポジトリー・データのマイグレーションを開始します。
ru: Начните перенастройку данных репозитория архива сборки.
zh_cn: 开始迁移构建归档存储库数据。

# CDISA5559I
source: Begin migration of application cache repository data.
de: Die Migration von Anwendungscache-Repository-Daten hat begonnen.
ja: アプリケーション・キャッシュ・リポジトリー・データのマイグレーションを開始します。
ru: Начните перенастройку данных репозитория кэша приложения.
zh_cn: 开始迁移应用程序高速缓存存储库数据。

# CDISA5560I
source: Application repository item {0} has been migrated.
de: Anwendungsrepository-Element {0} wurde migriert.
ja: アプリケーション・リポジトリー項目 {0} がマイグレーションされました。
ru: Элемент репозитория приложения {0} перенастроен.
zh_cn: 已迁移应用程序存储库项 {0}。

# CDISA5561I
source: Build repository item {0} has been migrated.
de: Build-Repository-Element {0} wurde migriert.
ja: ビルド・リポジトリー項目 {0} がマイグレーションされました。
ru: Элемент репозитория сборки {0} перенастроен.
zh_cn: 已迁移构建存储库项 {0}。

# CDISA5562I
source: Build archive repository item {0} has been migrated.
de: Buildarchiv-Repository-Element {0} wurde migriert.
ja: ビルド・アーカイブ・リポジトリー項目 {0} がマイグレーションされました。
ru: Элемент репозитория архива сборки {0} перенастроен.
zh_cn: 已迁移构建归档存储库项 {0}。

# CDISA5563I
source: Application cache repository item {0} has been migrated.
de: Anwendungscache-Repository-Element {0} wurde migriert.
ja: アプリケーション・キャッシュ・リポジトリー項目 {0} がマイグレーションされました。
ru: Элемент репозитория кэша приложения {0} перенастроен.
zh_cn: 已迁移应用程序高速缓存存储库项 {0}。

# CDISA5564E
source: Application repository item {0} failed to migrate. Cause: {1}
de: Anwendungsrepository-Element {0} konnte nicht migriert werden. Ursache: {1}
ja: アプリケーション・リポジトリー項目 {0} のマイグレーションに失敗しました。原因: {1}
ru: Не удалось перенастроить элемент репозитория приложения {0}. Причина: {1}
zh_cn: 迁移应用程序存储库项 {0} 失败。原因：{1}

# CDISA5565E
source: Build repository item {0} failed to migrate. Cause: {1}
de: Build-Repository-Element {0} konnte nicht migriert werden. Ursache: {1}
ja: ビルド・リポジトリー項目 {0} のマイグレーションに失敗しました。原因: {1}
ru: Не удалось перенастроить элемент репозитория сборки {0}. Причина: {1}
zh_cn: 构建存储库项 {0} 迁移失败。原因：{1}

# CDISA5566E
source: Build archive repository item {0} failed to migrate. Cause: {1}
de: Buildarchiv-Repository-Element {0} konnte nicht migriert werden. Ursache: {1}
ja: ビルド・アーカイブ・リポジトリー項目 {0} のマイグレーションに失敗しました。原因: {1}
ru: Не удалось перенастроить элемент репозитория архива сборки {0}. Причина: {1}
zh_cn: 构建归档存储库项 {0} 迁移失败。原因：{1}

# CDISA5567E
source: Application cache repository item {0} failed to migrate. Cause: {1}
de: Anwendungscache-Repository-Element {0} konnte nicht migriert werden. Ursache: {1}
ja: アプリケーション・キャッシュ・リポジトリー項目 {0} のマイグレーションに失敗しました。原因: {1}
ru: Не удалось перенастроить элемент репозитория кэша приложения {0}. Причина: {1}
zh_cn: 应用程序高速缓存存储库项 {0} 迁移失败。原因：{1}

# CDISA5568I
source: Migration of application repository data has been completed. {0} items migrated successfully. {1} items failed to migrate.
de: Die Migration von Anwendungsrepository-Daten wurde abgeschlossen. {0} Elemente wurden erfolgreich migriert. {1} Elemente konnten nicht migriert werden.
ja: アプリケーション・リポジトリー・データのマイグレーションが完了しました。{0} 個の項目が正常にマイグレーションされました。{1} 個の項目のマイグレーションに失敗しました。
ru: Перенастройка данных репозитория приложения завершена. Элементы в количестве {0} успешно перенастроены. Элементы в количестве {1} не удалось перенастроить.
zh_cn: 已完成应用程序存储库数据的迁移。已成功迁移 {0} 项。{1} 项迁移失败。

# CDISA5569I
source: Migration of build repository data has been completed. {0} items migrated successfully. {1} items failed to migrate.
de: Die Migration von Build-Repository-Daten wurde abgeschlossen. {0} Elemente wurden erfolgreich migriert. {1} Elemente konnten nicht migriert werden.
ja: ビルド・リポジトリー・データのマイグレーションが完了しました。{0} 個の項目が正常にマイグレーションされました。{1} 個の項目のマイグレーションに失敗しました。
ru: Перенастройка данных репозитория сборки завершена. Элементы в количестве {0} успешно перенастроены. Элементы в количестве {1} не удалось перенастроить.
zh_cn: 已完成构建存储库数据的迁移。已成功迁移 {0} 项。{1} 项迁移失败。

# CDISA5570I
source: Migration of build archive repository data has been completed. {0} items migrated successfully. {1} items failed to migrate.
de: Die Migration von Buildarchiv-Repository-Daten wurde abgeschlossen. {0} Elemente wurden erfolgreich migriert. {1} Elemente konnten nicht migriert werden.
ja: ビルド・アーカイブ・リポジトリー・データのマイグレーションが完了しました。{0} 個の項目が正常にマイグレーションされました。{1} 個の項目のマイグレーションに失敗しました。
ru: Перенастройка данных репозитория архива сборки завершена. Элементы в количестве {0} успешно перенастроены. Элементы в количестве {1} не удалось перенастроить.
zh_cn: 已完成构建归档存储库数据的迁移。已成功迁移 {0} 项。{1} 项迁移失败。

# CDISA5571I
source: Migration of application cache repository data has been completed for instance {2}. {0} items migrated successfully. {1} items failed to migrate.
de: Die Migration von Anwendungscache-Repository-Daten wurde für Instanz {2} abgeschlossen. {0} Elemente wurden erfolgreich migriert. {1} Elemente konnten nicht migriert werden.
ja: インスタンス {2} のアプリケーション・キャッシュ・リポジトリー・データのマイグレーションが完了しました。{0} 個の項目が正常にマイグレーションされました。{1} 個の項目のマイグレーションに失敗しました。
ru: Перенастройка данных репозитория кэша приложения завершена для экземпляра {2}. Элементы в количестве {0} успешно перенастроены. Элементы в количестве {1} не удалось перенастроить.
zh_cn: 已完成实例 {2} 的应用程序高速缓存存储库数据的迁移。已成功迁移 {0} 项。{1} 项迁移失败。

# CDISA5572I
source: Application repository configuration was set to the following value "{0}". The previous value was "{1}".
de: Die Anwendungsrepository-Konfiguration wurde auf den folgenden Wert gesetzt: "{0}". Vorheriger Wert: "{1}".
ja: アプリケーション・リポジトリー構成が値「{0}」に設定されました。以前の値は「{1}」でした。
ru: Для конфигурации репозитория приложения задано следующее значение: "{0}". Предыдущее значение - "{1}".
zh_cn: 应用程序存储库配置已设置为以下值：“{0}”。先前的值为“{1}”。

# CDISA5573I
source: Build repository configuration was set to the following value "{0}". The previous value was "{1}".
de: Die Build-Repository-Konfiguration wurde auf den folgenden Wert gesetzt: "{0}". Vorheriger Wert: "{1}".
ja: ビルド・リポジトリー構成が値「{0}」に設定されました。以前の値は「{1}」でした。
ru: Для конфигурации репозитория сборки задано следующее значение: "{0}". Предыдущее значение - "{1}".
zh_cn: 构建存储库配置已设置为以下值：“{0}”。先前的值为“{1}”。

# CDISA5574I
source: Application cache repository configuration for instance {2} was set to the following value "{0}". The previous value was "{1}".
de: Die Anwendungscache-Repository-Konfiguration für Instanz {2} wurde auf den folgenden Wert gesetzt: "{0}". Vorheriger Wert: "{1}".
ja: インスタンス {2} のアプリケーション・キャッシュ・リポジトリー構成が値「{0}」に設定されました。以前の値は「{1}」でした。
ru: Для конфигурации репозитория кэша приложения для экземпляра {2} задано следующее значение: "{0}". Предыдущее значение - "{1}".
zh_cn: 实例 {2} 的应用程序高速缓存存储库配置已设置为以下值：“{0}”。先前的值为“{1}”。

# CDISA5575I
source: Default repository configuration was set to the following value "{0}". The previous value was "{1}".
de: Die Standardrepository-Konfiguration wurde auf den folgenden Wert gesetzt: "{0}". Vorheriger Wert: "{1}".
ja: デフォルト・リポジトリー構成が値「{0}」に設定されました。以前の値は「{1}」でした。
ru: Для конфигурации репозитория по умолчанию задано следующее значение: "{0}". Предыдущее значение - "{1}".
zh_cn: 缺省存储库配置已设置为以下值：“{0}”。先前的值为“{1}”。

# CDISA5576E
source: Application repository configuration cannot be removed, repository is not empty. Use the force option to clear the repository and remove the configuration.
de: Die Anwendungsrepository-Konfiguration kann nicht entfernt werden, das Repository ist nicht leer. Verwenden Sie die Option 'force', um den Inhalt des Repositorys zu löschen und die Konfiguration zu entfernen.
ja: アプリケーション・リポジトリー構成を削除できません。リポジトリーが空ではありません。force オプションを使用してリポジトリーをクリアし、構成を削除してください。
ru: Невозможно удалить конфигурацию репозитория приложения, репозиторий - не пустой. Используйте опцию force, чтобы очистить хранилище и удалить конфигурацию.
zh_cn: 无法移除应用程序存储库配置，存储库不为空。使用强制选项来清除存储库并移除配置。

# CDISA5577E
source: Build repository configuration cannot be removed, build repository is not empty. Use the force option to clear the repository and remove the configuration.
de: Die Build-Repository-Konfiguration kann nicht entfernt werden, das Build-Repository ist nicht leer. Verwenden Sie die Option 'force', um den Inhalt des Repositorys zu löschen und die Konfiguration zu entfernen.
ja: ビルド・リポジトリー構成を削除できません。ビルド・リポジトリーが空ではありません。force オプションを使用してリポジトリーをクリアし、構成を削除してください。
ru: Невозможно удалить конфигурацию репозитория сборки, репозиторий сборки - не пустой. Используйте опцию force, чтобы очистить хранилище и удалить конфигурацию.
zh_cn: 无法移除构建存储库配置，构建存储库不为空。使用强制选项来清除存储库并移除配置。

# CDISA5578E
source: Build repository configuration cannot be removed, build archive repository is not empty. Use the force option to clear the repository and remove the configuration.
de: Die Build-Repository-Konfiguration kann nicht entfernt werden, das Buildarchiv-Repository ist nicht leer. Verwenden Sie die Option 'force', um den Inhalt des Repositorys zu löschen und die Konfiguration zu entfernen.
ja: ビルド・リポジトリー構成を削除できません。ビルド・アーカイブ・リポジトリーが空ではありません。force オプションを使用してリポジトリーをクリアし、構成を削除してください。
ru: Невозможно удалить конфигурацию репозитория сборки, репозиторий архива сборки - не пустой. Используйте опцию force, чтобы очистить хранилище и удалить конфигурацию.
zh_cn: 无法移除构建存储库配置，构建归档存储库不为空。使用强制选项来清除存储库并移除配置。

# CDISA5579E
source: Application cache repository configuration cannot be removed, application cache repository is not empty in instance {0}. Use the force option to clear the repository and remove the configuration.
de: Die Anwendungscache-Repository-Konfiguration kann nicht entfernt werden, das Anwendungscache-Repository in Instanz {0} ist nicht leer. Verwenden Sie die Option ''force'', um den Inhalt des Repositorys zu löschen und die Konfiguration zu entfernen.
ja: アプリケーション・キャッシュ・リポジトリー構成を削除できません。インスタンス {0} のアプリケーション・キャッシュ・リポジトリーが空ではありません。force オプションを使用してリポジトリーをクリアし、構成を削除してください。
ru: Невозможно удалить конфигурацию репозитория кэша приложения, репозиторий кэша приложения - не пустой в экземпляре {0}. Используйте опцию force, чтобы очистить хранилище и удалить конфигурацию.
zh_cn: 无法移除应用程序高速缓存存储库配置，应用程序高速缓存存储库在实例 {0} 中不为空。使用强制选项来清除存储库并移除配置。

# CDISA5580E
source: Dead lock detected in domain JMX process. Restarting JMX on resource {0}.
de: Im JMX-Domänenprozess wurde ein Deadlock gefunden. JMX wird für Ressource {0} erneut gestartet.
ja: ドメイン JMX プロセスでデッドロックが検出されました。リソース {0} で JMX を再始動しています。
ru: В процессе JMX домена обнаружена тупиковая блокировка. Производится перезапуск JMX на ресурсе {0}.
zh_cn: 在域 JMX 进程中检测到死锁。正在资源 {0} 上重新启动 JMX。

# CDISA8000W
source: The embedded ZooKeeper could not be started. You will not be able to manage or create domains in the embedded ZooKeeper; but you can create and manage domains in an external ZooKeeper. The cause of this warning message is: {0}
de: Der integrierte ZooKeeper-Service konnte nicht gestartet werden. Sie können Domänen im integrierten ZooKeeper-Service weder verwalten noch erstellen, aber Sie können Domänen in einem externen ZooKeeper-Service erstellen und verwalten. Ursache dieser Warnung: {0}
ja: 組み込み ZooKeeper を開始できませんでした。組み込み ZooKeeper ではドメインを管理および作成できません。ただし、外部 ZooKeeper でドメインを作成および管理することはできます。警告メッセージの原因: {0}
ru: Не удалось запустить встроенный ZooKeeper. Вы не сможете ни управлять доменами, ни создавать домены во встроенном компоненте ZooKeeper, но сможете создавать домены и управлять ими во внешнем компоненте ZooKeeper. Причина этого сообщения с предупреждением: {0}
zh_cn: 无法启动嵌入式 ZooKeeper。您将无法在嵌入式 ZooKeeper 中管理或创建域，但是，可以在外部 ZooKeeper 中创建和管理域。出现此警告消息的原因如下：{0}

# CDISA9000E
source: The Streams Studio application cannot be installed.
de: Die Streams Studio-Anwendung kann nicht installiert werden.
ja: Streams Studio アプリケーションをインストールできません。
ru: Не удалется установить приложение Streams Studio.
zh_cn: 无法安装 Streams Studio 应用程序。

# CDISA9001E
source: The Streams Studio application cannot be openned.
de: Die Streams Studio-Anwendung kann nicht geöffnet werden.
ja: Streams Studio アプリケーションを開くことができません。
ru: Не удалется открыть приложение Streams Studio.
zh_cn: 无法打开 Streams Studio 应用程序。

# CDISA9002E
source: The {0} domain could not be created because the embedded ZooKeeper is not active.
de: Die Domäne {0} konnte nicht erstellt werden, da der integrierte ZooKeeper-Service nicht aktiv ist.
ja: 組み込み ZooKeeper がアクティブでないため、{0} ドメインを作成できませんでした。
ru: Не удалось создать домен {0}, так как встроенный компонент ZooKeeper не активен.
zh_cn: 无法创建 {0} 域，这是因为嵌入式 ZooKeeper 未处于活动状态。

# CDISA9003E
source: The {0} ZooKeeper connection string could not removed from settings because it was set in your environment either by the STREAMS_ZKCONNECT or through streamtool console mode.
de: Die ZooKeeper-Verbindungszeichenfolge {0} konnte nicht aus den Einstellungen entfernt werden, da sie in Ihrer Umgebung entweder über STREAMS_ZKCONNECT oder über den streamtool-Konsolenmodus festgelegt wurde.
ja: {0} ZooKeeper 接続ストリングは、ご使用の環境において STREAMS_ZKCONNECT または streamtool コンソール・モードのいずれかで設定されたものであるため、削除できませんでした。
ru: Строка соединения ZooKeeper {0} не удалена из параметров, так как она была задана в вашей среде либо с помощью STREAMS_ZKCONNECT, либо с использованием режима консоли streamtool.
zh_cn: 无法从设置中移除 ZooKeeper 连接字符串 {0}，因为此字符串是由 STREAMS_ZKCONNECT 或通过 streamtool 控制台方式在环境中设置的。

# CDISA9004E
source: The {0} embedded ZooKeeper connection string was not added to Domain Manager settings. It is already unconditionally included in the list of the domains.
de: Die Verbindungszeichenfolge {0} des integrierten ZooKeeper-Service wurde den Domänenmanagereinstellungen nicht hinzugefügt. Sie ist bereits ohne Bedingungen in der Liste der Domänen enthalten.
ja: {0} 組み込み ZooKeeper 接続ストリングはドメイン・マネージャー設定に追加されませんでした。既に無条件でドメインのリストに組み込まれています。
ru: Строка соединения встроенного компонента ZooKeeper {0} не добавлена в параметры менеджера домена. Она уже безусловным образом включена в список доменов.
zh_cn: 未将嵌入式 ZooKeeper 连接字符串 {0} 添加到域管理器设置。此字符串已无条件地包括在域列表中。

# CDISA9005E
source: The {0} domain does not exist. The domain might have been removed outside of the Domain Manager application.
de: Die Domäne {0} ist nicht vorhanden. Möglicherweise wurde die Domäne aus der Domänenmanageranwendung entfernt.
ja: {0} ドメインが存在しません。このドメインは、ドメイン・マネージャー・アプリケーションの外部で削除された可能性があります。
ru: Домен {0} не существует. Возможно, домен был удален из приложения менеджера домена.
zh_cn: {0} 域不存在。可能已从“域管理器”应用程序中移除该域。

# CDISA9006E
source: The status of the {0} domain is not valid for the action requested. This can occur if another application is performing a conflicting action on the domain. The current state for the domain is {1}.
de: Der Status der Domäne {0} ist für die angeforderte Aktion nicht gültig. Dies kann auftreten, wenn eine andere Anwendung eine widersprüchliche Aktion für die Domäne ausführt. Aktueller Status der Domäne: {1}.
ja: {0} ドメインの状況は、要求されたアクションに対して無効です。これは、別のアプリケーションがドメインに対して競合するアクションを実行している場合に発生することがあります。ドメインの現在の状態: {1}。
ru: Состояние домена {0} является недопустимым для затребованного действия. Это может произойти, если другое приложение выполняет в домене действие, которое вступает с данным действием в конфликт. Текущее состояние домена - {1}.
zh_cn: {0} 域的状态对于所请求的操作无效。当另一个应用程序正在对该域执行相冲突的操作时，可能会发生这种情况。该域的当前状态为 {1}。

# CDISA9007E
source: An internal error occurred when creating a domain. The following internal parameter is missing or not valid: {0}. Report this error to IBM support.
de: Beim Erstellen einer Domäne ist ein interner Fehler aufgetreten. Der folgende interne Parameter fehlt oder ist nicht gültig: {0}. Melden Sie diesen Fehler dem IBM Support.
ja: ドメインの作成中に内部エラーが発生しました。次の内部パラメーターが欠落しているか無効です: {0}。このエラーについて IBM サポートに報告してください。
ru: Внутренняя ошибка при создании домена. Указанный ниже внутренний параметр отсутствует или является недопустимым: {0}. Сообщите об ошибке службе поддержки IBM.
zh_cn: 创建域时发生内部错误。以下内部参数缺失或无效：{0}。请将此错误报告给 IBM Support。

# CDISA9008E
source: The LDAP group search is required when LDAP group object is specified.
de: Die LDAP-Gruppensuche ist erforderlich, wenn ein LDAP-Gruppenobjekt angegeben ist.
ja: LDAP グループ・オブジェクトが指定されている場合、LDAP グループ検索は必須です。
ru: Если указан объект группы LDAP, требуется поиск группы LDAP.
zh_cn: 指定了 LDAP 组对象时，LDAP 组搜索是必需项。

# CDISA9009E
source: The LDAP group object is required when LDAP group search is specified.
de: Das LDAP-Gruppenobjekt ist erforderlich, wenn die LDAP-Gruppensuche angegeben ist.
ja: LDAP グループ検索が指定されている場合、LDAP グループ・オブジェクトは必須です。
ru: Если указан поиск группы LDAP, требуется объект группы LDAP.
zh_cn: 指定了 LDAP 组搜索时，LDAP 组对象是必需项。

# CDISA9010E
source: The domain no longer exists. The domain might have been removed outside of the Domain Manager application.
de: Die Domäne ist nicht mehr vorhanden. Möglicherweise wurde die Domäne aus der Domänenmanageranwendung entfernt.
ja: このドメインはもう存在しません。このドメインは、ドメイン・マネージャー・アプリケーションの外部で削除された可能性があります。
ru: Домен больше не существует. Возможно, домен был удален из приложения менеджера домена.
zh_cn: 该域不再存在。可能已从“域管理器”应用程序中移除该域。

# CDISA9011E
source: The action failed because the external resource manager for the domain is not available which resulted in the authentication service not starting. The domain owner will need to either remove the value for the external resource manager domain property or change it to a resource manager that is available.
de: Die Aktion ist fehlgeschlagen, da der Manager für externe Ressourcen für die Domäne nicht verfügbar ist. Daher wurde der Authentifizierungsservice nicht gestartet. Der Domäneneigner muss den Wert für die Domäneneigenschaft des Managers für externe Ressourcen entweder entfernen oder in einen verfügbaren Ressourcenmanager ändern.
ja: ドメインの外部リソース・マネージャーが使用可能でないことが原因で認証サービスが開始されないため、アクションが失敗しました。ドメイン所有者が、外部リソース・マネージャーのドメイン・プロパティーの値を削除するか、その値を使用可能なリソース・マネージャーに変更する必要があります。
ru: Действие завершилось неудачно, так как внешний менеджер ресурсов для домена недоступен, из-за чего служба аутентификации не запускается. Владелец домена должен либо удалить значение для свойства домена внешнего менеджера ресурсов, либо изменить его на доступный менеджер ресурсов.
zh_cn: 此操作失败，原因是域的外部资源管理器不可用，这导致无法启动认证服务。域所有者需要移除外部资源管理器域属性的值，或者将其更改为可用的资源管理器。

# CDISA9012E
source: The delete action failed because the external resource manager for the domain is not available which resulted in the authentication service not starting. The domain owner will need to remove the domain with the force option; or remove or change the external resource manager domain property to a value that is available.
de: Die Löschaktion ist fehlgeschlagen, da der Manager für externe Ressourcen für die Domäne nicht verfügbar ist. Daher wurde der Authentifizierungsservice nicht gestartet. Der Domäneneigner muss die Domäne mit der Option 'force' entfernen oder die Domäneneigenschaft des Managers für externe Ressourcen entfernen oder in einen verfügbaren Wert ändern.
ja: ドメインの外部リソース・マネージャーが使用可能でないことが原因で認証サービスが開始されないため、削除アクションが失敗しました。ドメイン所有者が、force オプションを指定してドメインを削除するか、あるいは外部リソース・マネージャーのドメイン・プロパティーを削除するか使用可能な値に変更する必要があります。
ru: Действие удаления завершилось неудачно, так как внешний менеджер ресурсов для домена недоступен, из-за чего служба аутентификации не запускается. Владелец домена должен удалить домен с использованием опции force, либо удалить или изменить свойство домена внешнего менеджера ресурсов на доступное значение.
zh_cn: 此删除操作失败，原因是域的外部资源管理器不可用，这导致无法启动认证服务。域所有者需要使用 force 选项移除域；或者移除外部资源管理器域属性或将其更改为可用的值。

# CDISA9013E
source: The {0} user is not authorized to edit the {2} property for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Bearbeiten der Eigenschaft {2} für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインの {2} プロパティーを編集する権限がありません: {1}。
ru: Пользователю {0} не разрешено изменять свойство {2} для следующего домена: {1}.
zh_cn: {0} 用户无权编辑 {1} 域的 {2} 属性。

# CDISA9014E
source: {0} is not a valid product version.
de: {0} ist keine gültige Produktversion.
ja: {0} は有効な製品バージョンでありません。
ru: {0} - недопустимая версия продукта.
zh_cn: {0} 是无效产品版本。

# CDISA9015E
source: {0} is not a supported version. Version must be 4.2.0.0 or later.
de: {0} ist keine unterstützte Version. Die Version muss 4.2.0.0 oder höher sein.
ja: {0} はサポートされるバージョンでありません。バージョンは 4.2.0.0 以降でなければなりません。
ru: {0} - неподдерживаемая версия. Версия должна быть 4.2.0.0 или новее.
zh_cn: {0} 不是受支持的版本。版本必须为 4.2.0.0 或更高版本。

# CDISA9016E
source: The IBM Streams Upgrade process is not supported when the domain is configured with the external resource manager: {0}
de: Der IBM Streams-Upgradeprozess wird nicht unterstützt, wenn die Domäne mit dem folgenden Manager für externe Ressourcen konfiguriert wird: {0}
ja: 次の外部リソース・マネージャーを使用してドメインが構成された場合、IBM Streams アップグレード・プロセスはサポートされません: {0}
ru: Процесс обновления IBM Streams не поддерживается, если домен сконфигурирован с использованием внешнего менеджера ресурсов: {0}
zh_cn: 使用外部资源管理器 {0} 配置了域时，将不支持 IBM Streams 升级过程
