Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5492E
source: The following build artifact identifier is not valid: {0}.
de: Die folgende Buildartefaktkennung ist nicht gültig: {0}.
ja: 次のビルド成果物 ID は無効です: {0}。
ru: Следующий идентификатор артефакта сборки недопустим: {0}.
zh_cn: 构建工件标识 {0} 无效。

# CDISA5493E
source: The JMX HTTP server request failed. HTTP response code: {0}. HTTP message: {1}.
de: Die JMX-HTTP-Serveranforderung ist fehlgeschlagen. HTTP-Antwortcode: {0}. HTTP-Nachricht: {1}.
ja: JMX HTTP サーバー要求が失敗しました。HTTP 応答コード: {0}。HTTP メッセージ: {1}。
ru: Требование сервера HTTP JMX завершилось неудачно. Код ответа HTTP: {0}. Сообщение HTTP: {1}.
zh_cn: JMX HTTP Server 请求失败。HTTP 响应码：{0}。HTTP 消息：{1}。

# CDISA5494E
source: Can not locate the following build artifact {0}.
de: Das folgende Buildartefakt kann nicht lokalisiert werden: {0}.
ja: 次のビルド成果物を見つけることができません: {0}。
ru: Не удается найти следующий артефакт сборки: {0}.
zh_cn: 找不到构建工件 {0}。

# CDISA5495E
source: The {0} directory can not be created on the following build resource: {1}.
de: Das Verzeichnis {0} kann in der folgenden Buildressource nicht erstellt werden: {1}.
ja: 次のビルド・リソースで {0} ディレクトリーを作成できません: {1}。
ru: Не удается создать каталог {0} на следующем ресурсе сборки: {1}.
zh_cn: 无法在 {1} 构建资源上创建 {0} 目录。

# CDISA5496E
source: The {0} user does not exist on the following build resource: {1}.
de: Der Benutzer {0} ist in der folgenden Buildressource nicht vorhanden: {1}.
ja: {0} ユーザーは次のビルド・リソースで存在しません: {1}。
ru: Пользователь {0} не существует на следующем ресурсе сборки: {1}.
zh_cn: {0} 用户未存在于 {1} 构建资源上。

# CDISA5497E
source: The {0} build timed out for the following domain: {1}.
de: Für den Build {0} wurde für die folgende Domäne das Zeitlimit überschritten: {1}.
ja: 次のドメインの {0} ビルドがタイムアウトになりました: {1}。
ru: Произошел тайм-аут сборки {0} для следующего домена: {1}.
zh_cn: {1} 域的 {0} 构建已超时。

# CDISA5498E
source: The following application repository identifier is not valid: {0}.
de: Die folgende Anwendungsrepository-ID ist nicht gültig: {0}.
ja: 次のアプリケーション・リポジトリー ID は無効です: {0}。
ru: Следующий идентификатор репозитория приложений является недействительным: {0}.
zh_cn: 以下应用程序存储库标识无效：{0}。

# CDISA5499E
source: The {0} user must be a domain administrator in order to view or update restricted configuration properties for the following domain: {1}.
de: Der Benutzer {0} muss ein Domänenadministrator sein, um die Eigenschaften der eingeschränkten Konfiguration für die folgende Domäne anzuzeigen oder zu aktualisieren: {1}.
ja: 次のドメインの制限構成プロパティーを表示または更新するために、{0} ユーザーはドメイン管理者でなければなりません: {1}。
ru: Пользователь {0} должен быть администратором домена, чтобы просматривать или обновлять ограниченные свойства конфигурации для следующего домена: {1}.
zh_cn: {0} 用户必须是域管理员，以便查看或更新以下域的受限制的配置属性：{1}。

# CDISA5500E
source: The {0} user must be an instance or domain administrator in order to view or update restricted configuration properties for the following instance: {1}.
de: Der Benutzer {0} muss ein Instanz- oder Domänenadministrator sein, um die Eigenschaften der eingeschränkten Konfiguration für die folgende Instanz anzuzeigen oder zu aktualisieren: {1}.
ja: 次のインスタンスの制限構成プロパティーを表示または更新するために、{0} ユーザーはインスタンス管理者またはドメイン管理者でなければなりません: {1}。
ru: Пользователь {0} должен быть администратором экземпляра или домена, чтобы просматривать или обновлять ограниченные свойства конфигурации для следующего экземпляра: {1}.
zh_cn: {0} 用户必须是实例管理员或域管理员，以便查看或更新以下实例的受限制的配置属性：{1}。

# CDISA5501E
source: The following domain does not have restricted configuration properties: {0}.
de: Die folgende Domäne hat keine Eigenschaften für eine eingeschränkte Konfiguration: {0}.
ja: 次のドメインに制限構成プロパティーはありません: {0}。
ru: У следующего домена нет ограниченных свойств конфигурации: {0}.
zh_cn: 以下域不存在受限制的配置属性：{0}。

# CDISA5502E
source: The following instance does not have restricted configuration properties: {0}.
de: Die folgende Instanz hat keine Eigenschaften für eine eingeschränkte Konfiguration: {0}.
ja: 次のインスタンスに制限構成プロパティーはありません: {0}。
ru: У следующего экземпляра нет ограниченных свойств конфигурации: {0}.
zh_cn: 以下实例不存在受限制的配置属性：{0}。

# CDISA5503E
source: The {0} restricted configuration property does not exist for the following domain: {1}.
de: Die Eigenschaft {0} der eingeschränkten Konfiguration ist für die folgende Domäne nicht vorhanden: {1}.
ja: 次のドメインの {0} 制限構成プロパティーは存在しません: {1}。
ru: Ограниченное свойство конфигурации {0} не существует для следующего домена: {1}.
zh_cn: 以下域不存在受限制的配置属性 {0}：{1}。

# CDISA5504E
source: The {0} restricted configuration property does not exist for the following instance: {1}.
de: Die Eigenschaft {0} der eingeschränkten Konfiguration ist für die folgende Instanz nicht vorhanden: {1}.
ja: 次のインスタンスの {0} 制限構成プロパティーは存在しません: {1}。
ru: Ограниченное свойство конфигурации {0} не существует для следующего экземпляра: {1}.
zh_cn: 以下实例不存在受限制的配置属性 {0}：{1}。

# CDISA5505E
source: The destination resource can not be the same as the source resource.
de: Die Zielressource darf nicht mit der Quellenressource identisch sein.
ja: 宛先リソースはソース・リソースと同じにはできません。
ru: Ресурс назначения не должен совпадать с исходным ресурсом.
zh_cn: 目标资源不得与源资源相同。

# CDISA5506E
source: The {0} service with process id {1} could not be located on the following resource: {2}.
de: Der Service {0} mit der Prozess-ID {1} konnte in der folgenden Ressource nicht lokalisiert werden: {2}.
ja: 次のリソースで、プロセス ID {1} の {0} サービスが見つかりませんでした: {2}。
ru: Не удалось найти службу {0} с ID процесса {1} на следующем ресурсе: {2}.
zh_cn: 在以下资源中找不到具有进程标识 {1} 的 {0} 服务：{2}。

# CDISA5507E
source: The {0} service can not be moved to the following resource: {1}. The resource must have the following tag: {2}.
de: Der Service {0} kann nicht in die folgende Ressource versetzt werden: {1}. Die Ressource muss den folgenden Tag aufweisen: {2}.
ja: {0} サービスを次のリソースに移動できません: {1}。次のタグがリソースに必要です: {2}。
ru: Службу {0} нельзя переместить на следующий ресурс: {1}. У ресурса должен быть следующий тег: {2}.
zh_cn: 无法将 {0} 服务移至以下资源：{1}。该资源必须具有以下标记：{2}。

# CDISA5508E
source: The {0} service can not be moved to the following resource: {1}. Only one copy of the service can run on a resource.
de: Der Service {0} kann nicht in die folgende Ressource versetzt werden: {1}. In einer Ressource kann nur jeweils eine Kopie des Service ausgeführt werden.
ja: {0} サービスを次のリソースに移動できません: {1}。リソースではサービスの 1 つのコピーだけを実行できます。
ru: Службу {0} нельзя переместить на следующий ресурс: {1}. На ресурсе может работать только одна копия службы.
zh_cn: 无法将 {0} 服务移至以下资源：{1}。只有服务的一个副本可以在资源上运行。

# CDISA5509E
source: The app service can not be moved from the following resource: {0}. The resource has been configured as an application resource.
de: Der Service app kann nicht aus der folgenden Ressource versetzt werden: {0}. Die Ressource wurde als Anwendungsressource konfiguriert.
ja: 次のリソースからアプリケーション・サービスを移動できません: {0}。リソースはアプリケーション・リソースとして構成されています。
ru: Службу приложений нельзя переместить со следующего ресурса: {0}. Ресурс сконфигурирован как ресурс приложения.
zh_cn: 无法从以下资源移动应用程序服务：{0}。已将该资源配置为应用程序资源。

# CDISA5510E
source: The app service can not be moved to the following resource: {0}. The resource is running instance management services.
de: Der Service app kann nicht in die folgende Ressource versetzt werden: {0}. Die Ressource führt Instanzverwaltungsservices aus.
ja: 次のリソースにアプリケーション・サービスを移動できません: {0}。リソースは、インスタンス管理サービスを実行中です。
ru: Службу приложений нельзя переместить на следующий ресурс: {0}. На ресурсе работают службы управления экземпляром.
zh_cn: 无法将应用程序服务移至以下资源：{0}。该资源正在运行实例管理服务。

# CDISA5511E
source: No management resources are available for the {0} instance in the following domain: {1}. The instance.applicationOnManagementResourceAllowed property is false.
de: In der folgenden Domäne sind keine Managementressourcen für die Instanz {0} verfügbar: {1}. Die Eigenschaft instance.applicationOnManagementResourceAllowed ist auf ''false'' (falsch) gesetzt.
ja: 次のドメイン内の {0} インスタンスで使用可能な管理リソースがありません: {1}。instance.applicationOnManagementResourceAllowed プロパティーが false です。
ru: Не доступных ресурсов управления для экземпляра {0} в следующем домене: {1}. Свойство instance.applicationOnManagementResourceAllowed - false.
zh_cn: 没有任何管理资源可用于以下域中的 {0} 实例：{1}。instance.applicationOnManagementResourceAllowed 属性为 false。

# CDISA5512E
source: No application resources are available for the {0} instance in the following domain: {1}. The instance.applicationOnManagementResourceAllowed property is false.
de: In der folgenden Domäne sind keine Anwendungsressourcen für die Instanz {0} verfügbar: {1}. Die Eigenschaft instance.applicationOnManagementResourceAllowed ist auf ''false'' (falsch) gesetzt.
ja: 次のドメイン内の {0} インスタンスで使用可能なアプリケーション・リソースがありません: {1}。instance.applicationOnManagementResourceAllowed プロパティーが false です。
ru: Не доступных ресурсов приложений для экземпляра {0} в следующем домене: {1}. Свойство instance.applicationOnManagementResourceAllowed - false.
zh_cn: 没有任何应用程序资源可用于以下域中的 {0} 实例：{1}。instance.applicationOnManagementResourceAllowed 属性为 false。

# CDISA5513E
source: The build configuration requested the following Streams version: {0}. The version is not installed on the build controller.
de: Die Buildkonfiguration hat die folgende Streams-Konfiguration angefordert: {0}. Die Version ist auf dem Build-Controller nicht installiert.
ja: ビルド構成で次の Streams バージョンが要求されました: {0}。このバージョンはビルド・コントローラーにインストールされていません。
ru: Конфигурация сборки затребовала следующую версию Streams: {0}. Версия не установлена на контроллере сборки.
zh_cn: 构建配置已请求以下 Streams 版本：{0}。此版本未安装在构建控制器上。

# CDISA5514E
source: The build configuration requested the version associated with the following instance: {0}. The instance is currently stopped.
de: Die Buildkonfiguration hat die der folgenden Instanz zugeordnete Version angefordert: {0}. Die Instanz wird zurzeit gestoppt.
ja: 次のインスタンスに関連付けられたバージョンがビルド構成で要求されました: {0}。インスタンスは現在停止しています。
ru: Конфигурация сборки затребовала версию, связанную со следующим экземпляром: {0}. Экземпляр сейчас остановлен.
zh_cn: 构建配置已请求与以下实例相关联的版本：{0}。该实例当前已停止。

# CDISA5515E
source: The {0} user is not authorized reset metrics for the following domain: {1}.
de: Der Benutzer {0} ist nicht zum Zurücksetzen der Metriken für die folgende Domäne berechtigt: {1}.
ja: {0} ユーザーには、次のドメインのメトリックをリセットする権限がありません: {1}。
ru: Пользователь {0} не авторизован для сброса показателей для следующего домена: {1}.
zh_cn: 未授权 {0} 用户重置以下域的指标：{1}。

# CDISA5516E
source: The {0} user is not authorized reset metrics for the following instance: {1}.
de: Der Benutzer {0} ist nicht zum Zurücksetzen der Metriken für die folgende Instanz berechtigt: {1}.
ja: {0} ユーザーには、次のインスタンスのメトリックをリセットする権限がありません: {1}。
ru: Пользователь {0} не авторизован для сброса показателей для следующего экземпляра: {1}.
zh_cn: 未授权 {0} 用户重置以下实例的指标：{1}。

# CDISA5517E
source: A build with the following name already exists: {0}.
de: Ein Build mit dem folgenden Namen ist bereits vorhanden: {0}.
ja: 次の名前のビルドは既に存在しています: {0}。
ru: Сборка со следующим именем уже существует: {0}.
zh_cn: 已存在具有以下名称的构建：{0}。

# CDISA5518E
source: The following build name does not exist: {0}.
de: Der folgende Buildname ist nicht vorhanden: {0}.
ja: 次のビルド名は存在しません: {0}。
ru: Следующее имя сборки не существует: {0}.
zh_cn: 以下构建名称不存在：{0}。

# CDISA5519E
source: The {0} instance is running at a version that does not support the property: {1}.
de: Die Instanz {0} wird mit einer Version ausgeführt, die die folgende Eigenschaft nicht unterstützt: {1}.
ja: {0} インスタンスは、次のプロパティーをサポートしないバージョンで実行されています: {1}。
ru: Экземпляр {0} работает на уровне версии, не поддерживающей свойство: {1}.
zh_cn: {0} 实例正在一个不支持属性 {1} 的版本上运行。

# CDISA5520E
source: {0} is not a directory.
de: {0} ist kein Verzeichnis.
ja: {0} はディレクトリーではありません。
ru: {0} - это не каталог.
zh_cn: {0} 不是目录。

# CDISA5521E
source: {0} is not a file.
de: {0} ist keine Datei.
ja: {0} はファイルではありません。
ru: {0} - это не файл.
zh_cn: {0} 不是文件。

# CDISA5522E
source: {0} does not exist.
de: {0} ist nicht vorhanden.
ja: {0} が存在しません。
ru: {0} не существует.
zh_cn: {0} 不存在。

# CDISA5523E
source: The following content transfer identifier does not exist: {0}.
de: Die folgende Inhaltsübertragungs-ID ist nicht vorhanden: {0}.
ja: 次のコンテンツ転送 ID は存在しません: {0}。
ru: Следующий идентификатор передачи контента не существует: {0}.
zh_cn: 以下内容传输标识不存在：{0}。

# CDISA5524E
source: The {0} user is not authorized to create application cache items in the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Erstellen von Anwendungscacheelementen in der Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスでアプリケーション・キャッシュ・アイテムを作成する権限がありません: {2}。
ru: Пользователю {0} не разрешено создавать элементы кэша приложений в экземпляре {1} для следующего домена: {2}.
zh_cn: {0} 用户无权在以下域的 {1} 实例中创建应用程序高速缓存项：{2}。

# CDISA5525E
source: The {0} user is not authorized to list application cache items in the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Auflisten von Anwendungscacheelementen in der Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスでアプリケーション・キャッシュ・アイテムをリストする権限がありません: {2}。
ru: Пользователю {0} не разрешено получать список элементов кэша приложений в экземпляре {1} для следующего домена: {2}.
zh_cn: {0} 用户无权列示以下域的 {1} 实例中的应用程序高速缓存项：{2}。

# CDISA5526E
source: {0} does not exist.
de: {0} ist nicht vorhanden.
ja: {0} が存在しません。
ru: {0} не существует.
zh_cn: {0} 不存在。

# CDISA5527E
source: Failed to initialize COS repository store, end point: {0} bucket: {1} cause: {2}
de: COS-Repository-Speicher konnte nicht initialisiert werden, Endpunkt: {0} Bucket: {1} Ursache: {2}
ja: COS リポジトリー・ストアの初期化に失敗しました。エンドポイント: {0} バケット: {1} 原因: {2}
ru: Не удалось инициализировать склад репозитория COS, конечная точка: {0}, бакет: {1}, причина: {2}
zh_cn: 无法初始化 COS 存储库存储，端点：{0} 存储区：{1} 原因：{2}

# CDISA5528E
source: Failed to create bucket. Bucket: {0} endpoint: {1} cause: {2}
de: Bucket konnte nicht erstellt werden. Bucket: {0} Endpunkt: {1} Ursache: {2}
ja: バケットの作成に失敗しました。バケット: {0} エンドポイント: {1} 原因: {2}
ru: Не удалось создать пакет. Пакет: {0} конечная точка: {1} причина: {2}
zh_cn: 无法创建存储区。存储区：{0} 端点：{1} 原因：{2}

# CDISA5529E
source: Failed to remove object from common object storage. Object ID: {0} bucket: {1} cause: {2}
de: Objekt konnte nicht aus dem allgemeinen Objektspeicher entfernt werden. Objekt-ID: {0} Bucket: {1} Ursache: {2}
ja: 共通オブジェクト・ストレージからオブジェクトを削除するのに失敗しました。オブジェクト ID: {0} バケット: {1} 原因: {2}
ru: Не удалось удалить объект из общего хранилища объектов. ID объекта: {0} пакет: {1} причина: {2}
zh_cn: 无法从公共对象存储器中移除对象。对象标识：{0} 存储区：{1} 原因：{2}

# CDISA5530E
source: Failed to retrieve data from common object storage. Object ID: {0} bucket: {1} cause: {2}
de: Daten konnten nicht aus dem allgemeinen Objektspeicher abgerufen werden. Objekt-ID: {0} Bucket: {1} Ursache: {2}
ja: 共通オブジェクト・ストレージからデータを取得するのに失敗しました。オブジェクト ID: {0} バケット: {1} 原因: {2}
ru: Не удалось получить данные из общего хранилища объектов. ID объекта: {0} пакет: {1} причина: {2}
zh_cn: 无法从公共对象存储器中检索数据。对象标识：{0} 存储区：{1} 原因：{2}

# CDISA5531E
source: Failed to write data to common object storage. Object ID: {0} bucket: {1} cause: {2}
de: Daten konnten nicht in den allgemeinen Objektspeicher geschrieben werden. Objekt-ID: {0} Bucket: {1} Ursache: {2}
ja: 共通オブジェクト・ストレージにデータを書き込むのに失敗しました。オブジェクト ID: {0} バケット: {1} 原因: {2}
ru: Не удалось записать данные в общее хранилище объектов. ID объекта: {0} пакет: {1} причина: {2}
zh_cn: 无法将数据写至公共对象存储器。对象标识：{0} 存储区：{1} 原因：{2}

# CDISA5532E
source: Failed to determine if an object exists in common object storage. Object ID: {0} bucket: {1} cause: {2}
de: Es konnte nicht festgestellt werden, ob ein Objekt im allgemeinen Objektspeicher vorhanden ist. Objekt-ID: {0} Bucket: {1} Ursache: {2}
ja: 共通オブジェクト・ストレージにオブジェクトが存在するかどうか判別できませんでした。オブジェクト ID: {0} バケット: {1} 原因: {2}
ru: Не удалось определить, существует ли объект в общем хранилище объектов. ID объекта: {0} пакет: {1} причина: {2}
zh_cn: 无法确定公共对象存储器中是否存在某个对象。对象标识：{0} 存储区：{1} 原因：{2}

# CDISA5533E
source: The {0} user is not authorized to access application cache item {1} in the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Zugriff auf das Anwendungscacheelement {1} in der Instanz {2} für die folgende Domäne berechtigt: {3}.
ja: {0} ユーザーには、次のドメインの {2} インスタンスでアプリケーション・キャッシュ・アイテム {1} にアクセスする権限がありません: {3}。
ru: Пользователю {0} не разрешено получать доступ к элементу кэша приложений {1} в экземпляре {2} для следующего домена: {3}.
zh_cn: {0} 用户无权访问以下域的 {2} 实例中的应用程序高速缓存项 {1}：{3}。

# CDISA5534E
source: The {0} user is not authorized to update application cache item {1} in the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Aktualisieren des Anwendungscacheelements {1} in der Instanz {2} für die folgende Domäne berechtigt: {3}.
ja: {0} ユーザーには、次のドメインの {2} インスタンスでアプリケーション・キャッシュ・アイテム {1} を更新する権限がありません: {3}。
ru: Пользователю {0} не разрешено обновлять элемент кэша приложений {1} в экземпляре {2} для следующего домена: {3}.
zh_cn: {0} 用户无权更新以下域的 {2} 实例中的应用程序高速缓存项 {1}：{3}。

# CDISA5535E
source: The {0} user is not authorized to remove application cache item {1} in the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Entfernen des Anwendungscacheelements {1} in der Instanz {2} für die folgende Domäne berechtigt: {3}.
ja: {0} ユーザーには、次のドメインの {2} インスタンスでアプリケーション・キャッシュ・アイテム {1} を削除する権限がありません: {3}。
ru: Пользователю {0} не разрешено удалять элемент кэша приложений {1} в экземпляре {2} для следующего домена: {3}.
zh_cn: {0} 用户无权移除以下域的 {2} 实例中的应用程序高速缓存项 {1}：{3}。

# CDISA5536E
source: The {0} log directory does not exist on the following resource: {1}.
de: Das Protokollverzeichnis {0} ist in der folgenden Ressource nicht vorhanden: {1}.
ja: {0} ログ・ディレクトリーは次のリソースで存在しません: {1}。
ru: Каталог журнала {0} не существует на следующем ресурсе: {1}.
zh_cn: 以下资源上没有 {0} 日志目录：{1}。

# CDISA5537E
source: Unexpected error while retrieving job information for resource {0}. Cause: {1}
de: Unerwarteter Fehler beim Abrufen von Informationen für Ressource: {0}. Ursache: {1}
ja: リソース {0} のジョブ情報の取得中に予期しないエラーが発生しました。原因: {1}
ru: Неожиданная ошибка при получении информации о задании для ресурса {0}. Причина: {1}
zh_cn: 检索资源 {0} 的作业信息时发生意外错误。原因：{1}

# CDISA5538E
source: Tag name is empty and invalid.
de: Der Tagname ist leer und ungültig.
ja: タグ名が空で無効です。
ru: Имя тега - пустое и недействительное.
zh_cn: 标记名称为空并且无效。

# CDISA5539W
source: Java garbage collection took longer than expected for service {1}, pid {2} on resource {3} in domain {4}. The time was {0} millseconds. The service might be overloaded or the resource might be undersized.
de: Die Java-Garbage-Collection hat für Service {1}, PID {2} in Ressource {3} in Domäne {4} länger als erwartet gedauert. Zeit: {0} Millsekunden. Möglicherweise ist der Service überlastet oder die Ressource zu klein.
ja: ドメイン {4} 内のリソース {3} で、サービス {1}、PID {2} の Java ガーベッジ・コレクションに予想よりも長い時間がかかりました。かかった時間は {0} ミリ秒でした。サービスが過負荷になっているか、リソースのサイズが小さすぎるが可能性があります。
ru: Сбор мусора Java занял дольше, чем ожидалось для службы {1}, pid {2} на ресурсе {3} в домене {4}. Время - {0} мс. Возможно, служба перегружена, или размер ресурса, возможно, преуменьшен.
zh_cn: 对于域 {4} 中资源 {3} 上的服务 {1}（pid 为 {2}）, Java 垃圾回收消耗的时间比预期长。消耗时间为 {0} 毫秒。该服务可能超负荷，或者资源可能过小。

# CDISA5540W
source: Java garbage collection took longer than expected for service {1}, pid {2} on resource {3} in instance {4}. The time was {0} millseconds. The service might be overloaded or the resource might be undersized.
de: Die Java-Garbage-Collection hat für Service {1}, PID {2} in Ressource {3} in Instanz {4} länger als erwartet gedauert. Zeit: {0} Millsekunden. Möglicherweise ist der Service überlastet oder die Ressource zu klein.
ja: インスタンス {4} 内のリソース {3} で、サービス {1}、PID {2} の Java ガーベッジ・コレクションに予想よりも長い時間がかかりました。かかった時間は {0} ミリ秒でした。サービスが過負荷になっているか、リソースのサイズが小さすぎるが可能性があります。
ru: Сбор мусора Java занял дольше, чем ожидалось для службы {1}, pid {2} на ресурсе {3} на экземпляре {4}. Время - {0} мс. Возможно, служба перегружена, или размер ресурса, возможно, преуменьшен.
zh_cn: 对于实例 {4} 中资源 {3} 上的服务 {1}（pid 为 {2}）, Java 垃圾回收消耗的时间比预期长。消耗时间为 {0} 毫秒。该服务可能超负荷，或者资源可能过小。

# CDISA5541W
source: The java heap memory in use for service {0}, pid {1} on resource {2} in domain {3} is near the maximum size configured. Heap memory: used = {4} bytes, committed = {5} bytes, maximum = {6} bytes.
de: Der Java-Heapspeicher, der für Service {0}, PID {1} in Ressource {2} in Domäne {3} verwendet wird, hat fast die konfigurierte Maximalgröße ereicht. Heapspeicher: verwendet = {4} Byte, festgeschrieben = {5} Byte, Maximum = {6} Byte.
ja: ドメイン {3} のリソース {2} で、サービス {0}、PID {1} に使用されている Java ヒープ・メモリーが、構成された最大サイズに近づいています。ヒープ・メモリー: 使用済み = {4} バイト、コミット済み = {5} バイト、最大 = {6} バイト。
ru: Используемая память кучи Java для службы {0}, pid {1} на ресурсе {2} в домене {3} приближается к максимальному сконфигурированному размеру. Память кучи: используемая = {4} байт, принятая = {5} байт, максимальная = {6} байт.
zh_cn: 正用于域 {3} 中资源 {2} 上的服务 {0}（pid 为 {1}）的 Java 堆内存接近所配置的最大大小。堆内存：已使用 = {4} 字节，已落实 = {5} 字节，最大值 = {6} 字节。

# CDISA5542W
source: The java heap memory in use for service {0}, pid {1} on resource {2} in instance {3} is near the maximum size configured. Heap memory: used = {4} bytes, committed = {5} bytes, maximum = {6} bytes.
de: Der Java-Heapspeicher, der für Service {0}, PID {1} in Ressource {2} in Instanz {3} verwendet wird, hat fast die konfigurierte Maximalgröße ereicht. Heapspeicher: verwendet = {4} Byte, festgeschrieben = {5} Byte, Maximum = {6} Byte.
ja: インスタンス {3} のリソース {2} で、サービス {0}、PID {1} に使用されている Java ヒープ・メモリーが、構成された最大サイズに近づいています。ヒープ・メモリー: 使用済み = {4} バイト、コミット済み = {5} バイト、最大 = {6} バイト。
ru: Используемая память кучи Java для службы {0}, pid {1} на ресурсе {2} на экземпляре {3} приближается к максимальному сконфигурированному размеру. Память кучи: используемая = {4} байт, принятая = {5} байт, максимальная = {6} байт.
zh_cn: 正用于实例 {3} 中资源 {2} 上的服务 {0}（pid 为 {1}）的 Java 堆内存接近所配置的最大大小。堆内存：已使用 = {4} 字节，已落实 = {5} 字节，最大值 = {6} 字节。

# CDISA5543E
source: The {0} build resource could not locate an available build controller.
de: Die Buildressource {0} konnte keinen verfügbaren Build-Controller finden.
ja: {0} ビルド・リソースは、使用可能なビルド・コントローラーを見つけることができませんでした。
ru: Ресурс сборки {0} не смог найти доступный контроллер сборки.
zh_cn: {0} 构建资源找不到可用的构建控制器。

# CDISA5544E
source: The {0} build resource could not start a local build controller.
de: Die Buildressource {0} konnte keinen lokalen Build-Controller starten.
ja: {0} ビルド・リソースは、ローカル・ビルド・コントローラーを開始できませんでした。
ru: Ресурс сборки {0} не смог запустить локальный контроллер сборки.
zh_cn: {0} 构建资源无法启动本地构建控制器。

# CDISA5545E
source: The {0} build resource encountered an error communicating with the build controller.
de: Die Buildressource {0} hat bei der Kommunikation mit dem Build-Controller einen Fehler festgestellt.
ja: {0} ビルド・リソースで、ビルド・コントローラーとの通信中にエラーが発生しました。
ru: Ресурс сборки {0} обнаружил ошибку при взаимодействии с контроллером сборки.
zh_cn: {0} 构建资源与构建控制器通信时遇到错误。

# CDISA5546E
source: The {0} directory can not be created on the build controller.
de: Das Verzeichnis {0} kann auf dem Build-Controller nicht erstellt werden.
ja: {0} ディレクトリーはビルド・コントローラーに作成できません。
ru: Не удается создать каталог {0} на контроллере сборки.
zh_cn: 无法在构建控制器上创建 {0} 目录。

# CDISA5547E
source: The {0} build archive could not be unpackaged on the build controller.
de: Das Buildarchiv {0} konnte nicht auf dem Build-Controller entpackt werden.
ja: ビルド・コントローラーで {0} ビルド・アーカイブを解凍できませんでした。
ru: Не удалось распаковать архив сборки {0} на контроллере сборки.
zh_cn: {0} 构建归档无法在构建控制器上解压。

# CDISA5548E
source: Application cache item {0} does not exist.
de: Anwendungscacheelement {0} ist nicht vorhanden.
ja: アプリケーション・キャッシュ項目 {0} が存在しません。
ru: Элемент кэша приложения {0} не существует.
zh_cn: 应用程序高速缓存项 {0} 不存在。
