Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsRuntimeMessages_*.xlf
Languages: ko, pt_br

# CDISR1413E
source: The operation failed because the value "channelIsolation" is required for the configuration setting "parallelRegionConfig" in order to change the width of a parallel region. The current value is "{0}".
ko: 병렬 영역의 너비를 변경하려는 경우 구성 설정 "parallelRegionConfig"의 값이 "channelIsolation"이어야 하기 때문에 조작이 실패했습니다. 현재 값은 "{0}"입니다.
pt_br: A operação falhou porque o valor "channelIsolation" é necessário para a definição da configuração "parallelRegionConfig" para que a largura de uma região paralela seja mudada. O valor atual é "{0}".

# CDISR1414E
source: The operation failed because the value "channelIsolation" is required for the configuration setting "parallelRegionConfig" in order to change the width of a parallel region. The value for the "parallelRegionConfig" setting is not set, defaults to {0}.
ko: 병렬 영역의 너비를 변경하려는 경우 구성 설정 "parallelRegionConfig"의 값이 "channelIsolation"이어야 하기 때문에 조작이 실패했습니다. "parallelRegionConfig" 설정 값이 설정되어 있지 않습니다. 기본값은 {0}입니다.
pt_br: A operação falhou porque o valor "channelIsolation" é necessário para a definição da configuração "parallelRegionConfig" para que a largura de uma região paralela seja mudada. O valor para a configuração "parallelRegionConfig" não está configurado, será padronizado para {0}.

# CDISR1415I
source: The following operators were restarted even though they were not part of the target region: {0}. Either they were directly connected to input or output operators within a parallel region, or they shared a Processing Element with operators that were targeted.
ko: {0} 연산자는 대상 영역에 속해 있음에도 불구하고 재시작되었습니다. 해당 연산자는 병렬 영역 내의 입력 또는 출력 연산자에 직접 연결되어 있거나 대상으로 지정된 연산자와 처리 요소를 공유합니다.
pt_br: Os operadores a seguir foram reiniciados, embora eles não fossem parte da região de destino: {0}. Eles foram conectados diretamente a operadores de entrada ou saída em uma região paralela ou compartilharam um Elemento de Processamento com operadores que foram destinados.

# CDISR1416E
source: The operation failed because the value "channelIsolation" or "noChannelInfluence" is required for the configuration setting "parallelRegionConfig" in order to change the width of a parallel region. The current value is "{0}".
ko: 병렬 영역의 너비를 변경하려면 구성 설정 "parallelRegionConfig"에 "channelIsolation" 또는 "noChannelInfluence" 값이 필요하므로 조작이 실패했습니다. 현재 값은 "{0}"입니다.
pt_br: A operação falhou porque o valor "channelIsolation" ou "noChannelInfluence" é necessário para a definição de configuração "parallelRegionConfig" para mudar a largura de uma região paralela. O valor atual é "{0}".

# CDISR1417W
source: A request to add dynamic resources to the job was ignored because the request did not result in an increase to the width of a parallel region.
ko: 작업에 동적 자원을 추가하기 위한 요청의 결과로서 병렬 영역의 너비가 증가하지 않았기 때문에 이 요청이 무시되었습니다.
pt_br: Uma solicitação para incluir recursos dinâmicos na tarefa foi ignorada porque a solicitação não resultou em um aumento na largura de uma região paralela.

# CDISR1418E
source: The operation failed because the following operators are not restarable: {0}.
ko: {0} 연산자는 재시작할 수 없기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque os operadores a seguir não são reinicializáveis: {0}.

# CDISR1419E
source: The updateoperators operation for job id {0} failed because the following affected operators were found to be configured for checkpointing: {1}.
ko: 영향을 받는 {1} 연산자가 체크포인트 조작을 수행하도록 구성되었으므로 작업 ID {0}에 대한 updateoperators 조작이 실패했습니다.
pt_br: A operação updateoperators para o ID da tarefa {0} falhou porque os seguintes operadores afetados foram considerados como configurados para o ponto de verificação: {1}.

# CDISR1501E
source: An attempt to set the locale did not succeed.
ko: 로케일 설정 시도가 실패했습니다.
pt_br: A tentativa de configurar o código de idioma não foi bem-sucedida.

# CDISR1502E
source: An attempt to use a message bundle resulted in an error.
ko: 메시지 번들 사용 시도로 인해 오류가 발생했습니다.
pt_br: A tentativa de usar um pacote configurável de mensagem resultou em erro.

# CDISR1503E
source: The requested {0} message was not found.
ko: 요청된 {0} 메시지가 없습니다.
pt_br: A mensagem {0} solicitada não foi localizada.

# CDISR1504E
source: A formatting error was found in the {0} message request.
ko: {0} 메시지 요청에 형식 오류가 있습니다.
pt_br: Um erro de formatação foi localizado na solicitação de mensagem {0}.

# CDISR1505E
source: The {0} resource bundle directory cannot be registered.
ko: {0} 자원 번들 디렉토리를 등록할 수 없습니다.
pt_br: O diretório do pacote configurável de recursos {0} não pode ser registrado.

# CDISR1506E
source: An exception occurred in a utility function.
ko: 유틸리티 기능에 예외가 발생했습니다.
pt_br: Ocorreu uma exceção em uma função de utilitário.

# CDISR1507E
source: A formatting error in the date or timestamp occurred when the utility function was run.
ko: 유틸리티 기능을 실행할 때 날짜 또는 시간소인의 형식 오류가 발생했습니다.
pt_br: Ocorreu um erro de formatação na data ou no registro de data e hora quando a função de utilitário foi executada.

# CDISR1508E
source: An internal error occurred. The system cannot create the date and time formatter for the {0} pattern when the ICU error code is {1}.
ko: 내부 오류가 발생했습니다. ICU 오류 코드가 {1}인 경우 시스템이 {0} 패턴의 날짜 및 시간 포맷터를 작성할 수 없습니다.
pt_br: Erro interno. O sistema não pode criar o formatador de data e hora para o padrão {0} quando o código de erro ICU é {1}.

# CDISR1560E
source: The system cannot set the next transition for the {0} fsm object.
ko: 시스템이 {0} fsm 오브젝트에 대한 다음 전이를 설정할 수 없습니다.
pt_br: O sistema não pode configurar a próxima transição para o objeto fsm {0}.

# CDISR1561E
source: A null transition, which is not valid, is specified for the {0} fsm object.
ko: {0} fsm 오브젝트에 유효하지 않은 널(NULL) 전이를 지정했습니다.
pt_br: Uma transição nula, que não é válida, é especificada para o objeto fsm {0}.

# CDISR1562E
source: The system cannot process the request. The fsm was stopped.
ko: 시스템이 요청을 처리할 수 없습니다. fsm을 중지했습니다.
pt_br: O sistema não pode processar a solicitação. O fsm foi interrompido.

# CDISR1563E
source: The {1} property was not found for the {0} fsm object in the {2} state.
ko: {2} 상태의 {0} fsm 오브젝트에 대한 {1} 특성이 없습니다.
pt_br: A propriedade {1} não foi localizada para o objeto fsm {0} no estado {2}.

# CDISR1564E
source: A timeout occurred while the system waited for an operation to complete.
ko: 시스템이 조작 완료를 기다리는 중에 시간종료가 발생했습니다.
pt_br: Ocorreu um tempo limite enquanto o sistema esperava uma operação ser concluída.

# CDISR1565E
source: The {0} fsm object was not found.
ko: {0} fsm 오브젝트가 없습니다.
pt_br: O objeto fsm {0} não foi localizado.

# CDISR1566E
source: The {0} fsm engine was not found.
ko: {0} fsm 엔진이 없습니다.
pt_br: O mecanismo fsm {0} não foi localizado.

# CDISR1567E
source: The {0} fsm object already exists.
ko: {0} fsm 오브젝트가 이미 있습니다.
pt_br: O objeto fsm {0} já existe.

# CDISR1568E
source: The request for the {0} fsm object cannot be processed. The object was stopped.
ko: {0} fsm 오브젝트에 대한 요청을 처리할 수 없습니다. 오브젝트를 중지했습니다.
pt_br: A solicitação para o objeto fsm {0} não pode ser processada. O objeto foi interrompido.

# CDISR1569E
source: The {0} fsm engine already exists.
ko: {0} fsm 엔진이 이미 있습니다.
pt_br: O mecanismo fsm {0} já existe.

# CDISR1570E
source: A state transition from {0} to {1} is not valid.
ko: {0}에서 {1}(으)로의 상태 전이는 유효하지 않습니다.
pt_br: Uma transição de estado de {0} para {1} não é válida.

# CDISR1571E
source: The specified state value of {0} is not valid.
ko: 지정된 상태 값 {0}이(가) 유효하지 않습니다.
pt_br: O valor de estado especificado de {0} não é válido.

# CDISR1572E
source: The specified transition value of {0} is not valid.
ko: 지정된 전이 값 {0}이(가) 유효하지 않습니다.
pt_br: O valor de transição especificado de {0} não é válido.

# CDISR1573E
source: A null value was specified for the Fsm Impl object.
ko: Fsm Impl 오브젝트에 널(NULL) 값을 지정했습니다.
pt_br: Um valor nulo foi especificado para o objeto Fsm Impl.

# CDISR1575W
source: The runtime service cannot access the {0} Linux user resource limit because the service encountered the following error: {1}
ko: 서비스에 {1} 오류가 발생했으므로 런타임 서비스가 {0} Linux 사용자 자원 한계에 액세스할 수 없습니다.
pt_br: O serviço de tempo de execução não pode acessar o limite de recurso de usuário do Linux {0} porque o serviço encontrou o erro a seguir: {1}

# CDISR1576W
source: The runtime service cannot set the {0} Linux user resource limit because the service encountered the following error: {1}. The current soft limit is {2} and the hard limit is {3}
ko: 서비스에 {1} 오류가 발생했으므로 런타임 서비스가 {0} Linux 사용자 자원 한계를 설정할 수 없습니다. 현재 소프트 한계는 {2}이며 하드 한계는 {3}입니다.
pt_br: O serviço de tempo de execução não pode configurar o limite de recurso de usuário do Linux {0} porque o serviço encontrou o erro a seguir: {1}. O limite flexível atual é {2} e o limite máximo é {3}

# CDISR1577I
source: For the {0} Linux user resource limit, the runtime service raised the soft limit to match the hard limit of {1}.
ko: {0} Linux 사용자 자원 한계의 경우 런타임 서비스에서 소프트 한계를 하드 한계 {1}과(와) 일치하도록 높였습니다.
pt_br: Para o limite de recurso de usuário do Linux {0}, o serviço de tempo de execução aumentou o limite flexível para corresponder ao limite máximo de {1}.

# CDISR1578W
source: The runtime service cannot set the {0} Linux user resource hard limit to {2} and soft limit to {3} because the service encountered the following error: {1}.
ko: 서비스에 {1} 오류가 발생했으므로 런타임 서비스가 {0} Linux 사용자 자원 하드 한계를 {2}(으)로, 소프트 한계를 {3}(으)로 설정할 수 없습니다.
pt_br: O serviço de tempo de execução não pode configurar o limite máximo do recurso de usuário do Linux {0} para {2} e o limite flexível para {3} porque o serviço encontrou o erro a seguir: {1}.

# CDISR1579I
source: For the {0} Linux user resource limit, the runtime service set the hard limit to {1} and the soft limit to {2}.
ko: {0} Linux 사용자 자원 한계의 경우 런타임 서비스에서 하드 한계를 {1}(으)로, 소프트 한계를 {2}(으)로 설정했습니다.
pt_br: Para o limite de recurso de usuário do Linux {0}, o serviço de tempo de execução configurou o limite máximo para {1} e o limite flexível para {2}.

# CDISR1900E
source: The runtime software encountered the following transport error: {0}.
ko: 런타임 소프트웨어에 전송 오류 {0}이(가) 발생했습니다.
pt_br: O software de tempo de execução encontrou o erro de transporte a seguir: {0}.

# CDISR1901E
source: An error occurred in a data receiver. The error is: {0}.
ko: 데이터 수신기에 오류가 발생했습니다. 오류는 {0}입니다.
pt_br: Ocorreu um erro em um receptor de dados. O erro é: {0}.

# CDISR1902E
source: The data receiver was not initialized because the system could not retrieve the name or address of the local host.
ko: 시스템이 로컬 호스트의 이름 또는 주소를 검색할 수 없으므로 데이터 수신기를 초기화하지 못했습니다.
pt_br: O receptor de dados não foi inicializado porque o sistema não pôde recuperar o nome ou o endereço do host local.

# CDISR1903E
source: The {0} system call returned the following error code: {1}.
ko: {0} 시스템 호출이 오류 코드 {1}을(를) 리턴했습니다.
pt_br: A chamada de sistema {0} retornou o código de erro a seguir: {1}.

# CDISR1904E
source: The {0} argument was passed to a method, but the argument contains the following value that is either not valid or not correct: {1}.
ko: {0} 인수를 메소드로 전달했지만 인수에 유효하지 않거나 올바르지 않은 {1} 값이 포함되어 있습니다.
pt_br: O argumento {0} foi passado para um método, mas o argumento contém o valor a seguir, que não é válido ou não está correto: {1}.

# CDISR1905E
source: A program assertion failed: {0}.
ko: 프로그램 어설션 실패: {0}.
pt_br: Falha na asserção do programa: {0}.

# CDISR1906E
source: The system received an invalid message header: {0}.
ko: 시스템이 유효하지 않은 메시지 헤더 {0}을(를) 수신했습니다.
pt_br: O sistema recebeu um cabeçalho de mensagem inválido: {0}.

# CDISR1907E
source: The data stream that was received is corrupted.
ko: 수신한 데이터 스트림이 손상되었습니다.
pt_br: O fluxo de dados que foi recebido está corrompido.

# CDISR1908E
source: A timeout occurred on a read or accept operation for a socket.
ko: 소켓에 대한 읽기 또는 허용 조작 시 시간종료되었습니다.
pt_br: Ocorreu um tempo limite na operação de aceitação ou leitura para um soquete.

# CDISR1909E
source: A connection to the {0} port was rejected. The error is: {1}.
ko: {0} 포트에 대한 연결이 거부되었습니다. 오류는 {1}입니다.
pt_br: Uma conexão com a porta {0} foi rejeitada. O erro é: {1}.

# CDISR1910E
source: While the connection was being established, the following instance ID was received: {1}. The expected instance ID is: {0}.
ko: 연결을 설정하는 중에 인스턴스 ID {1}을(를) 수신했습니다. 예상 인스턴스 ID는 {0}입니다.
pt_br: Enquanto a conexão estava sendo estabelecida, o ID da instância a seguir foi recebido: {1}. O ID de instância esperado é: {0}.

# CDISR1911E
source: While the connection was being established, the following unexpected magic code was received: {0}.
ko: 연결을 설정하는 중에 예기치 않은 매직 코드 {0}을(를) 수신했습니다.
pt_br: Enquanto a conexão estava sendo estabelecida, o código mágico inesperado a seguir foi recebido: {0}.

# CDISR1912E
source: While the connection was being established, the following input port label was received: {0}. The expected label is: {1}.
ko: 연결을 설정하는 중에 입력 포트 레이블 {0}을(를) 수신했습니다. 예상 레이블이 {1}입니다.
pt_br: Enquanto a conexão estava sendo estabelecida, o rótulo da porta de entrada a seguir foi recebido: {0}. O rótulo esperado é: {1}.

# CDISR1913I
source: An attempt to connect to the port with the following label failed: {0}.
ko: 레이블이 {0}인 포트에 대한 연결 시도에 실패했습니다.
pt_br: Falha na tentativa de conectar à porta com o seguinte rótulo: {0}.

# CDISR1914I
source: The connection to the {0} port succeeded after {1} attempts.
ko: {1}번의 시도 후 {0} 포트에 대한 연결이 성공했습니다.
pt_br: A conexão com a porta {0} foi bem-sucedida após {1} tentativas.

# CDISR1915E
source: Environment variable STREAMS_INSTANCE_ID must be defined.
ko: 환경 변수 STREAMS_INSTANCE_ID를 정의해야 합니다.
pt_br: A variável de ambiente STREAMS_INSTANCE_ID deve ser definida.

# CDISR1916E
source: Bad magic number: received {0}, expected {1}
ko: 불량 매직 수: {0}개 수신, {1}개 예상
pt_br: Número mágico inválido: {0} recebido, {1} esperado

# CDISR1917E
source: Unexpected data length {0}
ko: 예기치 않은 데이터 길이 {0}
pt_br: Comprimento de dados {0} inesperado

# CDISR1918E
source: Unexpected prefix length {0}
ko: 예기치 않은 접두부 길이 {0}
pt_br: Comprimento de prefixo {0} inesperado

# CDISR1919E
source: Incorrect bool encoding value {0}
ko: 올바르지 않은 부울 인코딩 값 {0}
pt_br: Valor de codificação bool {0} incorreto

# CDISR1920E
source: Port name is missing
ko: 포트 이름 누락
pt_br: O nome da porta está ausente

# CDISR1921E
source: Instance ID is missing
ko: 인스턴스 ID 누락
pt_br: ID da instância está ausente

# CDISR1922E
source: Bad line end: received {0}, expected {1}
ko: 잘못된 라인 종료: {0} 수신, {1} 예상
pt_br: Fim da linha inválido: {0} recebido, {1} esperado

# CDISR1923E
source: Could not decode a {0} from buffer {1}
ko: {1} 버퍼에서 {0}을(를) 디코드할 수 없음
pt_br: Não foi possível decodificar um {0} a partir do buffer {1}

# CDISR1924E
source: Unexpected instance ID: received {0}, expected {1}
ko: 예기치 않은 인스턴스 ID: {0} 수신, {1} 예상
pt_br: ID da instância inesperado: {0} recebido, {1} esperado

# CDISR1925E
source: Unexpected input port label: received {0}, expected {1}
ko: 예기치 않은 입력 포트 레이블: {0} 수신, {1} 예상
pt_br: Rótulo de porta de entrada inesperado: {0} recebido, {1} esperado

# CDISR1926E
source: Unexpected IO Exception
ko: 예기치 않은 입출력 예외
pt_br: Exceção de E/S Inesperada

# CDISR1927E
source: Unexpected Distillery Exception
ko: 예기치 않은 Streams 예외
pt_br: Exceção de dissipação inesperada

# CDISR2011E
source: The {0} host ID is not valid.
ko: {0} 호스트 ID가 유효하지 않습니다.
pt_br: O ID do host {0} não é válido.

# CDISR2066E
source: A job ID must be specified.
ko: 작업 ID를 지정해야 합니다.
pt_br: Um ID de tarefa deve ser especificado.

# CDISR2067E
source: A PE ID must be specified.
ko: PE ID를 지정해야 합니다.
pt_br: Um ID de PE deve ser especificado.

# CDISR2068E
source: An operator name must be specified.
ko: 연산자 이름을 지정해야 합니다.
pt_br: Um nome de operador deve ser especificado.

# CDISR2069E
source: An port index must be specified.
ko: 포트 인덱스를 지정해야 합니다.
pt_br: Um índice de porta deve ser especificado.

# CDISR2070E
source: Resource not found - {0}.
ko: 자원을 찾을 수 없음 - {0}.
pt_br: Recurso não localizado - {0}.

# CDISR2252I
source: IBM Streams is attempting to add the {0} host to the following instance: {1}.
ko: IBM Streams가 {0} 호스트를 {1} 인스턴스에 추가하려고 시도하는 중입니다.
pt_br: O IBM Streams está tentando incluir o host {0} na instância a seguir: {1}.

# CDISR2253I
source: IBM Streams successfully added the {0} host to the following instance: {1}.
ko: IBM Streams가 {0} 호스트를 {1} 인스턴스에 추가했습니다.
pt_br: O IBM Streams incluiu com sucesso o host {0} na instância a seguir: {1}.

# CDISR2254I
source: IBM Streams is attempting to remove the {0} host from the following instance: {1}.
ko: IBM Streams가 {0} 호스트를 {1} 인스턴스에서 제거하려고 시도하는 중입니다.
pt_br: O IBM Streams está tentando remover o host {0} da instância a seguir: {1}.

# CDISR2255I
source: IBM Streams successfully removed the {0} host from the following instance: {1}.
ko: IBM Streams가 {0} 호스트를 {1} 인스턴스에서 제거했습니다.
pt_br: O IBM Streams removeu com sucesso o host {0} da instância a seguir: {1}.

# CDISR2277I
source: The Streams Resource Manager service was started successfully.
ko: Streams Resource Manager 서비스를 시작했습니다.
pt_br: O serviço Streams Resource Manager foi iniciado com sucesso.

# CDISR2278I
source: The Streams Resource Manager service was shut down successfully.
ko: Streams Resource Manager 서비스를 종료했습니다.
pt_br: O serviço Streams Resource Manager foi encerrado com sucesso.

# CDISR2500E
source: An unexpected internal error occurred in the Authentication and authorization service.
ko: 인증 및 권한 부여 서비스에 예기치 않은 내부 오류가 발생했습니다.
pt_br: Ocorreu um erro interno inesperado no serviço de autenticação e autorização.

# CDISR2503E
source: The specified user name or the specified password is not valid.
ko: 지정된 사용자 이름 또는 지정된 암호가 유효하지 않습니다.
pt_br: O nome do usuário especificado ou a senha especificada não são válidos.

# CDISR2518E
source: You do not have the authority to use this domain.
ko: 이 도메인 사용 권한이 없습니다.
pt_br: Você não tem autoridade para usar este domínio.

# CDISR2523E
source: The authentication key is not valid.
ko: 인증 키가 유효하지 않습니다.
pt_br: A chave de autenticação não é válida.

# CDISR2539E
source: The session is not valid, or the session has expired.
ko: 세션이 유효하지 않거나 세션이 만기되었습니다.
pt_br: A sessão não é válida ou a sessão expirou.

# CDISR2542E
source: You cannot remove the following object: {0}.
ko: {0} 오브젝트를 제거할 수 없습니다.
pt_br: Não é possível remover o objeto a seguir: {0}.

# CDISR2543E
source: The following object already exists: {0}.
ko: {0} 오브젝트가 이미 있습니다.
pt_br: O objeto a seguir já existe: {0}.

# CDISR2545E
source: The Authentication and Authorization Service cannot be contacted.
ko: 인증 및 권한 부여 서비스에 접속할 수 없습니다.
pt_br: O Serviço de Autenticação e Autorização não pode ser contatado.

# CDISR2546E
source: The Authentication and Authorization Service cannot be contacted. An unexpected exception occurred.
ko: 인증 및 권한 부여 서비스에 접속할 수 없습니다. 예기치 않은 예외가 발생했습니다.
pt_br: O Serviço de Autenticação e Autorização não pode ser contatado. Ocorreu uma exceção inesperada.

# CDISR2559E
source: The authentication by key operation failed.
ko: 키 조작을 통한 인증에 실패했습니다.
pt_br: A operação de autenticação por chave falhou.

# CDISR2567E
source: The following object name contains characters that are not ASCII characters: {0}.
ko: 오브젝트 이름 {0}에 ASCII 문자가 아닌 문자가 포함되어 있습니다.
pt_br: O nome do objeto a seguir contém caracteres que não são ASCII: {0}.

# CDISR2569E
source: The key files that are used for authentication cannot be found, or cannot be opened.
ko: 인증에 사용되는 키 파일을 찾을 수 없거나 열 수 없습니다.
pt_br: Os arquivos chave que são usados para autenticação não podem ser localizados ou abertos.

# CDISR2570E
source: An error occurred during the authentication by key operation. The error is: {0}.
ko: 키 조작을 통해 인증하는 중에 오류가 발생했습니다. 오류는 {0}입니다.
pt_br: Ocorreu um erro durante a autenticação pela operação chave. O erro é: {0}.

# CDISR2590E
source: The user does not have the {0} permission for the {1} object in the {2} instance.
ko: 사용자에 {2} 인스턴스의 {1} 오브젝트에 대한 {0} 권한이 없습니다.
pt_br: O usuário não tem a permissão {0} para o objeto {1} na instância {2}.

# CDISR2596E
source: The Authentication and Authorization Service is currently busy for domain {0}.
ko: 인증 및 권한 부여 서비스가 현재 {0} 도메인에서 사용 중입니다.
pt_br: Atualmente, o Serviço de Autenticação e Autorização está ocupado para o domínio {0}.

# CDISR2597E
source: The credential or token has expired.
ko: 신임 정보 또는 토큰이 만기되었습니다.
pt_br: A credencial ou o token expirou.

# CDISR3000E
source: The application definition file cannot be interpreted.
ko: 애플리케이션 정의 파일을 해석할 수 없습니다.
pt_br: O arquivo de definição do aplicativo não pode ser interpretado.

# CDISR3008E
source: The processing element ID {0} has both isolation attributes and colocation attributes defined for it.
ko: 처리 요소 ID {0}에 격리 속성 및 동일 호스트에 배치 속성이 정의되어 있습니다.
pt_br: O ID do elemento de processamento {0} tem atributos isolation e atributos colocation definidos para ele.

# CDISR3009E
source: For the processing element ID {0}, the exlocation attributes and the collocation attributes conflict.
ko: 처리 요소 ID {0}에 대해 외부 배치 속성과 배치 속성이 충돌합니다.
pt_br: Para o ID do elemento de processamento {0}, os atributos exlocation e atributos collocation estão em conflito.

# CDISR3011E
source: The processing element ID {0} was not found in the application definition.
ko: 처리 요소 ID {0}이(가) 애플리케이션 정의에 없습니다.
pt_br: O ID do elemento de processamento {0} não foi localizado na definição do aplicativo.

# CDISR3013E
source: The specified instance does not contain hosts that can be scheduled.
ko: 지정된 인스턴스에 스케줄할 수 있는 호스트가 없습니다.
pt_br: A instância especificada não contém hosts que podem ser planejados.

# CDISR3018E
source: The operation failed because the following inPoolIndex value for hostpool {1} is not valid: {0}.
ko: 호스트 풀 {1}에 대한 inPoolIndex 값 {0}이(가) 유효하지 않기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque o valor inPoolIndex a seguir para o conjunto de hosts {1} não é válido: {0}.

# CDISR3019E
source: The operation failed because explicit host members cannot be specified for hostpool {0}.
ko: 호스트 풀 {0}에 대해 명시적 호스트 멤버를 지정할 수 없기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque os membros do host explícito não podem ser especificados para o conjunto de hosts {0}.

# CDISR3020E
source: The operation failed because the following internal property is not in the correct format: {0}.
ko: 내부 특성 {0}의 형식이 올바르지 않기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque a propriedade interna a seguir não está no formato correto: {0}.

# CDISR3021E
source: The operation failed because the following internal property is not in the correct format: {0}.
ko: 내부 특성 {0}의 형식이 올바르지 않기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque a propriedade interna a seguir não está no formato correto: {0}.

# CDISR3022E
source: The operation failed because the following host is not found: {0}.
ko: {0} 호스트를 찾을 수 없기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque o host a seguir não foi localizado: {0}.

# CDISR3023E
source: The operation failed because the following host cannot be a member of multiple exclusive hostpools: {0}.
ko: {0} 호스트는 다중 독점 호스트 풀의 멤버가 될 수 없기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque o host a seguir não pode ser um membro de múltiplos conjuntos de hosts exclusivos: {0}.

# CDISR3024E
source: The operation failed because an internal job schedule object is not in the correct format.
ko: 내부 스케줄 오브젝트의 형식이 올바르지 않기 때문에 조작이 실패했습니다.
pt_br: A operação falhou porque um objeto de planejamento de tarefa interna não está no formato correto.

# CDISR3026E
source: The processing element ID {0} cannot be moved from the {1} host to the {2} host because the processing element definition specifies that it cannot be relocated.
ko: 처리 요소 정의가 처리 요소를 재배치할 수 없도록 지정하기 때문에 처리 요소 ID {0}을(를) {1} 호스트에서 {2} 호스트로 이동할 수 없습니다.
pt_br: O ID do elemento de processamento {0} não pode ser movido do host {1} para o host {2} porque a definição do elemento de processamento especifica que ele não pode ser realocado.
