Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsAdminMessages_*.xlf
Languages: de, ja, ru, zh_cn

# CDISA5265E
source: Application bundle directory {0} could not be created on the following resource: {1}.
de: Das Anwendungsbundleverzeichnis {0} konnte in der folgenden Ressource nicht erstellt werden: {1}.
ja: 次のリソースでアプリケーション・バンドル・ディレクトリー {0} を作成できませんでした: {1}。
ru: Не удалось создать каталог комплекта приложений {0} на следующем ресурсе: {1}.
zh_cn: 无法在 {1} 资源上创建应用程序捆绑包目录 {0}。

# CDISA5266E
source: {0} is not a valid format specification. Valid formats are %Nf, %Mf and %Tf.
de: {0} ist keine gültige Formatspezifikation. Gültige Formate sind %Nf, %Mf und %Tf.
ja: {0} は有効なフォーマット指定でありません。有効なフォーマットは %Nf、%Mf、および %Tf です。
ru: {0} - это не спецификация допустимого формата. Допустимые форматы - %Nf, %Mf и %Tf.
zh_cn: {0} 是无效格式规范。有效格式为 %Nf、%Mf 和 %Tf。

# CDISA5267E
source: The {0} user is not authorized to modify the permissions on instance jobgroup: instance {2}, jobgroup {1}.
de: Der Benutzer {0} ist nicht zum Modifizieren der Berechtigungen für die folgende Instanzjobgruppe berechtigt: Instanz {2}, Jobgruppe {1}.
ja: {0} ユーザーには、次のインスタンス・ジョブ・グループでの許可を変更する権限がありません: インスタンス {2}、ジョブ・グループ {1}。
ru: Пользователю {0} не разрешено изменять разрешения для группы заданий экземпляра: экземпляр {2}, группа заданий {1}.
zh_cn: {0} 用户无权修改对以下实例作业组的许可权：实例 {2}，作业组 {1}。

# CDISA5268E
source: Embedded ZooKeeper cannot be used from a domain host installation.
de: Der integrierte ZooKeeper-Service kann nicht über eine Domänenhostinstallation verwendet werden.
ja: ドメイン・ホスト・インストール済み環境から組み込み ZooKeeper を使用することはできません。
ru: Встроенный компонент ZooKeeper нельзя использовать из установки хоста домена.
zh_cn: 无法从域主机安装使用嵌入式 ZooKeeper。

# CDISA5269E
source: No result found during LDAP user lookup.
de: Bei der LDAP-Benutzersuche wurde kein Ergebnis gefunden.
ja: LDAP ユーザー・ルックアップ時に結果が検出されませんでした。
ru: Не найдено никаких результатов при поиске пользователя LDAP.
zh_cn: 在 LDAP 用户查找期间未找到任何结果。

# CDISA5270E
source: More than one result found during LDAP user lookup.
de: Bei der LDAP-Benutzersuche wurden mehrere Ergebnisse gefunden.
ja: LDAP ユーザー・ルックアップ時に複数の結果が検出されました。
ru: При поиске пользователя LDAP найдено более одного результата.
zh_cn: 在 LDAP 用户查找期间找到多个结果。

# CDISA5271E
source: LDAP user secondary lookup query is not formatted correctly.
de: Die Abfrage für das sekundäre Lookup für LDAP-Benutzer ist nicht ordnungsgemäß formatiert.
ja: LDAP ユーザー 2 次ルックアップ照会のフォーマット設定が正しくありません。
ru: Запрос вторичного поиска пользователя LDAP неправильно сформатирован.
zh_cn: LDAP 用户辅助查找查询的格式不正确。

# CDISA5272E
source: The {0} user is not authorized to the following domain: {1}.
de: Der Benutzer {0} ist für die folgende Domäne nicht berechtigt: {1}.
ja: {0} ユーザーには、次のドメインに対する権限がありません: {1}。
ru: Пользователю {0} не разрешено работать со следующим доменом: {1}.
zh_cn: 未授权 {0} 用户使用 {1} 域。

# CDISA5273E
source: Application bundle directory {0} could not be created on the following resource: {1}. Using default path: {2}.
de: Das Anwendungsbundleverzeichnis {0} konnte in der folgenden Ressource nicht erstellt werden: {1}. Der Standardpfad wird verwendet: {2}.
ja: 次のリソースでアプリケーション・バンドル・ディレクトリー {0} を作成できませんでした: {1}。次のデフォルト・パスを使用します: {2}。
ru: Не удалось создать каталог комплекта приложений {0} на следующем ресурсе: {1}. Используется путь по умолчанию: {2}.
zh_cn: 无法在 {1} 资源上创建应用程序捆绑包目录 {0}。正在使用缺省路径 {2}。

# CDISA5274E
source: The {0} user is not authorized to manage the {1} instance for the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Verwalten der Instanz {1} für die folgende Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメインの {1} インスタンスを管理する権限がありません: {2}。
ru: Пользователю {0} не разрешено управлять экземпляром {1} для следующего домена: {2}.
zh_cn: {0} 用户无权管理 {2} 域的 {1} 实例。

# CDISA5275E
source: The {0} resource is not configured for the {1} instance in the following domain: {2}.
de: Die Ressource {0} ist nicht für die Instanz {1} in der folgenden Domäne konfiguriert: {2}.
ja: {0} リソースは次のドメイン内の {1} インスタンス用に構成されていません: {2}。
ru: Ресурс {0} не сконфигурирован для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 资源不是针对 {2} 域中的 {1} 实例配置的。

# CDISA5276E
source: The {0} service is not configured to run on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} ist nicht für die Ausführung in der folgenden Ressource konfiguriert: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: {0} サービスは次のリソース上で実行されるように構成されていません: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Служба {0} не сконфигурирована для работы на следующем ресурсе: {1}. Ресурс выделен домену {2}.
zh_cn: 未将 {0} 服务配置为在 {1} 资源上运行。该资源已分配到 {2} 域。

# CDISA5277E
source: The {0} service is not configured to run on the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} ist nicht für die Ausführung in der folgenden Ressource konfiguriert: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} サービスは次のリソース上で実行されるように構成されていません: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Служба {0} не сконфигурирована для работы на следующем ресурсе: {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 未将 {0} 服务配置为在 {1} 资源上运行。该资源已分配到 {3} 域的 {2} 实例。

# CDISA5278E
source: The {0} service failed to restart on the following resource. {1}. The resource is allocated to the following domain: {2}.
de: Der Service {0} konnte in der folgenden Ressource nicht erneut gestartet werden: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で {0} サービスの再始動に失敗しました。{1}。リソースは次のドメインに割り振られています: {2}。
ru: Не удалось перезапустить службу {0} на следующем ресурсе. {1}. Ресурс выделен домену {2}.
zh_cn: {0} 服务无法在以下资源上重新启动。{1}. 该资源已分配到 {2} 域。

# CDISA5279E
source: The {0} service failed to restart on the following resource: {1}. The resource is allocated to the {2} instance for the following domain: {3}.
de: Der Service {0} konnte in der folgenden Ressource nicht erneut gestartet werden: {1}. Die Ressource ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: 次のリソース上で {0} サービスの再始動に失敗しました: {1}。リソースは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Не удалось перезапустить службу {0} на ресурсе {1}. Ресурс выделен экземпляру {2} для домена {3}.
zh_cn: 无法在 {1} 资源上重新启动 {0} 服务。该资源已分配到 {3} 域的 {2} 实例。

# CDISA5280E
source: The controller service failed to restart on the following resource: {0}. The resource is allocated to the following domain: {1}. The resource is configured as a system service but is not currently running.
de: Der Controller-Service konnte in der folgenden Ressource nicht erneut gestartet werden: {0}. Die Ressource ist der folgenden Domäne zugeordnet: {1}. Die Ressource ist als Systemservice konfiguriert, wird aber zurzeit nicht ausgeführt.
ja: 次のリソースでコントローラー・サービスの再始動に失敗しました: {0}。リソースは次のドメインに割り振られています: {1}。リソースはシステム・サービスとして構成されていますが、現在実行されていません。
ru: Не удалось перезапустить службу контроллера на ресурсе {0}. Ресурс выделен домену {1}. Ресурс сконфигурирован как системная служба, но сейчас не работает.
zh_cn: 无法在 {0} 资源上重新启动控制器服务。该资源已分配到 {1} 域。该资源已配置为系统服务，但当前未处于运行状态。

# CDISA5281E
source: Cannot change permissions for job secured object ''{0}''.
de: Die Berechtigungen für das gesicherte Jobobjekt ''{0}'' können nicht geändert werden.
ja: ジョブ保護オブジェクト「{0}」の許可を変更できません。
ru: Невозможно изменить разрешения для защищенного объекта задания ''{0}''.
zh_cn: 无法更改作业保护的对象“{0}”的许可权。

# CDISA5282E
source: The {0} domain role is a role defined by the system and must have at least one user.
de: Die Domänenrolle {0} ist eine vom System definierte Rolle und muss mindestens einen Benutzer haben.
ja: {0} ドメイン・ロールはシステムで定義されているロールであるため、1 人以上のユーザーが含まれている必要があります。
ru: Роль домена {0} - это роль, заданная системой, и у нее должен быть хотя бы один пользователь.
zh_cn: {0} 域角色是系统定义的角色，它必须至少有一个用户。

# CDISA5283E
source: An operation listener with identifier {0} does not exist.
de: Ein Operationslistener mit der Kennung {0} ist nicht vorhanden.
ja: ID が {0} の操作リスナーは存在しません。
ru: Приемник операций с идентификатором {0} не существует.
zh_cn: 标识为 {0} 的操作侦听器不存在。

# CDISA5284E
source: The following bundle file name does not have the correct format: {0}.
de: Der folgende Bundledateiname hat nicht das korrekte Format: {0}.
ja: 次のバンドル・ファイル名のフォーマットは正しくありません: {0}。
ru: У указанного ниже имени файла комплекта неправильный формат: {0}.
zh_cn: 以下捆绑包文件名的格式不正确：{0}。

# CDISA5285E
source: The following application identifier does not exist: {0}.
de: Die folgende Anwendungskennung ist nicht vorhanden: {0}.
ja: 次のアプリケーション ID は存在しません: {0}。
ru: Следующий идентификатор приложения не существует: {0}.
zh_cn: 应用程序标识 {0} 不存在。

# CDISA5286E
source: An unexpected error occurred while trying to register the managed bean for the following job: {0}.
de: Beim Versuch, die Managed Bean für den folgenden Job zu registrieren, ist ein unerwarteter Fehler aufgetreten: {0}.
ja: 次のジョブの Managed Bean を登録しようとしているときに予期しないエラーが発生しました: {0}。
ru: Произошла неожиданная ошибка при попытке зарегистрировать управляемый компонент bean для следующего задания: {0}.
zh_cn: 尝试为 {0} 作业注册受管 Bean 时发生意外错误。

# CDISA5287E
source: Failed to register {0} of {1} jobs.
de: Die Registrierung von {0} von {1} Jobs ist fehlgeschlagen.
ja: {1} 個のジョブのうち {0} 個の登録に失敗しました。
ru: Не удалось зарегистрировать задания в количестве {0} из {1}.
zh_cn: 无法注册 {0} 个（共 {1} 个）作业。

# CDISA5288E
source: An unexpected error occurred while accessing the view service.
de: Beim Zugriff auf den Anzeigeservice ist ein unerwarteter Fehler aufgetreten.
ja: ビュー・サービスへのアクセス中に予期しないエラーが発生しました。
ru: Произошла неожиданная ошибка при получении доступа к службе представлений.
zh_cn: 访问视图服务时发生意外错误。

# CDISA5289E
source: The following job could not be found: {0}.
de: Der folgende Job konnte nicht gefunden werden: {0}.
ja: 次のジョブが見つかりませんでした: {0}。
ru: Не удалось найти следующее задание: {0}.
zh_cn: 找不到作业 {0}。

# CDISA5290E
source: A value must be specified for the following parameter: {0}.
de: Für den folgenden Parameter muss ein Wert angegeben werden: {0}.
ja: 次のパラメーターに値を指定する必要があります: {0}。
ru: Должно быть задано значение для следующего параметра: {0}.
zh_cn: 必须为 {0} 参数指定值。

# CDISA5291E
source: The following processing element could not be found: {0}.
de: Das folgende Verarbeitungselement konnte nicht gefunden werden: {0}.
ja: 次の処理要素が見つかりませんでした: {0}。
ru: Не удалось найти следующий элемент обработки: {0}.
zh_cn: 找不到处理元素 {0}。

# CDISA5292E
source: The {0} user is not authorized to add jobs for the {1} instance in the following domain: {2}.
de: Der Benutzer {0} ist nicht zum Hinzufügen von Jobs für die Instanz {1} in der folgenden Domäne berechtigt: {2}.
ja: {0} ユーザーには、次のドメイン内の {1} インスタンスのジョブを追加する権限がありません: {2}。
ru: Пользователю {0} не разрешено добавлять задания для экземпляра {1} в следующем домене: {2}.
zh_cn: {0} 用户无权为 {2} 域中的 {1} 实例添加作业。

# CDISA5293E
source: You must be the installation owner or user root to update the edition license.
de: Zum Aktualisieren der Editionslizenz müssen Sie entweder der Installationseigner oder der Rootbenutzer sein.
ja: エディション・ライセンスを更新するには、インストール所有者か root ユーザーでなければなりません。
ru: Чтобы обновить лицензию на выпуск, нужно быть владельцем установки или пользователем root.
zh_cn: 您必须是安装所有者或 root 用户才能更新修订版许可证。

# CDISA5294E
source: The current edition cannot be updated to the IBM Streams editon. The current edition is: {0}.
de: Die aktuelle Edition kann nicht auf die IBM Streams-Edition aktualisiert werden. Aktuelle Edition: {0}.
ja: 現在のエディションを IBM Streams エディションに更新できません。現在のエディション: {0}。
ru: Текущий выпуск нельзя обновить до выпуска IBM Streams. Текущий выпуск: {0}.
zh_cn: 无法将当前修订版更新为 IBM Streams 修订版。当前修订版为 {0}。

# CDISA5295E
source: The edition cannot be updated.
de: Die Edition kann nicht aktualisiert werden.
ja: エディションを更新できません。
ru: Обновить выпуск невозможно.
zh_cn: 无法更新此修订版。

# CDISA5296E
source: The installation is missing the {0} edition tar file. The edition cannot be updated.
de: Die Editions-TAR-Datei {0} für die Installation fehlt. Die Edition kann nicht aktualisiert werden.
ja: インストール済み環境で {0} エディション tar ファイルが欠落しています。エディションを更新できません。
ru: В установке отсутствует файл tar выпуска {0}. Обновить выпуск невозможно.
zh_cn: 安装缺少修订版 tar 文件 {0}。无法更新此修订版。

# CDISA5297E
source: The update license failed because the existing edition files cannot be removed.
de: Die Lizenzaktualisierung ist fehlgeschlagen, da die vorhandenen Editionsdateien nicht entfernt werden können.
ja: 既存のエディション・ファイルを削除できないため、ライセンスの更新が失敗しました。
ru: Обновление лицензии завершилось неудачно, так как не удалось удалить существующие файлы выпуска.
zh_cn: 更新许可证失败，这是因为无法移除现有的修订版文件。

# CDISA5298E
source: Job registration did not complete successfully
de: Die Jobregistrierung wurde nicht erfolgreich abgeschlossen.
ja: ジョブの登録が正常に完了しませんでした
ru: Регистрация заданий завершилась неудачно
zh_cn: 作业注册未成功完成

# CDISA5299E
source: The operation can not be performed on {0}. The resource is storing active application bundle resources for instance {1} in domain {2} and there are no backups.
de: Die Operation kann in {0} nicht ausgeführt werden. Die Ressource speichert aktive Anwendungsbundleressourcen für die Instanz {1} in der Domäne {2} und es sind keine Backups vorhanden.
ja: 操作を {0} で実行できません。リソースは、ドメイン {2} 内のインスタンス {1} のアクティブ・アプリケーション・バンドル・リソースを保管しており、バックアップがありません。
ru: Операцию невозможно выполнить на {0}. На ресурсе хранятся ресурсы пакета активного приложения для экземпляра {1} в домене {2}, и резервных копий нет.
zh_cn: 无法在 {0} 上执行此操作。该资源正在存储域 {2} 中的实例 {1} 的活动应用程序捆绑包资源，并且不存在备份。

# CDISA5300E
source: The URL {0} is not a valid LDAP URL.
de: Die URL {0} ist keine gültige LDAP-URL.
ja: URL {0} は有効な LDAP URL でありません。
ru: URL {0} не является действительным URL LDAP.
zh_cn: URL {0} 是无效 LDAP URL。

# CDISA5301E
source: The specified value is not valid for property {0}. {1}
de: Der angegebene Wert ist für die Eigenschaft {0} nicht gültig. {1}
ja: プロパティー {0} に指定された値は無効です。{1}
ru: Указанное значение является недопустимым для свойства {0}. {1}
zh_cn: 指定的值对于属性 {0} 而言无效。{1}

# CDISA5302E
source: An error occurred while copying the new version of IBM Streams software on this resource. The source path of the software is: {0}.
de: Beim Kopieren der neuen Version der IBM Streams-Software in dieser Ressource ist ein Fehler aufgetreten. Quellenpfad der Software: {0}.
ja: このリソースでの IBM Streams ソフトウェアの新規バージョンのコピー中にエラーが発生しました。ソフトウェアのソース・パス: {0}。
ru: Произошла ошибка при копировании новой версии программы IBM Streams на этот ресурс. Исходный путь программы: {0}.
zh_cn: 在此资源上复制 IBM Streams 软件的新版本时发生错误。此软件的源路径为：{0}。

# CDISA5303E
source: The {0} domain did not upgrade to version: {1}. The current resource must be part of the domain.
de: Für die Domäne {0} wurde kein Upgrade auf Version {1} durchgeführt. Die aktuelle Ressource muss Teil der Domäne sein.
ja: {0} ドメインは次のバージョンにアップグレードされませんでした: {1}。現在のリソースがこのドメインに属している必要があります。
ru: Домен {0} не обновлен до версии {1}. Текущий ресурс должен быть частью домена.
zh_cn: {0} 域未升级到 V{1}。当前资源必须属于该域。

# CDISA5304E
source: Failed to restore views for instance {0} domain {1}. Cause: {2}
de: Ansichten für Instanz {0}, Domäne {1} konnten nicht wiederhergestellt werden. Ursache: {2}
ja: インスタンス {0} (ドメイン {1}) のビューの復元に失敗しました。原因: {2}
ru: Не удалось восстановить представления для экземпляра {0} домена {1}. Причина: {2}
zh_cn: 无法复原域 {1} 中的实例 {0} 的视图。原因：{2}

# CDISA5305E
source: ZooKeeper was not stopped on {0} since there are active domains.
de: ZooKeeper wurde für {0} nicht gestoppt, da es aktive Domänen gibt.
ja: アクティブ・ドメインがあるため、ZooKeeper は {0} で停止されませんでした。
ru: Компонент ZooKeeper не остановлен на {0}, так как есть активные домены.
zh_cn: 未根据 {0} 停止 ZooKeeper，这是因为存在活动的域。

# CDISA5306E
source: ZooKeeper was not stopped on {0} since it is being used by other clients.
de: ZooKeeper wurde für {0} nicht gestoppt, da ZooKeeper durch andere Clients verwendet wird.
ja: 他のクライアントによって使用されているため、ZooKeeper は {0} で停止されませんでした。
ru: Компонент ZooKeeper не остановлен на {0}, так как он используется другими клиентами.
zh_cn: 未根据 {0} 停止 ZooKeeper，这是因为它正在由其他客户机使用。

# CDISA5307E
source: ZooKeeper was not started on {0} since client port {1} is not available.
de: ZooKeeper wurde für {0} nicht gestartet, da Client-Port {1} nicht verfügbar ist.
ja: クライアント・ポート {1} が使用可能でないため、ZooKeeper は {0} で開始されませんでした。
ru: Компонент ZooKeeper не запущен на {0}, так как порт клиента {1} недоступен.
zh_cn: 未根据 {0} 启动 ZooKeeper，这是因为客户机端口 {1} 不可用。

# CDISA5308E
source: ZooKeeper was not started on {0} since monitor port {1} is not available.
de: ZooKeeper wurde für {0} nicht gestartet, da der Überwachungsport {1} nicht verfügbar ist.
ja: モニター・ポート {1} が使用可能でないため、ZooKeeper は {0} で開始されませんでした。
ru: Компонент ZooKeeper не запущен на {0}, так как порт монитора {1} недоступен.
zh_cn: 未根据 {0} 启动 ZooKeeper，这是因为监视器端口 {1} 不可用。

# CDISA5309E
source: ZooKeeper was not started on {0} since it is running on a different host {1}. The current host is {2}.
de: ZooKeeper wurde für {0} nicht gestartet, da ZooKeeper auf einem anderen Host {1} ausgeführt wird. Aktueller Host: {2}.
ja: 異なるホスト {1} で実行されているため、ZooKeeper は {0} で開始されませんでした。現在のホスト: {2}。
ru: Компонент ZooKeeper не запущен на {0}, так как он работает на другом хосте {1}. Текущий хост - {2}.
zh_cn: 未根据 {0} 启动 ZooKeeper，这是因为它正在另一个主机 {1} 上运行。当前主机为 {2}。

# CDISA5310E
source: The {0} managed bean cannot be unregistered.
de: Die Registrierung der Managed Bean {0} kann nicht zurückgenommen werden.
ja: {0} Managed Bean を登録抹消できません。
ru: Не удается дерегистрировать управляемый компонент bean {0}.
zh_cn: 无法注销受管 Bean {0}。

# CDISA5311E
source: The {0} user is not authorized to access the job associated with the following view: {1}. The job is allocated to the {2} instance for the following domain: {3}.
de: Der Benutzer {0} ist nicht zum Zugriff auf den der folgenden Ansicht zugeordneten Job berechtigt: {1}. Der Job ist der Instanz {2} für die folgende Domäne zugeordnet: {3}.
ja: {0} ユーザーには、次のビューに関連付けられているジョブにアクセスする権限がありません: {1}。ジョブは次のドメインの {2} インスタンスに割り振られています: {3}。
ru: Пользователю {0} не разрешено получать доступ к заданию со следующим представлением: {1}. Задание выделено экземпляру {2} для следующего домена {3}.
zh_cn: {0} 用户无权访问与 {1} 视图相关联的作业。该作业已分配到 {3} 域的 {2} 实例。

# CDISA5312E
source: LDAP user distinguished name (DN) value is not formatted correctly.
de: Der Wer für den Distinguished Name (DN) für den LDAP-Benutzer ist nicht ordnungsgemäß formatiert.
ja: LDAP ユーザー識別名 (DN) 値のフォーマット設定が正しくありません。
ru: Значение отличительного имени (DN) пользователя LDAP сформатировано неправильно.
zh_cn: LDAP 用户专有名称 (DN) 值的格式不正确。

# CDISA5313E
source: The {0} system service failed to do repairs on the following resource: {1}. The resource is allocated to the following domain: {2}.
de: Der Systemservice {0} konnte keine Reparaturen an der folgenden Ressource vornehmen: {1}. Die Ressource ist der folgenden Domäne zugeordnet: {2}.
ja: 次のリソース上で {0} システム・サービスが修復の実行に失敗しました: {1}。リソースは次のドメインに割り振られています: {2}。
ru: Системная служба {0} не смогла выполнить исправления на следующем ресурсе {1}. Ресурс выделен домену {2}.
zh_cn: {0} 系统服务无法在 {1} 资源上执行复原。该资源已分配到 {2} 域。

# CDISA5314E
source: Internal error - unable to retrieve definition for job {0} in instance {1} and domain {2}.
de: Interner Fehler - die Definition für den Job {0} in Instanz {1} und Domäne {2} kann nicht abgerufen werden.
ja: 内部エラー - インスタンス {1} およびドメイン {2} のジョブ {0} の定義を取得できません。
ru: Внутренняя ошибка - не удается получить определение для задания {0} в экземпляре {1} и домене {2}.
zh_cn: 内部错误 - 无法检索域 {2} 实例 {1} 中的作业 {0} 的定义。

# CDISA5315I
source: User {0} successfully logged into domain {1}.
de: Der Benutzer {0} hat sich erfolgreich an der Domäne {1} angemeldet.
ja: ユーザー {0} がドメイン {1} に正常にログインしました。
ru: Пользователь {0} успешно вошел в домен {1}.
zh_cn: 用户 {0} 已成功登录到域 {1}。

# CDISA5316E
source: User {0} failed to log into domain {1} due to bad credential.
de: Der Benutzer {0} konnte sich aufgrund eines falschen Berechtigungsnachweises nicht an der Domäne {1} anmelden.
ja: 資格情報が正しくないため、ユーザー {0} がドメイン {1} へのログインに失敗しました。
ru: Пользователь {0} не вошел в домен {1} из-за неправильных учетных данных.
zh_cn: 由于凭证错误，用户 {0} 无法登录到域 {1}。

# CDISA5317E
source: User {0} not allowed to log into domain {1}.
de: Der Benutzer {0} hat keine Berechtigung zur Anmeldung an der Domäne {1}.
ja: ユーザー {0} は、ドメイン {1} へのログインが許可されません。
ru: Пользователю {0} не разрешено входить в домен {1}.
zh_cn: 不允许用户 {0} 登录到域 {1}。

# CDISA5318E
source: User {0} failed to log into domain {1} due to unexpected error.
de: Der Benutzer {0} konnte sich aufgrund eines unerwarteten Fehlers nicht an der Domäne {1} anmelden.
ja: 予期しないエラーのため、ユーザー {0} がドメイン {1} へのログインに失敗しました。
ru: Пользователь {0} не вошел в домен {1} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法登录到域 {1}。

# CDISA5319I
source: User {0} successfully logged out of domain {1}.
de: Der Benutzer {0} hat sich erfolgreich von der Domäne {1} abgemeldet.
ja: ユーザー {0} がドメイン {1} から正常にログアウトしました。
ru: Пользователь {0} успешно вышел из домена {1}.
zh_cn: 用户 {0} 已从域 {1} 成功注销。

# CDISA5320E
source: User {0} failed to log out of domain {1} due to unexpected error.
de: Der Benutzer {0} konnte sich aufgrund eines unerwarteten Fehlers nicht von der Domäne {1} abmelden.
ja: 予期しないエラーのため、ユーザー {0} がドメイン {1} からのログアウトに失敗しました。
ru: Пользователь {0} не вышел из домена {1} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法从域 {1} 注销。

# CDISA5321I
source: Certificate user {0} DN={1} logged into domain {2}.
de: Der Zertifikatsbenutzer {0} DN={1} hat sich an der Domäne {2} angemeldet.
ja: 証明書ユーザー {0} DN={1} がドメイン {2} にログインしました。
ru: Пользователь сертификата {0} DN = {1} вошел в домен {2}.
zh_cn: 证书用户 {0}（DN 为 {1}）已登录到域 {2}。

# CDISA5322E
source: Certificate user {0} failed to log into domain {1}.
de: Der Zertifikatsbenutzer {0} konnte sich nicht an der Domäne {1} anmelden.
ja: 証明書ユーザー {0} がドメイン {1} へのログインに失敗しました。
ru: Пользователю сертификата {0} не удалось войти в домен {1}.
zh_cn: 证书用户 {0} 无法登录到域 {1}。

# CDISA5323E
source: Certificate user {0} failed to log into domain {1} due to unexpected error.
de: Der Zertifikatsbenutzer {0} konnte sich aufgrund eines unerwarteten Fehlers nicht an der Domäne {1} anmelden.
ja: 予期しないエラーのため、証明書ユーザー {0} がドメイン {1} へのログインに失敗しました。
ru: Пользователю сертификата {0} не удалось войти в домен {1} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，证书用户 {0} 无法登录到域 {1}。

# CDISA5324I
source: User {0} has removed security object {1} from domain {2}.
de: Der Benutzer {0} hat das Sicherheitsobjekt {1} aus der Domäne {2} entfernt.
ja: ユーザー {0} がセキュリティー・オブジェクト {1} をドメイン {2} から削除しました。
ru: Пользователь {0} удалил объект защиты {1} из домена {2}.
zh_cn: 用户 {0} 已从域 {2} 中移除安全对象 {1}。

# CDISA5325E
source: User {0} failed to remove security object {1} from domain {2} due to unexpected error.
de: Der Benutzer {0} konnte das Sicherheitsobjekt {1} aufgrund eines unerwarteten Fehlers nicht aus der Domäne {2} entfernen.
ja: 予期しないエラーのため、ユーザー {0} がドメイン {2} からのセキュリティー・オブジェクト {1} の削除に失敗しました。
ru: Пользователю {0} не удалось удалить объект защиты {1} из домена {2} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法从域 {2} 中移除安全对象 {1}。

# CDISA5326I
source: User {0} has removed security object {1} from domain {2} instance {3}.
de: Der Benutzer {0} hat das Sicherheitsobjekt {1} aus der Domäne {2} und der Instanz {3} entfernt.
ja: ユーザー {0} がセキュリティー・オブジェクト {1} をドメイン {2}、インスタンス {3} から削除しました。
ru: Пользователь {0} удалил объект защиты {1} из экземпляра {3} домена {2}.
zh_cn: 用户 {0} 已从域 {2} 实例 {3} 中移除安全对象 {1}。

# CDISA5327E
source: User {0} failed to remove security object {1} from domain {2} instance {3} due to unexpected error.
de: Der Benutzer {0} konnte das Sicherheitsobjekt {1} aus der Domäne {2} und der Instanz {3} aufgrund eines unerwarteten Fehlers nicht entfernen.
ja: 予期しないエラーのため、ユーザー {0} がドメイン {2}、インスタンス {3} からのセキュリティー・オブジェクト {1} の削除に失敗しました。
ru: Пользователю {0} не удалось удалить объект защиты {1} из экземпляра {3} домена {2} из-за неожиданной ошибки.
zh_cn: 由于发生意外错误，用户 {0} 无法从域 {2} 实例 {3} 中移除安全对象 {1}。
