Repository: IBMStreams/OSStreams
Catalog: src/messages/StreamsRuntimeMessages_*.xlf
Languages: ko, pt_br

# CDISR6012E
source: The {0} resource persistence manager is not connected.
ko: {0} 자원 지속성 관리자가 연결되지 않았습니다.
pt_br: O gerenciador de persistência de recurso {0} não está conectado.

# CDISR6013E
source: The {0} option was not supplied. This command line option is required.
ko: {0} 옵션을 입력하지 않았습니다. 이 명령행 옵션은 필수입니다.
pt_br: A opção {0} não foi fornecida. Essa opção da linha de comandos é necessária.

# CDISR6014E
source: The {0} user can not access the following configuration file: {1}.
ko: {0} 사용자가 구성 파일 {1}에 액세스할 수 없습니다.
pt_br: O usuário {0} não pode acessar o arquivo de configuração a seguir: {1}.

# CDISR6015E
source: There are no {0} resource managers registered for all domains in the zookeeper ensemble.
ko: Zookeeper 앙상블의 모든 도메인에 등록된 {0} 자원 관리자가 없습니다.
pt_br: Não há gerenciadores de recursos {0} registrados para todos os domínios na combinação zookeeper.

# CDISR6016E
source: There are no {0} resource managers registered for the following domain: {1}.
ko: {1} 도메인에 등록된 {0} 자원 관리자가 없습니다.
pt_br: Não há gerenciadores de recursos {0} registrados para o domínio a seguir: {1}.

# CDISR6017E
source: There are no {0} resource managers registered in the zookeeper ensemble.
ko: Zookeeper 앙상블에 등록된 {0} 자원 관리자가 없습니다.
pt_br: Não há gerenciadores de recursos {0} registrados na combinação zookeeper.

# CDISR6018I
source: Stopping the {0} resource manager on host={1} port={2} pid={3}.
ko: 호스트={1} 포트={2} pid={3}에서 {0} 자원 관리자를 중지하는 중입니다.
pt_br: Parando o gerenciador de recursos {0} no host={1} porta={2} pid={3}.

# CDISR6019I
source: The {0} resource manager stopped successfully on host={1} port={2} pid={3}.
ko: 호스트={1} 포트={2} pid={3}에서 {0} 자원 관리자를 중지했습니다.
pt_br: O gerenciador de recursos {0} foi interrompido com sucesso no host={1} porta={2} pid={3}.

# CDISR6020E
source: The {0} resource manager is actively managing resources. Stop the domains that are currently using resources or use the --force option.
ko: {0} 자원 관리자가 활발하게 자원을 관리하는 중입니다. 현재 자원을 사용 중인 도메인을 중지하거나 --force 옵션을 사용하십시오.
pt_br: O gerenciador de recursos {0} está gerenciando recursos ativamente. Pare os domínios que estão usando recursos atualmente ou use a opção --force.

# CDISR6021E
source: The {0} property must be specified in the following configuration file: {1}.
ko: {0} 특성을 구성 파일 {1}에 지정해야 합니다.
pt_br: A propriedade {0} deve ser especificada no arquivo de configuração a seguir: {1}.

# CDISR6022E
source: The {0} option can not be specified at the same time as the {1} option.
ko: {0} 옵션을 {1} 옵션과 동시에 지정할 수 없습니다.
pt_br: A opção {0} não pode ser especificada ao mesmo tempo que a opção {1}.

# CDISR6023E
source: The {0} resource manager is not available for the following domain: {1}.
ko: {1} 도메인에서 {0} 자원 관리자가 사용 불가능합니다.
pt_br: O gerenciador de recursos {0} não está disponível para o domínio a seguir: {1}.

# CDISR6024E
source: The {0} value for the {1} property is not supported. The property is specified in the following configuration file: {2}.
ko: {1} 특성의 {0} 값이 지원되지 않습니다. 구성 파일 {2}에 특성을 지정했습니다.
pt_br: O valor {0} para a propriedade {1} não é suportado. A propriedade é especificada no arquivo de configuração a seguir: {2}.

# CDISR6025I
source: The {0} resource manager has been submitted as a background process. Use the ''{1}'' command to view process information.
ko: {0} 자원 관리자가 백그라운드 프로세스로 제출되었습니다. 프로세스 정보를 보려면 ''{1}'' 명령을 사용하십시오.
pt_br: O gerenciador de recursos {0} foi enviado como um processo de segundo plano. Use o comando ''{1}'' para visualizar informações do processo.

# CDISR6026E
source: The {0} tag attribute is incompatible for the following tag definitions: {1}.
ko: {0} 태그 속성이 {1} 태그 정의와 호환되지 않습니다.
pt_br: O atributo de tag {0} é incompatível para as seguintes definições de tag: {1}.

# CDISR6027E
source: The master resource could not be allocated for the following domain: {0}.
ko: {0} 도메인의 경우 마스터 자원을 할당할 수 없습니다.
pt_br: O recurso principal não pôde ser alocado para o domínio a seguir: {0}.

# CDISR6028E
source: An unexpected error occurred stopping the following resource manager: {0}. Error is: {1}.
ko: 자원 관리자 {0}을(를) 중지하는 중에 예기치 않은 오류가 발생했습니다. 오류는 {1}입니다.
pt_br: Ocorreu um erro inesperado ao parar o gerenciador de recursos a seguir: {0}. O erro é: {1}.

# CDISR6101E
source: The following consumer does not exist in IBM Spectrum Symphony: {0}.
ko: IBM Spectrum Symphony에 {0} 이용자가 없습니다.
pt_br: O consumidor a seguir não existe no IBM Spectrum Symphony: {0}.

# CDISR6102E
source: The following resource group does not exist in IBM Spectrum Symphony: {0}.
ko: IBM Spectrum Symphony에 자원 그룹 {0}이(가) 없습니다.
pt_br: O grupo de recursos a seguir não existe no IBM Spectrum Symphony: {0}.

# CDISR6103E
source: The ''{0}'' consumer is not authorized to the following resource group in IBM Spectrum Symphony: {1}.
ko: ''{0}'' 이용자에게 IBM Spectrum Symphony의 자원 그룹 {1}에 대한 권한이 부여되지 않았습니다.
pt_br: O consumidor ''{0}'' não está autorizado para o grupo de recursos a seguir no IBM Spectrum Symphony: {1}.

# CDISR6104E
source: The following tag definitions do not have any resource groups in common: {0}.
ko: 태그 정의 {0}에 공통된 자원 그룹이 없습니다.
pt_br: As definições de tag a seguir não têm nenhum grupo de recursos em comum: {0}.

# CDISR6200E
source: An error occurred allocating the master resource.
ko: 마스터 자원을 할당하는 중에 오류가 발생했습니다.
pt_br: Ocorreu um erro ao alocar o recurso principal.

# CDISR6201E
source: The following container identifier could not be located: {0}.
ko: 컨테이너 ID {0}을(를) 찾을 수 없습니다.
pt_br: O identificador de contêiner a seguir não pôde ser localizado: {0}.

# CDISR6202E
source: A resource request could not be found for the following container: {0}.
ko: {0} 컨테이너에 대한 자원 요청을 찾을 수 없습니다.
pt_br: Uma solicitação de recurso não pôde ser localizada para o contêiner a seguir: {0}.

# CDISR6203E
source: The following property must be specified in the configuration file: {0}.
ko: 구성 파일에 {0} 특성을 지정해야 합니다.
pt_br: A propriedade a seguir deve ser especificada no arquivo de configuração: {0}.

# CDISR6204E
source: Can not locate YARN_APPLICATION_CLASSPATH. Ensure a value has been set in the Yarn configuration.
ko: YARN_APPLICATION_CLASSPATH를 찾을 수 없습니다. Yarn 구성에 값이 설정되어 있는지 확인하십시오.
pt_br: Não é possível localizar YARN_APPLICATION_CLASSPATH. Assegure-se de que um valor tenha sido definido na configuração Yarn.
