Repository: IBMStreams/OSStreams
Catalog: src/java/spl/com.ibm.streams.spl.messages/src/main/xlf/general/StreamsSPLJavaMessages_*.xlf
Languages: de, fr, ja, ko

# CDISR5587E
source: Expected a binary operator on the stack for {0}
de: Binäroperator im Stack für {0} erwartet
fr: Un opérateur binaire est attendu sur la pile pour {0}
ja: {0} のスタックに 2 項オペレーターを予期しました
ko: {0}에 대한 스택에서 이항 연산자를 기대했습니다.

# CDISR5588E
source: Expected an expression on the stack for {0}
de: Ausdruck im Stack für {0} erwartet
fr: Une expression est attendue sur la pile pour {0}
ja: {0} のスタックに式を予期しました
ko: {0}에 대한 스택에서 표현식을 기대했습니다.

# CDISR5589E
source: Unrecognized operator; expected {0}, found: {1}
de: Nicht erkannter Operator; {0} erwartet, gefunden: {1}
fr: Opérateur non reconnu ; attendu : {0}, trouvé : {1}
ja: 認識されないオペレーター。予期: {0}、検出: {1}
ko: 인식할 수 없는 연산자입니다. {0}을(를) 기대했으나 다음 항목을 발견했습니다: {1}.

# CDISR5590E
source: No identifier, value or nested expression found when parsing primary expression
de: Keine Kennung, kein Wert oder kein verschachtelter Ausdruck beim Parsing des Primärausdrucks gefunden
fr: Aucun identificateur, aucune valeur, aucune expression imbriquée trouvés lors de l''analyse syntaxique de l''expression primaire
ja: 1 次式を構文解析中に ID、値、およびネストされた式が見つかりませんでした
ko: 기본 표현식을 구문 분석할 때 ID, 값 또는 중첩된 표현식을 찾지 못했습니다.

# CDISR5591E
source: Set state to MAXIMUM_RESET_ATTEMPTS_REACHED for region {0}.
de: Status auf MAXIMUM_RESET_ATTEMPTS_REACHED für Region {0} gesetzt.
fr: Affecter MAXIMUM_RESET_ATTEMPTS_REACHED à l''état pour la région {0}.
ja: 領域 {0} の状態が MAXIMUM_RESET_ATTEMPTS_REACHED に設定されました。
ko: 영역 {0}의 상태를 MAXIMUM_RESET_ATTEMPTS_REACHED로 설정합니다.

# CDISR5591T
source: -c, --log-to-stderr Output trace messages to standard error. The default is standard output.
de: -c, --log-to-stderr Tracenachrichten in Standard-Fehlerausgabe ausgeben. Der Standardwert ist die Standardausgabe.
fr: -c, --log-to-stderr Sortie des messages trace en erreur standard. La valeur par défaut est Sortie standard.
ja: -c, --log-to-stderr トレース・メッセージを標準エラーに出力します。デフォルトは標準出力です。
ko: -c, --log-to-stderr 표준 오류에 추적 메시지를 출력합니다. 기본값은 표준 출력입니다.

# CDISR5592I
source: -h, --help Get (this) usage information.
de: -h, --help (Diese) Syntaxinformationen abrufen.
fr: -h, --help Obtenir des informations sur cette syntaxe.
ja: -h, --help 使用法情報 (この情報) を取得します。
ko: -h, --help 사용법 정보를 가져옵니다.

# CDISR5593T
source: -d, --data-directory=VALUE Specify a data directory for this application to use.
de: -d, --data-directory=WERT Datenverzeichnis zur Verwendung durch diese Anwendung angeben.
fr: -d, --data-directory=VALUE Indiquer un répertoire de données que cette application devra utiliser.
ja: -d, --data-directory=VALUE このアプリケーションに使用するデータ・ディレクトリーを指定します。
ko: -d, --data-directory=VALUE 이 애플리케이션이 사용할 데이터 디렉토리를 지정합니다.

# CDISR5594T
source: -e, --execution-directory=VALUE Specify the root directory the standalone application bundle should be executed from.
de: -e, --execution-directory=WERT Stammverzeichnis für die Ausführung des eigenständigen Anwendungsbundles angeben.
fr: -e, --execution-directory=VALUE Indiquer le répertoire racine à partir duquel le bundle d''applications autonomes doit être exécuté.
ja: -e, --execution-directory=VALUE スタンドアロン・アプリケーション・バンドルの実行元のルート・ディレクトリーを指定します。
ko: -e, --execution-directory=VALUE 독립형 애플리케이션 번들을 실행할 루트 디렉토리를 지정합니다.

# CDISR5595T
source: -g, --debug=VALUE Run the standalone executable under the specified debugger.
de: -g, --debug=WERT Eigenständige ausführbare Datei unter dem angegebenen Debugger ausführen.
fr: -g, --debug=VALUE Exécuter l''exécutable autonome sous le débogueur spécifié.
ja: -g, --debug=VALUE 指定されたデバッガーの下でスタンドアロン実行可能ファイルを実行します。
ko: -g, --debug=VALUE 지정된 디버거에서 독립형 실행 파일을 실행합니다.

# CDISR5596T
source: -k, --kill-after=VALUE Shut down the application after N seconds where N is a positive floating point number.
de: -k, --kill-after=WERT Anwendung nach N Sekunden beenden, wobei N eine positive Gleitkommazahl ist.
fr: -k, --kill-after=VALUE Arrêter l''application au bout de N secondes, N étant un nombre en virgule flottante positif.
ja: -k, --kill-after=VALUE N 秒後にアプリケーションをシャットダウンします (N は正の浮動小数点数です)。
ko: -k, --kill-after=VALUE N초 후 애플리케이션을 종료합니다. 여기서 N은 부동 소수점으로 표현된 양수입니다.

# CDISR5597T
source: -l, --log-level=INT Log level: 0 - ERROR, 1 - WARN, 2 - INFO.
de: -l, --log-level=INT Protokollebene: 0 - FEHLER, 1 - WARNUNG, 2 - INFO.
fr: -l, --log-level=INT Niveau de journalisation : 0 - ERREUR, 1 - AVERT, 2 - INFO.
ja: -l, --log-level=INT ログ・レベル: 0 - エラー、1 - 警告、2 - 通知。
ko: -l, --log-level=INT 로그 레벨: 0 - 오류, 1 - 경고, 2 - 정보.

# CDISR5598T
source: -t, --trace-level=INT Trace level: 0 - OFF, 1 - ERROR, 2 - WARN, 3 - INFO, 4 - DEBUG, 5 - TRACE.
de: -t, --trace-level=INT Tracestufe: 0 - AUS, 1 - FEHLER, 2 - WARNUNG, 3 - INFO, 4 - DEBUG, 5 - TRACE.
fr: -t, --trace-level=INT Niveau de trace : 0 - HF, 1 - ERREUR, 2 - AVERT, 3 - INFO, 4 - DEBOG, 5 - TRACE.
ja: -t, --trace-level=INT トレース・レベル: 0 - オフ、1 - エラー、2 - 警告、3 - 通知、4 - デバッグ、5 - トレース。
ko: -t, --trace-level=INT 추적 레벨: 0 - 해제, 1 - 오류, 2 - 경고, 3 - 정보, 4 - 디버그, 5 - 추적.

# CDISR5599E
source: Temporary directory {0} was not fully removed.
de: Das temporäre Verzeichnis {0} wurde nicht vollständig entfernt.
fr: Le répertoire temporaire {0} n''a pas été retiré complètement.
ja: 一時ディレクトリー {0} は完全には削除されませんでした。
ko: 임시 디렉토리 {0}이(가) 완전히 제거되지 않았습니다.

# CDISR5600E
source: The execution location {0} does not exist.
de: Die Ausführungsposition {0} ist nicht vorhanden.
fr: L''emplacement d''exécution {0} n''existe pas.
ja: 実行ロケーション {0} が存在しません。
ko: 실행 위치 {0}이(가) 존재하지 않습니다.

# CDISR5601E
source: The execution location {0} is not a directory.
de: Die Ausführungsposition {0} ist kein Verzeichnis.
fr: L''emplacement d''exécution {0} n''est pas un répertoire.
ja: 実行ロケーション {0} はディレクトリーではありません。
ko: 실행 위치 {0}이(가) 디렉토리가 아닙니다.

# CDISR5602E
source: The execution location {0} does not have the correct permissions.
de: Die Ausführungsposition {0} verfügt nicht über die korrekten Berechtigungen.
fr: L''emplacement d''exécution {0} ne dispose pas des droits appropriés.
ja: 実行ロケーション {0} には適正な権限がありません。
ko: 실행 위치 {0}에 올바른 권한이 없습니다.

# CDISR5603I
source: Additional command line arguments can be specified by using <name>=<string-literal>.
de: Weitere Befehlszeilenargumente können über <Name>=<Zeichenfolgeliteral> angegeben werden.
fr: Des arguments de ligne de commande supplémentaires peuvent être spécifiés à l''aide de <nom>=<littéral-chaîne>.
ja: 追加のコマンド・ライン引数を <name>=<string-literal> を使用して指定できます。
ko: <name>=<string-literal>을 사용하여 추가 명령행 인수를 지정할 수 있습니다.

# CDISR5604I
source: The required arguments are: {0}.
de: Erforderliche Argumente: {0}.
fr: Les arguments requis sont : {0}.
ja: 必須引数: {0}。
ko: 필수 인수는 다음과 같습니다: {0}.

# CDISR5605I
source: The optional arguments are: {0}.
de: Optionale Argumente: {0}.
fr: Les arguments facultatifs sont : {0}.
ja: オプション引数: {0}。
ko: 선택적 인수는 다음과 같습니다: {0}.

# CDISR5606T
source: Standalone Streams Application
de: Eigenständige Streams-Anwendung
fr: Application Streams autonome
ja: スタンドアロン・ストリーム・アプリケーション
ko: 독립형 Streams 애플리케이션

# CDISR5607E
source: A watermark was received from the unexpected source operator {0}, port {1}.
de: Vom unerwarteten Quellenoperator {0}, Port {1} wurde eine Grenze empfangen.
fr: Une cote d''alerte a été reçue en provenance d''une source inattendue : opérateur {0}, port {1}.
ja: 予期しないソース・オペレーター {0}、ポート {1} から、ウォーターマークを受け取りました。
ko: 예기치 않은 소스 연산자 {0}, 포트 {1}에서 워터 마크가 수신되었습니다.

# CDISR5608E
source: A watermark {0} was received which was earlier than the current watermark {1}. The watermark was received from operator {2}, port {3}.
de: Eine Grenze {0} wurde empfangen, die vor der aktuellen Grenze {1} liegt. Die Grenze wurde von Operator {2}, Port {3} empfangen.
fr: Une cote d''alerte {0} antérieure à la cote d''alerte actuelle {1} a été reçue. Cette cote d''alerte provient de l''opérateur {2}, port {3}.
ja: 現在のウォーターマーク {1} より前のウォーターマーク {0} を受け取りました。オペレーター {2}、ポート {3} から、このウォーターマークを受け取りました。
ko: 현재 워터 마크 {1}보다 이전의 워터 마크 {0}이(가) 수신되었습니다. 연산자 {2}, 포트 {3}에서 워터 마크가 수신되었습니다.

# CDISR5609W
source: Operator cannot generate watermarks. It has 0 input ports and EventTimeContext watermark mode {0}.
de: Operator kann keine Grenzen generieren. Er hat 0 Eingabeports und EventTimeContext-Grenzmodus {0}.
fr: L''opérateur ne peut pas générer de cote d''alerte. Il dispose de 0 port d''entrée et du mode de cote d''alerte EventTimeContext {0}.
ja: オペレーターはウォーターマークを生成できません。これには入力ポートが無く、EventTimeContext ウォーターマーク・モードは {0} です。
ko: 연산자에서 워터 마크를 생성할 수 없습니다. 해당 연산자에는 0개의 입력 포트가 있으며 EventTimeContext 워터 마크 모드가 {0}입니다.

# CDISR5610W
source: Watermark lag ignored for operator annotated with EventTimeContext watermark mode {0}.
de: Grenzverzögerung ignoriert für Operator, der mit EventTimeContext-Grenzmodus {0} mit Annotationen versehen wurde.
fr: Décalage de cote d''alerte ignoré pour l''opérateur annoté avec le mode de cote d''alerte EventTimeContext {0}.
ja: EventTimeContext ウォーターマーク・モード {0} のアノテーション付きのオペレーターに対するウォーターマーク・ラグは無視されました。
ko: EventTimeContext 워터 마크 모드 {0} 어노테이션이 있는 연산자에 대한 워터 마크 지연이 무시되었습니다.

# CDISR5186E
source: This is a test message - String: {0} - Integer: {1,number,0} - Formatted Integer: {2,number} - Real: {3,number,integer.##########} - Formatted Real: {4,number} - Date: {5,date} - Time: {6,time} - DateTime: {7,date} {7,time}.
ja: これはテスト・メッセージです - String: {0} - Integer: {1,number,0} - Formatted Integer: {2,number} - Real: {3,number,integer.##########} - Formatted Real: {4,number} - Date: {5,date} - Time: {6,time} - DateTime: {7,date} {7,time}。
