Repository: IBMStreams/OSStreams
Catalog: src/java/spl/com.ibm.streams.spl.messages/src/main/xlf/general/StreamsSPLJavaMessages_*.xlf
Languages: de, fr, ja, ko

# CDISR5510E
source: Port {0} window trigger count policy value {1} is negative.
de: Anzahlrichtlinienwert {1} für Fenstertrigger des Ports {0} ist negativ.
fr: La valeur de règle de comptage de déclenchement de fenêtre {1} pour le port {0} est négative.
ja: ポート {0} のウィンドウ・トリガー・カウント・ポリシー値 {1} は負です。
ko: 포트 {0} 창 트리거 개수 정책 값 {1}이(가) 음수입니다.

# CDISR5511E
source: Port {0} is not windowed.
de: Port {0} hat keine Fensterfunktion.
fr: Aucune configuration de fenêtre définie pour le port {0}.
ja: ポート {0} はウィンドウ構成が行われていません。
ko: 포트 {0}이(가) 창 설정되지 않았습니다.

# CDISR5512E
source: Port {0} window partition eviction count policy value {1} is negative.
de: Anzahlrichtlinienwert {1} für Fensterpartitionsbereinigung des Ports {0} ist negativ.
fr: La valeur de règle de comptage d''expulsion de partition de fenêtre {1} pour le port {0} est négative.
ja: ポート {0} のウィンドウ・パーティション排除カウント・ポリシー値 {1} は負です。
ko: 포트 {0} 창 파티션 제거 개수 정책 값 {1}이(가) 음수입니다.

# CDISR5513E
source: Port {0} window partition tuple eviction count policy value {1} is negative.
de: Anzahlrichtlinienwert {1} für Fensterpartitionstupelbereinigung des Ports {0} ist negativ.
fr: La valeur de règle de comptage d''expulsion de bloc de données de partition de fenêtre {1} pour le port {0} est négative.
ja: ポート {0} のウィンドウ・パーティション・タプル排除カウント・ポリシー値 {1} は負です。
ko: 포트 {0} 창 파티션 튜플 제거 개수 정책 값 {1}이(가) 음수입니다.

# CDISR5514E
source: Port {0} no window eviction policy specified.
de: Keine Fensterbereinigungsrichtlinie für Port {0} angegeben.
fr: Aucune règle d''expulsion de fenêtre spécifiée pour le port {0}.
ja: ポート {0} にウィンドウ排除ポリシーが指定されていません。
ko: 포트 {0}에 창 제거 정책이 지정되지 않았습니다.

# CDISR5515E
source: Port {0} no sliding window trigger policy specified.
de: Keine Triggerrichtlinie für Sliding Window für Port {0} angegeben.
fr: Aucune règle de déclenchement de fenêtre dynamique spécifiée pour le port {0}.
ja: ポート {0} にスライディング・ウィンドウ・トリガー・ポリシーが指定されていません。
ko: 포트 {0}에 슬라이딩 창 트리거 정책이 지정되지 않았습니다.

# CDISR5516E
source: Input port {1} for operator {0} requires a windowed port: {2}
de: Eingabeport {1} für Operator {0} erfordert einen Port mit Fensterfunktion: {2}
fr: Le port d''entrée {1} pour l''opérateur {0} requiert un port avec une configuration de fenêtre : {2}
ja: オペレーター {0} の入力ポート {1} には、ウィンドウ構成されたポートが必要です: {2}
ko: 연산자 {0}의 입력 포트 {1}은(는) 창 설정된 포트를 필요로 합니다: {2}.

# CDISR5517E
source: Operator {0} does not allow input ports.
de: Operator {0} lässt keine Eingabeports zu.
fr: L''opérateur {0} n''admet pas de ports d''entrée.
ja: オペレーター {0} で入力ポートは許可されません。
ko: 연산자 {0}은(는) 입력 포트를 허용하지 않습니다.

# CDISR5518E
source: Input port cannot be added as operator {0} has a maximum of {1} input ports.
de: Eingabeport kann nicht hinzugefügt werden, weil Operator {0} das Maximum von {1} Eingabeports hat.
fr: Le port d''entrée ne peut pas être ajouté car l''opérateur {0} comporte déjà le nombre maximal de {1} ports d''entrée.
ja: オペレーター {0} には最大数の {1} 個の入力ポートがあるため、入力ポートは追加できません。
ko: 연산자 {0}의 입력 포트 수가 최대 입력 포트 수인 {1}개에 도달하여 입력 포트를 추가할 수 없습니다.

# CDISR5519E
source: Port index out of range: {0}
de: Portindex außerhalb des gültigen Bereichs: {0}
fr: Valeur d''index de port hors plage : {0}
ja: ポート索引が範囲外です: {0}
ko: 포트 인덱스가 범위를 벗어났습니다: {0}.

# CDISR5520E
source: Operator {0} does not allow output ports.
de: Operator {0} lässt keine Ausgabeports zu.
fr: L''opérateur {0} n''admet pas de ports de sortie.
ja: オペレーター {0} で出力ポートは許可されません。
ko: 연산자 {0}은(는) 출력 포트를 허용하지 않습니다.

# CDISR5521E
source: Output port cannot be added as operator {0} has a maximum of {1} output ports.
de: Ausgabeport kann nicht hinzugefügt werden, weil Operator {0} das Maximum von {1} Ausgabeports hat.
fr: Le port de sortie ne peut pas être ajouté car l''opérateur {0} comporte déjà le nombre maximal de {1} ports de sortie.
ja: オペレーター {0} には最大数の {1} 個の出力ポートがあるため、出力ポートは追加できません。
ko: 연산자 {0}의 출력 포트 수가 최대 출력 포트 수인 {1}개에 도달하여 출력 포트를 추가할 수 없습니다.

# CDISR5522E
source: Operator {0} has a minimum of {1} input ports but only {2} are configured.
de: Operator {0} hat ein Minimum von {1} Eingabeports, jedoch sind nur {2} konfiguriert.
fr: L''opérateur {0} doit comporter au moins {1} ports d''entrée, or {2} ports d''entrée seulement sont configurés.
ja: オペレーター {0} の入力ポートの最小数は {1} 個ですが、{2} 個だけ構成されています。
ko: 연산자 {0}의 최소 입력 포트 수가 {1}개이지만 {2}개만 구성되었습니다.

# CDISR5523E
source: Operator {0} has a minimum of {1} input ports and maximum of {2} but {3} are configured.
de: Operator {0} hat ein Minimum von {1} Eingabeports und ein Maximum von {2}, jedoch sind {3} konfiguriert.
fr: L''opérateur {0} doit comporter entre {1} et {2} ports d''entrée, or {3} ports d''entrée sont configurés.
ja: オペレーター {0} の入力ポートの最小数は {1} 個、最大数は {2} 個ですが、{3} 個が構成されています。
ko: 연산자 {0}의 최소 입력 포트 수가 {1}개, 최대 입력 포트 수가 {2}개이지만 {3}개가 구성되었습니다.

# CDISR5524E
source: Operator {0} has a minimum of {1} output ports but only {2} are configured.
de: Operator {0} hat ein Minimum von {1} Ausgabeports, jedoch sind nur {2} konfiguriert.
fr: L''opérateur {0} doit comporter au moins {1} ports de sortie, or {2} ports de sortie seulement sont configurés.
ja: オペレーター {0} の出力ポートの最小数は {1} 個ですが、{2} 個だけ構成されています。
ko: 연산자 {0}의 최소 출력 포트 수가 {1}개이지만 {2}개만 구성되었습니다.

# CDISR5525E
source: Port {0} is connected in the graph.
de: Port {0} ist im Diagramm verbunden.
fr: Le port {0} est connecté dans le graphique.
ja: ポート {0} はグラフで接続されています。
ko: 포트 {0}이(가) 그래프에서 연결되었습니다.

# CDISR5526E
source: Mismatched issuer and subject for JCP self-signed certificate.
de: Aussteller und Subjekt für selbst signiertes JCP-Zertifikat weichen voneinander ab.
fr: Non concordance d''utilisateur et de sujet pour le certificat autosigné JCP.
ja: JCP 自己署名証明書で発行者とサブジェクトが不一致です。
ko: JCP 자체 서명 인증서에서 발행자와 대상이 불일치합니다.

# CDISR5527E
source: Mismatched subject for JCP self-signed certificate (transient connect to incorrect JCP)
de: Subjekt für selbst signiertes JCP-Zertifikat abweichend (transiente Verbindung mit falschem JCP)
fr: Non concordance de sujet pour le certificat autosigné JCP (connexion transitoire à un JCP incorrect)
ja: JCP 自己署名証明書でサブジェクトが不一致です (正しくない JCP への一時的な接続)
ko: JCP 자체 서명 인증서에서 대상이 불일치합니다(올바르지 않은 JCP에 대한 일시적 연결).

# CDISR5528E
source: Custom metric {0} already exists.
de: Angepasste Metrik {0} ist bereits vorhanden.
fr: La métrique personnalisée {0} existe déjà.
ja: カスタム・メトリック {0} は既に存在しています。
ko: 사용자 정의 메트릭 {0}이(가) 이미 존재합니다.

# CDISR5529E
source: Custom metric name cannot be empty.
de: Name der angepassten Metrik kann nicht leer sein.
fr: Le nom de métrique personnalisée doit être indiqué.
ja: カスタム・メトリック名を空にすることはできません。
ko: 사용자 정의 메트릭 이름은 비워둘 수 없습니다.

# CDISR5530E
source: Custom metric {0} does not exist.
de: Angepasste Metrik {0} ist nicht vorhanden.
fr: La métrique personnalisée {0} n''existe pas.
ja: カスタム・メトリック {0} が存在しません。
ko: 사용자 정의 메트릭 {0}이(가) 존재하지 않습니다.

# CDISR5531I
source: {0} for input port: {1}
de: {0} für Eingabeport: {1}
fr: {0} pour le port d''entrée : {1}
ja: 入力ポート {1} の {0}
ko: {0}에 대한 입력 포트: {1}

# CDISR5532I
source: {0} for output port: {1}
de: {0} für Ausgabeport: {1}
fr: {0} pour le port de sortie : {1}
ja: 出力ポート {1} の {0}
ko: {0}에 대한 출력 포트: {1}

# CDISR5533E
source: Null attribute value passed for index {0}
de: Nullattributwert für Index {0} übergeben
fr: Valeur d''attribut null transmise pour l''index {0}
ja: 索引 {0} にヌルの属性値が渡されました
ko: 인덱스 {0}에 대해 널(NULL) 속성 값이 전달되었습니다.

# CDISR5534E
source: Output port {0} export type {1} is not equal to {2}.
de: Ausgabeport {0} mit dem Exporttyp {1} ist ungleich {2}.
fr: Le port de sortie {0}, type d''exportation {1}, est différent de {2}.
ja: 出力ポート {0} のエクスポート・タイプ {1} は {2} に等しくありません。
ko: 출력 포트 {0} 익스포트 유형 {1}이(가) {2}과(와) 같지 않습니다.

# CDISR5535E
source: Port {0} is not connected to a PE port.
de: Port {0} ist nicht mit einem PE-Port verbunden.
fr: Le port {0} n''est pas connecté à un port d''élément de traitement.
ja: ポート {0} は PE ポートに接続されていません。
ko: 포트 {0}이(가) PE 포트에 연결되어 있지 않습니다.

# CDISR5536E
source: Attribute index ''{0}'' out of range
de: Attributindex ''{0}'' außerhalb des gültigen Bereichs
fr: Index d''attribut ''{0}'' hors plage
ja: 属性索引 ''{0}'' は範囲外です
ko: 속성 인덱스 ''{0}''이(가) 범위를 벗어났습니다.

# CDISR5537E
source: Attribute name ''{0}'' does not exist in the Tuple''s schema.
de: Attributname ''{0}'' ist im Tupelschema nicht vorhanden.
fr: Le nom d''attribut ''{0}'' n''existe pas dans le schéma du bloc de données.
ja: タプルのスキーマに属性名 ''{0}'' が存在しません。
ko: 속성 이름 ''{0}''이(가) 튜플의 스키마에 존재하지 않습니다.

# CDISR5538E
source: Operator invocation context invalid for @OperatorContext.ContextCheck methods for kind {0}, Java class {1}.
de: Operatoraufrufkontext ungültig für @OperatorContext.ContextCheck-Methoden für Art {0}, Java-Klasse {1}.
fr: Contexte d''appel d''opérateur non valide pour les méthodes @OperatorContext.ContextCheck, type {0}, classe Java {1}.
ja: 種類 {0}、Java クラス {1} の @OperatorContext.ContextCheck メソッドにオペレーター呼び出しコンテキストが無効です。
ko: 종류 {0}, Java 클래스 {1}에 대해 @OperatorContext.ContextCheck 메소드의 연산자 호출 컨텍스트가 유효하지 않습니다.

# CDISR5539E
source: Default attribute {0} not found for parameter {1}
de: Standardattribut {0} für Parameter {1} nicht gefunden
fr: Attribut par défaut {0} introuvable pour le paramètre {1}
ja: パラメーター {1} のデフォルト属性 {0} が見つかりません
ko: 매개변수 {1}의 기본 속성 {0}을(를) 찾을 수 없습니다.

# CDISR5540E
source: Mandatory parameter {0} not set
de: Obligatorischer Parameter {0} nicht festgelegt
fr: Paramètre obligatoire {0} non défini
ja: 必須パラメーター {0} が設定されていません
ko: 필수 매개변수 {0}이(가) 설정되지 않았습니다.

# CDISR5541E
source: Mandatory parameter {0} is not represented in the operator model: {1} annotation on {2}
de: Obligatorischer Parameter {0} ist im Operatormodell nicht dargestellt: Annotation {1} für {2}
fr: Le paramètre obligatoire {0} n''est pas représenté dans le modèle d''opérateur : annotation {1} sur {2}
ja: オペレーター・モデルで必須パラメーター {0} が表されませんでした: {2} の {1} アノテーション
ko: 필수 매개변수 {0}이(가) 연산자 모델에서 표시되지 않습니다: {2}의 {1} 어노테이션

# CDISR5542E
source: Mandatory parameter {0} is optional in the operator model: {1} annotation on {2}
de: Obligatorischer Parameter {0} ist im Operatormodell optional: Annotation {1} für {2}
fr: Le paramètre obligatoire {0} est facultatif dans le modèle d''opérateur : annotation {1} sur {2}
ja: オペレーター・モデルで必須パラメーター {0} がオプションです: {2} の {1} アノテーション
ko: 필수 매개변수 {0}이(가) 연산자 모델에서 선택사항입니다: {2}의 {1} 어노테이션

# CDISR5543E
source: Required type {3} not specified for parameter {0} in the operator model: {1} annotation on {2}
de: Erforderlicher Typ {3} für Parameter {0} im Operatormodell nicht angegeben: Annotation {1} für {2}
fr: Le type requis {3} n''est pas spécifié pour le paramètre {0} dans le modèle d''opérateur : annotation {1} sur {2}
ja: オペレーター・モデルのパラメーター {0} に必須タイプ {3} が指定されませんでした: {2} の {1} アノテーション
ko: 연산자 모델에서 매개변수 {0}에 대해 필수 유형 {3}이(가) 지정되지 않았습니다: {2}의 {1} 어노테이션

# CDISR5544E
source: Type {3} for parameter {0} in the operator model is not compatible with {1} annotation on {2}
de: Typ {3} für Parameter {0} im Operatormodell ist nicht kompatibel mit Annotation {1} für {2}
fr: Le type {3} du paramètre {0} dans le modèle d''opérateur n''est pas compatible avec l''annotation {1} sur {2}
ja: オペレーター・モデルのパラメーター {0} のタイプ {3} は、{2} の {1} アノテーションと互換性がありません。
ko: 연산자 모델에 있는 매개변수 {0}의 유형 {3}이(가) {2}의 {1} 어노테이션과 호환되지 않습니다.

# CDISR5545E
source: Cardinality for parameter {0} in the operator model is required to be 1 to be compatible with {1} annotation on {2}
de: Kardinalität für Parameter {0} im Operatormodell muss 1 sein, um mit Annotation {1} für {2} kompatibel zu sein.
fr: La cardinalité du paramètre {0} dans le modèle d''opérateur doit être égale à 1 pour être compatible avec l''annotation {1} sur {2}
ja: {2} の {1} アノテーションと互換になるためには、オペレーター・モデルのパラメーター {0} のカーディナリティーは 1 でなければなりません。
ko: {2}의 {1} 어노테이션과 호환되려면 연산자 모델에 있는 매개변수 {0}의 카디널리티가 1이어야 합니다.

# CDISR5546E
source: The metric kind {2} for custom metric {0} is required to be {1} to match @CustomMetric.
de: Die Metrikart {2} für angepasste Metrik {0} muss {1} sein, um mit @CustomMetric übereinzustimmen.
fr: Le type de métrique {2} pour la métrique personnalisée {0} doit être égal à {1} pour correspondre à @CustomMetric.
ja: @CustomMetric と一致するためには、カスタム・メトリック {0} のメトリック種類 {2} は {1} でなければなりません。
ko: @CustomMetric과 일치하려면 사용자 정의 메트릭 {0}의 메트릭 종류 {2}이(가) {1}이(가) 되어야 합니다.

# CDISR5547E
source: @ContextCheck failures for Java operator class {0}
de: @ContextCheck-Fehler für Java-Operatorklasse {0}
fr: Echecs @ContextCheck pour la classe d''opérateur Java {0}
ja: Java オペレーター・クラス {0} の @ContextCheck が失敗しました。
ko: Java 연산자 클래스 {0}에 대한 @ContextCheck 실패

# CDISR5548E
source: Tuple type mismatch - port''s StreamSchema: {0} - submitted tuple''s StreamSchema: {1}
de: Keine Tupeltypübereinstimmung - StreamSchema des Ports: {0} - übergebenes StreamSchema des Tupels: {1}
fr: Non concordance de type de bloc de données - schéma de flux du port : {0} et schéma de flux du bloc de données soumis : {1}
ja: タプル・タイプの不一致 - ポートの StreamSchema: {0} - サブミットされたタプルの StreamSchema: {1}
ko: 튜플 유형 불일치 - 포트의 StreamSchema: {0} - 제출된 튜플의 StreamSchema: {1}

# CDISR5549E
source: Class {0} not supported for @Parameter at method: {1}
de: Klasse {0} nicht unterstützt für @Parameter in Methode: {1}
fr: Classe {0} non prise en charge pour @Parameter sur la méthode : {1}
ja: クラス {0} は @Parameter にサポートされていません。メソッド: {1}
ko: 클래스 {0}이(가) 메소드에서 @Parameter에 대해 지원되지 않습니다: {1}

# CDISR5550E
source: {0} requires single value
de: {0} erfordert einen Einzelwert.
fr: {0} requiert une valeur unique
ja: {0} には単一値が必要です
ko: {0}은(는) 하나의 값을 필요로 합니다.

# CDISR5551E
source: {0} requires a value in the form <input port name>.<attribute name>. Invalid value specified - {1}
de: {0} erfordert einen Wert im Format <Eingabeportname>.<Attributname>. Ungültiger Wert angegeben - {1}
fr: {0} requiert une valeur au format <nom_port_entrée>.<nom_attribut>. Valeur non valide spécifiée - {1}
ja: {0} には、<入力ポート名>.<属性名> の形式の値が必要です。無効な値が指定されました - {1}
ko: {0}은(는) <입력 포트 이름>.<속성 이름> 양식의 값을 필요로 합니다. 유효하지 않은 값이 지정됨 - {1}

# CDISR5552E
source: Cannot remove all attributes from a schema: {0}
de: Es können nicht alle Attribute aus einem Schema entfernt werden: {0}
fr: Impossible de retirer tous les attributs d''un schéma : {0}
ja: スキーマからすべての属性を削除することはできません: {0}
ko: 스키마에서 모든 속성을 제거할 수 없음: {0}

# CDISR5553E
source: Java primitive implementation class {0} does not implement {1}
de: Primitive Java-Implementierungsklasse {0} implementiert nicht {1}
fr: La classe d''implémentation primitive Java {0} n''implémente pas {1}
ja: Java プリミティブ実装クラス {0} は {1} を実装していません
ko: Java 기본 구현 클래스 {0}은(는) {1}을(를) 구현하지 않습니다.

# CDISR5554E
source: Timestamp is unavailable during checkpointing
de: Zeitmarke ist im Prüfpunktverfahren nicht verfügbar
fr: Valeur d''horodatage non disponible lors de l''utilisation de point de contrôle
ja: チェックポイント処理中にタイム・スタンプは使用不可です。
ko: 체크포인트 설정 중에는 시간소인이 사용 불가능합니다.

# CDISR5555E
source: An input stream can only be retrieved during a restore.
de: Ein Eingabedatenstrom kann nur während einer Wiederherstellung abgerufen werden.
fr: Un flux d''entrée peut uniquement être extrait lors d''une restauration.
ja: 入力ストリームを取得できるのは、リストア中のみです。
ko: 입력 스트림은 복원 중에만 검색할 수 있습니다.

# CDISR5556E
source: An output stream can only be retrieved during checkpointing
de: Ein Ausgabedatenstrom kann nur während eines Prüfpunktverfahrens abgerufen werden.
fr: Un flux de sortie peut uniquement être extrait lors de l''utilisation de point de contrôle
ja: 出力ストリームを取得できるのは、チェックポイント処理中のみです。
ko: 출력 스트림은 체크포인트 설정 중에만 검색할 수 있습니다.

# CDISR5557E
source: Operator must be at the start of a consistent region
de: Operator muss am Anfang einer konsistenten Region stehen.
fr: L''opérateur doit figurer au début d''une région cohérente
ja: オペレーターは、整合領域の始まりになければなりません。
ko: 연산자는 일관성 있는 영역의 시작 부분에 있어야 합니다.

# CDISR5558E
source: {0}: String length ({1}) too large
de: {0}: Zeichenfolge ({1}) zu lang
fr: {0} : La longueur de chaîne ({1}) est trop élevée
ja: {0}: ストリング長 ({1}) が長すぎます
ko: {0}: 문자열 길이({1})가 너무 깁니다.

# CDISR5559E
source: Index {0} is out of range for {1}
de: Index {0} außerhalb des gültigen Bereichs für {1}
fr: Index {0} hors plage pour {1}
ja: 索引 {0} は {1} の範囲外です
ko: 인덱스 {0}이(가) {1}의 범위를 벗어났습니다.

# CDISR5560E
source: Identifier {0} is not valid for {1}
de: Kennung {0} nicht gültig für {1}
fr: L''identificateur {0} n''est pas valide pour {1}
ja: ID {0} は {1} に有効ではありません
ko: ID {0}은(는) {1}에 대해 유효하지 않습니다.

# CDISR5561E
source: {0}: Index for {1} does not equal ordinal for {2}.{3}
de: {0}: Index für {1} ungleich Ordinalzahl für {2}.{3}
fr: {0} : L''index pour {1} n''est pas égal à l''ordonnée pour {2}.{3}
ja: {0}: {1} の索引は {2}.{3} の序数に等しくありません
ko: {0}: {1}의 인덱스가 {2}.{3}의 순서와 같지 않습니다.

# CDISR5562E
source: Conversion between SPL type {0} (MetaType.{1}) and Java type {2} is not supported.
de: Konvertierung zwischen SPL-Typ {0} (MetaType.{1}) und Java-Typ {2} wird nicht unterstützt.
fr: La conversion entre le type SPL {0} (MetaType.{1}) et le type Java {2} n''est pas prise en charge.
ja: SPL タイプ {0} (MetaType.{1}) と Java タイプ {2} の間の変換はサポートされません。
ko: SPL 유형 {0}(MetaType.{1})과(와) Java 유형 {2} 간의 변환은 지원되지 않습니다.

# CDISR5563E
source: Language type: {0} not supported by JavaOp
de: Sprachentyp: {0} von JavaOp nicht unterstützt
fr: Le type de langage {0} n''est pas pris en charge par JavaOp
ja: 言語タイプ: {0} は JavaOp でサポートされません
ko: 언어 유형: {0}은(는) JavaOp에서 지원하지 않습니다.

# CDISR5564E
source: Internal Error: Window attribute for delta policy not found: {0}
de: Interner Fehler: Fensterattribut für Deltarichtlinie nicht gefunden: {0}
fr: Erreur interne : attribut Window pour règle d''écart introuvable : {0}
ja: 内部エラー: デルタ・ポリシーのウィンドウ属性が見つかりません: {0}
ko: 내부 오류: 델타 정책에 대한 창 속성을 찾을 수 없습니다: {0}.

# CDISR5565E
source: Unsupported attribute type for window delta policy: {0}
de: Nicht unterstützter Attributtyp für Fensterdeltarichtlinie: {0}
fr: Type d''attribut non pris en charge pour la règle d''écart de fenêtre : {0}
ja: ウィンドウ・デルタ・ポリシーにサポートされない属性タイプ: {0}
ko: 창 델타 정책에 대해 지원되지 않는 속성 유형입니다: {0}.

# CDISR5566E
source: Environment variable STREAMS_INSTALL not set
de: Umgebungsvariable STREAMS_INSTALL nicht festgelegt
fr: Variable d''environnement STREAMS_INSTALL non définie
ja: 環境変数 STREAMS_INSTALL が設定されていません
ko: 환경 변수 STREAMS_INSTALL이 설정되지 않았습니다.

# CDISR5567E
source: Operator already shutdown
de: Operator bereits beendet
fr: Opérateur déjà arrêté
ja: オペレーターが既にシャットダウンされています
ko: 연산자가 이미 종료되었습니다.

# CDISR5568E
source: Notification source {0} has already been added.
de: Benachrichtigungsquelle {0} wurde bereits hinzugefügt.
fr: Source de notification {0} déjà ajoutée.
ja: 通知ソース {0} は既に追加されています。
ko: 알림 소스 {0}이(가) 이미 추가되었습니다.

# CDISR5569E
source: Java Platform API Specification version not at Java 7 or higher.
de: API-Spezifikationsversion der Java-Plattform ist nicht Java 7 oder höher.
fr: La spécification d''API de plateforme Java n''est pas au niveau de la version Java 7 ou ultérieure.
ja: Java プラットフォーム API 仕様バージョンが、Java 7 以上ではありません。
ko: Java Platform API 스펙 버전이 Java 7 이상이 아닙니다.

# CDISR5570E
source: Cannot determine Java Platform API Specification version
de: API-Spezifikationsversion der Java-Plattform kann nicht festgestellt werden
fr: Impossible de déterminer la version de la spécification d''API de plateforme Java
ja: Java プラットフォーム API 仕様バージョンを判別できません
ko: Java Platform API 스펙 버전을 판별할 수 없습니다.

# CDISR5571I
source: Moving average of the time (milliseconds) to drain processing in a consistent region to establish consistent state
de: Gleitender Durchschnitt der Zeit (Millisekunden) zwischen dem Beginn der Bereinigungsverarbeitung in einer konsistenten Region und dem Herstellen eines konsistenten Status
fr: Moyenne mobile de la durée (en millisecondes) d''une opération DRAIN dans une région cohérente afin d''établir un état cohérent
ja: 整合状態を確立するために整合領域の処理をドレーンする時間の移動平均 (ミリ秒)
ko: 일관성 있는 상태를 설정하기 위해 일관성 있는 영역에서 처리를 드레인하는 시간(밀리초)의 이동 평균입니다.

# CDISR5572I
source: Moving average of the time (milliseconds) to reset the region to a previous consistent state
de: Gleitender Durchschnitt der Zeit (Millisekunden) bis zum Zurücksetzen der Region auf einen vorherigen konsistenten Status
fr: Moyenne mobile de la durée (en millisecondes) de réinitialisation de la région à un état cohérent précédent
ja: 領域を前の整合状態にリセットする時間の移動平均 (ミリ秒)
ko: 영역을 이전 일관성 있는 상태로 재설정하는 시간(밀리초)의 이동 평균입니다.

# CDISR5573I
source: State of the consistent region
de: Status der konsistenten Region
fr: Etat de la région cohérente
ja: 整合領域の状態
ko: 일관성 있는 영역의 상태

# CDISR5574I
source: Current number of attempts to reset the region to a previous consistent state
de: Aktuelle Anzahl Versuche, die Region auf einen vorherigen konsistenten Status zurückzusetzen
fr: Nombre actuel de tentatives de réinitialisation de la région à un état cohérent précédent
ja: 領域を前の整合状態にリセットする試行の現在数
ko: 영역을 이전 일관성 있는 상태로 재설정하는 시도의 현재 횟수

# CDISR5575I
source: Sequence identifier of the last consistent state for the region
de: Sequenzkennung des letzten konsistenten Status für die Region
fr: Identificateur de séquence du dernier état cohérent pour la région
ja: 領域の最後の整合状態のシーケンス ID
ko: 영역의 마지막 일관성 있는 상태의 시퀀스 ID

# CDISR5576I
source: Sequence identifier of the last consistent state the region was reset to
de: Sequenzkennung des letzten konsistenten Status der Region wurde zurückgesetzt auf
fr: Identificateur de séquence du dernier état cohérent auquel la région a été réinitialisée
ja: 領域リセット先の最後の整合状態のシーケンス ID
ko: 영역이 재설정된 마지막 일관성 있는 상태의 시퀀스 ID

# CDISR5577I
source: Time of the last consistent state for the region
de: Zeit des letzten konsistenten Status für die Region
fr: Heure du dernier état cohérent pour la région
ja: 領域の最後の整合状態の時間
ko: 영역의 마지막 일관성 있는 상태의 시간

# CDISR5578I
source: Time of the last reset for the region"
de: Zeit der letzten Zurücksetzung für die Region
fr: Heure de la dernière réinitialisation pour la région
ja: 領域の最後のリセットの時間
ko: 영역의 마지막 재설정의 시작

# CDISR5579E
source: ExecutableGraph has not been successfully initialized.
de: ExecutableGraph wurde nicht erfolgreich initialisiert.
fr: ExecutableGraph n''a pas été initialisé.
ja: ExecutableGraph は正常に初期化されていません。
ko: ExecutableGraph가 초기화되지 않았습니다.

# CDISR5580E
source: ExecutableGraph has not been successfully notified of port readiness.
de: ExecutableGraph wurde nicht erfolgreich über die Portbereitschaft benachrichtigt.
fr: ExecutableGraph n''a pas été informé de la disponibilité du port.
ja: ExecutableGraph はポート作動可能を正常に通知されていません。
ko: ExecutableGraph에게 포트 준비에 대한 알림이 수행되지 않았습니다.

# CDISR5581E
source: Operator name {0} already exists
de: Operatorname {0} ist bereits vorhanden
fr: Le nom d''opérateur {0} existe déjà
ja: オペレーター名 {0} は既に存在します
ko: 연산자 이름 {0}이(가) 이미 존재합니다.

# CDISR5582I
source: State of the operator''s connection to the Job Control Plane.
de: Status der Operatorverbindung zur Jobsteuerungsebene.
fr: Etat de la connexion de l''opérateur au plan de contrôle de travaux.
ja: Job Control Plane に対するオペレーターの接続の状態。
ko: 작업 제어 평면에 대한 연산자 연결의 상태입니다.

# CDISR5583E
source: Found subscript in postfix expression, but no constructed add expression.
de: Index in Postfixausdruck gefunden, jedoch kein erstellter Hinzufügeausdruck.
fr: Indice dans expression de suffixe trouvé, mais aucune expression add construite trouvée.
ja: 後置式に添え字がありますが、構成された追加式がありません。
ko: 접미부 표현식에서 서브스크립트를 찾았으나, 구성된 추가 표현식은 찾지 못했습니다.

# CDISR5584E
source: Unhandled SPL meta type: {0}
de: Unbearbeiteter SPL-Metatyp: {0}
fr: Métatype SPL non géré : {0}
ja: 未処理の SPL メタ・タイプ: {0}
ko: 처리되지 않은 SPL 메타 유형: {0}

# CDISR5585E
source: "No created subexpressions found
de: Keine erstellten Unterausdrücke gefunden
fr: "Aucune sous-expression créée trouvée
ja: 作成された副次式が見つかりません
ko: 작성된 하위 표현식을 찾지 못했습니다.

# CDISR5586E
source: Expected at least two expressions on stack for {0}
de: Mindestens zwei Ausdrücke im Stack für {0} erwartet
fr: Au moins deux expressions sont attendues sur la pile pour {0}
ja: {0} のスタックに少なくとも 2 つの式を予期しました
ko: {0}에 대한 스택에서 둘 이상의 표현식을 기대했습니다.
