Repository: IBMStreams/OSStreams
Catalog: src/java/spl/com.ibm.streams.spl.messages/src/main/xlf/general/StreamsSPLJavaMessages_*.xlf
Languages: de, fr, ja, ko

# CDISP7302E
source: Operator parameter {0} requires parameter {1}.
de: Operatorparameter {0} erfordert Parameter {1}.
fr: Le paramètre d''opérateur {0} requiert le paramètre {1}.
ja: オペレーター・パラメーター {0} にはパラメーター {1} が必要です。
ko: 연산자 매개변수 {0}은(는) 매개변수 {1}을(를) 필요로 합니다.

# CDISP7303E
source: Operator parameter {1} cannot be set when parameter {0} is set.
de: Operatorparameter {1} kann nicht festgelegt werden, wenn Parameter {0} festgelegt ist.
fr: Le paramètre d''opérateur {1} ne peut pas être défini si le paramètre {0} est spécifié.
ja: オペレーター・パラメーター {1} は、パラメーター {0} が設定されているときには指定できません。
ko: 매개변수 {0}이(가) 설정되어 있는 경우에는 연산자 매개변수 {1}을(를) 설정할 수 없습니다.

# CDISP7304E
source: Required attribute {0} is missing from schema {1}.
de: Erforderliches Attribut {0} fehlt in Schema {1}.
fr: L''attribut obligatoire {0} est manquant dans le schéma {1}.
ja: 必須属性 {0} がスキーマ {1} にありません。
ko: 필수 속성 {0}이(가) 스키마 {1}에서 누락되었습니다.

# CDISP7305E
source: Required attribute {0} is missing from schema {1} for port {2}.
de: Erforderliches Attribut {0} fehlt in Schema {1} für Port {2}.
fr: L''attribut obligatoire {0} est manquant dans le schéma {1} pour le port {2}.
ja: 必須属性 {0} が、ポート {2} のスキーマ {1} にありません。
ko: 필수 속성 {0}이(가) 포트 {2}에 대한 스키마 {1}에서 누락되었습니다.

# CDISP7306E
source: Schema {3} for port {2} does not match schema {1} for port {0}.
de: Schema {3} für Port {2} stimmt nicht mit Schema {1} für Port {0} überein.
fr: Le schéma {3} pour le port {2} ne correspond pas au schéma {1} pour le port {0}.
ja: ポート {2} のスキーマ {3} が、ポート {0} のスキーマ {1} に一致しません。
ko: 포트 {2}에 대한 스키마 {3}이(가) 포트 {0}에 대한 스키마 {1}과(와) 일치하지 않습니다.

# CDISP7307E
source: Input port {0} is required to be have window type {1} but has type {2}.
de: Eingabeport {0} muss Fenstertyp {1} haben, hat jedoch Typ {2}.
fr: Le port d''entrée {0} doit avoir le type de fenêtre {1}, or, sont type est {2}.
ja: 入力ポート {0} にはウィンドウ・タイプ {1} が必要ですが、タイプ {2} になっています。
ko: 입력 포트 {0}의 창 유형은 {1}이(가) 되어야 하지만 유형이 {2}입니다.

# CDISP7308E
source: Attribute {0} is required to be of type {1} but has type {2}.
de: Attribut {0} muss Typ {1} haben, hat jedoch Typ {2}.
fr: L''attribut {0} doit être de type {1}, or, son type est {2}.
ja: 属性 {0} はタイプ {1} でなければなりませんが、タイプ {2} になっています。
ko: 속성 {0}의 유형은 {1}이(가) 되어야 하지만 유형이 {2}입니다.

# CDISP7309E
source: Not supported at SPL compile time
de: Während der SPL-Kompilierung nicht unterstützt
fr: Méthode non prise en charge lors de la compilation SPL
ja: SPL コンパイル時にサポートされていません
ko: SPL 컴파일 시간에서 지원되지 않습니다.

# CDISP7310E
source: Java primitive {0} operator model file {1} can not be read.
de: Modelldatei {1} des primitiven Java-Operators {0} kann nicht gelesen werden.
fr: Le fichier de modèle d''opérateur {1} primitif Java {0} est illisible.
ja: Java プリミティブ {0} オペレーターのモデル・ファイル {1} を読み取りできません。
ko: Java 기본 {0} 연산자 모델 파일 {1}을(를) 읽을 수 없습니다.

# CDISP7311E
source: Internal error: No current toolkit root directory
de: Interner Fehler: Kein aktuelles Stammverzeichnis für das Toolkit
fr: Erreur interne : il n''existe aucune répertoire racine de kit d''outils en cours
ja: 内部エラー: 現行ツールキット・ルート・ディレクトリーがありません
ko: 내부 오류: 현재 툴킷 루트 디렉토리가 없습니다.

# CDISP7312E
source: Operator does not support {0} for attribute {1}.
de: Operator unterstützt nicht {0} für Attribut {1}.
fr: L''opérateur ne prend pas en charge le type {0} pour l''attribut {1}.
ja: オペレーターが属性 {1} の {0} をサポートしません。
ko: 연산자가 속성 {1}에 대해 {0}을(를) 지원하지 않습니다.

# CDISP7313E
source: Annotation {0} requires {1} to be a non-abstract class.
de: Annotation {0} erfordert, dass {1} eine nicht abstrakte Klasse ist.
fr: Pour l''annotation {0}, {1} doit être une classe non abstraite.
ja: アノテーション {0} で、{1} が非抽象クラスであることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 비추상 클래스여야 합니다.

# CDISP7314E
source: Annotation {0} requires {1} to be an instance method.
de: Annotation {0} erfordert, dass {1} eine Instanzdefinitionsmethode ist.
fr: Pour l''annotation {0}, {1} doit être une méthode d''instance.
ja: アノテーション {0} で、{1} がインスタンス・メソッドであることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 인스턴스 메소드여야 합니다.

# CDISP7315E
source: Annotation {0} requires {1} to be public.
de: Annotation {0} erfordert, dass {1} öffentlich ist.
fr: Pour l''annotation {0}, {1} doit être public.
ja: アノテーション {0} で、{1} が public であることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) public이어야 합니다.

# CDISP7316E
source: Annotation {0} requires {1} to be a setter method with a single parameter.
de: Annotation {0} erfordert, dass {1} eine Setter-Methode mit einem einzelnen Parameter ist.
fr: Pour l''annotation {0}, {1} doit être une méthode d''accès set avec un paramètre.
ja: アノテーション {0} で、{1} が単一パラメーターを持つ setter メソッドであることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 하나의 매개변수가 있는 설정기 메소드여야 합니다.

# CDISP7317E
source: Annotation {0} requires {1} to be a valid SPL identifier.
de: Annotation {0} erfordert, dass {1} eine gültige SPL-Kennung ist.
fr: Pour l''annotation {0}, {1} doit être un identificateur SPL valide.
ja: アノテーション {0} で、{1} が有効な SPL ID であることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 유효한 SPL ID여야 합니다.

# CDISP7318E
source: Annotation {0} requires {1} to be a valid SPL namespace identifier.
de: Annotation {0} erfordert, dass {1} eine gültige SPL-Namensbereichskennung ist.
fr: Pour l''annotation {0}, {1} doit être un identificateur d''espace de nom SPL valide.
ja: アノテーション {0} で、{1} が有効な SPL 名前空間 ID であることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 유효한 SPL 네임스페이스 ID여야 합니다.

# CDISP7319E
source: Annotation {0} requires {1} to be static.
de: Annotation {0} erfordert, dass {1} statisch ist.
fr: Pour l''annotation {0}, {1} doit être statique.
ja: アノテーション {0} で、{1} が static であることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) static이어야 합니다.

# CDISP7320E
source: Annotation {0} requires {1} to be a void method.
de: Annotation {0} erfordert, dass {1} eine typenlose (void) Methode ist.
fr: Pour l''annotation {0}, {1} doit être une méthode void.
ja: アノテーション {0} で、{1} が void メソッドであることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) void 메소드여야 합니다.

# CDISP7321E
source: Annotation {0} requires {1} to be a setter method with a single parameter with type Metric.
de: Annotation {0} erfordert, dass {1} eine Setter-Methode mit einem einzelnen Parameter des Typs ''Metric'' ist.
fr: Pour l''annotation {0}, {1} doit être une méthode d''accès set avec un paramètre de type Métrique.
ja: アノテーション {0} で、{1} がタイプ Metric の単一パラメーターを持つ setter メソッドであることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 유형이 Metric인, 하나의 매개변수가 있는 설정기 메소드여야 합니다.

# CDISP7322E
source: Varargs methods are not supported by annotation {0} : Method {1}
de: Varargs-Methoden werden von Annotation {0} nicht unterstützt: Methode {1}
fr: Les méthodes varargs ne sont pas prises en charge par l''annotation {0} : Méthode {1}
ja: 可変引数メソッドは、アノテーション {0} でサポートされません: メソッド {1}
ko: Varargs 메소드는 어노테이션 {0}에서 지원되지 않습니다: 메소드 {1}

# CDISP7323E
source: Annotation {0} does not support parameter type {2} for method {1}.
de: Annotation {0} unterstützt nicht Parametertyp {2} für Methode {1}.
fr: L''annotation {0} ne prend pas en charge le type de paramètre {2} pour la méthode {1}.
ja: アノテーション {0} は、メソッド {1} にパラメーター・タイプ {2} をサポートしません。
ko: 어노테이션 {0}은(는) 메소드 {1}에 대해 매개변수 유형 {2}을(를) 지원하지 않습니다.

# CDISP7324E
source: Annotation {0} requires {1} to implement the Operator interface.
de: Annotation {0} erfordert, dass {1} die Operatorschnittstelle implementiert.
fr: Pour l''annotation {0}, {1} doit implémenter l''interface d''opérateur.
ja: アノテーション {0} で、{1} が Operator インターフェースを実装することが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 연산자 인터페이스를 구현해야 합니다.

# CDISP7325E
source: Cardinality for annotation {0} for method {1} must be greater than 1 or equal to -1 to represent unbounded.
de: Kardinalität für Annotation {0} für Methode {1} muss größer als 1 oder gleich -1 sein, um unbegrenzt darzustellen.
fr: La cardinalité de l''annotation {0} pour la méthode {1} doit être supérieure à 1, ou être égale à -1 pour être non liée.
ja: メソッド {1} のアノテーション {0} のカーディナリティーは、無制限を表すには 1 より大きくするか、-1 にする必要があります。
ko: 메소드 {1}에 대한 어노테이션 {0}의 카디널리티는 무한임을 나타내려는 경우 1보다 크거나 -1과 같아야 합니다.

# CDISP7326E
source: Cannot set cardinality for annotation {0} for method {1} as the setter method''s type enforces cardinality of 1.
de: Kardinalität für Annotation {0} für Methode {1} kann nicht festgelegt werden, weil der Typ der Setter-Methode die Kardinalität 1 erzwingt.
fr: Impossible de définir la cardinalité de l''annotation {0} pour la méthode {1} car le type de la méthode d''accès set impose une cardinalité égale à 1.
ja: setter メソッドのタイプによりカーディナリティー 1 が強制されるため、メソッド {1} のアノテーション {0} のカーディナリティーを設定できません。
ko: 설정기 메소드의 유형이 1의 카디널리티를 강제하므로 메소드 {1}에 대한 어노테이션 {0}의 카디널리티를 설정할 수 없습니다.

# CDISP7327E
source: Optional attribute for annotation {0} for method {1} must be set to true (or unspecified) if used in conjunction with the @DefaultAttribute annotation.
de: Optionales Attribut für Annotation {0} für Methode {1} muss auf ''true'' gesetzt (oder nicht angegeben) werden, wenn es zusammen mit der Annotation @DefaultAttribute verwendet wird.
fr: L''attribut facultatif de l''annotation {0} pour la méthode {1} doit avoir pour valeur true (ou ne pas être spécifié) s''il est utilisé conjointement avec l''annotation @DefaultAttribute.
ja: メソッド {1} のアノテーション {0} のオプション属性は、@DefaultAttribute アノテーションと組み合わせて使用する場合、true に設定する (または未指定にする) 必要があります。
ko: 메소드 {1}에 대한 어노테이션 {0}의 선택적 속성은 @DefaultAttribute 어노테이션과 함께 사용되는 경우 true(또는 미지정)로 설정되어야 합니다.

# CDISP7328E
source: Cannot set cardinality for annotation {0} for method {1} as the setter method''s @DefaultAttribute annotation enforces cardinality of 1.
de: Kardinalität für Annotation {0} für Methode {1} kann nicht festgelegt werden, weil die Annotation @DefaultAttribute der Setter-Methode die Kardinalität 1 erzwingt.
fr: Impossible de définir la cardinalité de l''annotation {0} pour la méthode {1} car l''annotation @DefaultAttribute de la méthode d''accès set impose une cardinalité égale à 1.
ja: setter メソッドの @DefaultAttribute アノテーションによりカーディナリティー 1 が強制されるため、メソッド {1} のアノテーション {0} のカーディナリティーを設定できません。
ko: 설정기 메소드의 @DefaultAttribute 어노테이션이 1의 카디널리티를 강제하므로 메소드 {1}에 대한 어노테이션 {0}의 카디널리티를 설정할 수 없습니다.

# CDISP7329E
source: DefaultAttribute annotation can only be used in conjunction with the @Parameter annotation.
de: Annotation DefaultAttribute kann nur zusammen mit der Annotation @Parameter verwendet werden.
fr: L''annotation DefaultAttribute ne peut être utilisée que conjointement avec l''annotation @Parameter.
ja: DefaultAttribute アノテーションは、@Parameter アノテーションと組み合わせて使用する必要があります。
ko: DefaultAttribute 어노테이션은 @Parameter 어노테이션과 함께 사용해야만 합니다.

# CDISP7330E
source: Annotation {0} requires {1} to be a valid attribute name.
de: Annotation {0} erfordert, dass {1} ein gültiger Attributname ist.
fr: Pour l''annotation {0}, {1} doit être un nom d''attribut valide.
ja: アノテーション {0} で、{1} が有効な属性名であることが要求されています。
ko: 어노테이션 {0}에서는 {1}이(가) 유효한 속성 이름이어야 합니다.

# CDISP7331E
source: Icons annotation can only be used in conjunction with the PrimitiveOperator annotation.
de: Annotation Icons kann nur zusammen mit der Annotation PrimitiveOperator verwendet werden.
fr: L''annotation Icons ne peut être utilisée que conjointement avec l''annotation PrimitiveOperator.
ja: Icons アノテーションは、PrimitiveOperator アノテーションと組み合わせて使用する必要があります。
ko: Icons 어노테이션은 PrimitiveOperator 어노테이션과 함께 사용해야만 합니다.

# CDISP7332E
source: The cardinality of the output port set must be specified.
de: Die Kardinalität des Ausgabeports muss angegeben werden.
fr: La cardinalité de l''ensemble de ports de sortie doit être spécifiée.
ja: 出力ポート・セットのカーディナリティーを指定する必要があります。
ko: 출력 포트 세트의 카디널리티를 지정해야 합니다.

# CDISP7333E
source: The cardinality of the input port set must be specified.
de: Die Kardinalität des Eingabeports muss angegeben werden.
fr: La cardinalité de l''ensemble de ports d''entrée doit être spécifiée.
ja: 入力ポート・セットのカーディナリティーを指定する必要があります。
ko: 입력 포트 세트의 카디널리티를 지정해야 합니다.

# CDISP7334E
source: The windowPunctuationInputPort value {0} does not correspond with a valid input port set identifier.
de: Der windowPunctuationInputPort-Wert {0} entspricht keiner gültigen Kennung einer Eingabeportgruppe.
fr: La valeur windowPunctuationInputPort {0} ne correspond pas à un identificateur d''ensemble de ports d''entrée valide.
ja: windowPunctuationInputPort 値 {0} は、有効な入力ポート・セット ID に一致しません。
ko: windowPunctuationInputPort 값 {0}이(가) 유효한 입력 포트 세트 ID에 해당하지 않습니다.

# CDISP7335E
source: InputPortSet and InputPorts annotations cannot occur on the same element.
de: InputPortSet- und InputPorts-Annotationen können nicht in demselben Element auftreten.
fr: Les annotations InputPortSet et InputPorts ne peuvent pas figurer sur un même élément.
ja: InputPortSet と InputPorts のアノテーションを同じエレメントに使用することはできません。
ko: InputPortSet 및 InputPorts 어노테이션은 같은 요소에서 발생할 수 없습니다.

# CDISP7336E
source: OutputPortSet and OutputPorts annotations cannot occur on the same element.
de: OutputPortSet- und OutputPorts-Annotationen können nicht in demselben Element auftreten.
fr: Les annotations OutputPortSet et OutputPorts ne peuvent pas figurer sur un même élément.
ja: OutputPortSet と OutputPorts のアノテーションを同じエレメントに使用することはできません。
ko: OutputPortSet 및 OutputPorts 어노테이션은 같은 요소에서 발생할 수 없습니다.

# CDISP7337E
source: The id for an input port set must be unique.
de: Die ID für eine Eingabeportgruppe muss eindeutig sein.
fr: L''ID d''un ensemble de ports d''entrée doit être unique.
ja: 入力ポート・セットの ID は固有でなければなりません。
ko: 입력 포트 세트의 ID는 고유해야 합니다.

# CDISP7338E
source: The windowPunctuationInputPort attribute can be only set on punctuation preserving output ports.
de: Das Attribut windowPunctuationInputPort kann nur für Punktuation festgelegt werden, die Ausgabeports beibehält.
fr: L''attribut windowPunctuationInputPort peut uniquement être défini sur des ports de sortie de conservation de ponctuation.
ja: windowPunctuationInputPort 属性は、パンクチュエーションを保持する出力ポートにのみ設定可能です。
ko: windowPunctuationInputPort 속성은 구두점을 유지하는 출력 포트에서만 설정될 수 있습니다.

# CDISP7339E
source: ERROR: {0}
de: FEHLER: {0}
fr: ERREUR : {0}
ja: エラー: {0}
ko: 오류: {0}

# CDISP7340W
source: WARNING: {0}
de: WARNUNG: {0}
fr: AVERTISSEMENT : {0}
ja: 警告: {0}
ko: 경고: {0}

# CDISP7341E
source: Data directory was not specified at compile time.
de: Datenverzeichnis während der Kompilierung nicht angegeben.
fr: Aucun répertoire de données spécifié au moment de la compilation.
ja: コンパイル時にデータ・ディレクトリーが指定されませんでした。
ko: 데이터 디렉토리가 컴파일 시간에 지정되지 않았습니다.

# CDISP7342E
source: Operator: {0} requires exactly {1} input port(s).
de: Operator {0} erfordert genau {1} Eingabeport(s).
fr: L''opérateur {0} requiert exactement {1} port(s) d''entrée.
ja: オペレーター: {0} は、厳密に {1} 個の入力ポートを必要とします。
ko: 연산자: {0}은(는) 정확히 {1}개의 입력 포트를 필요로 합니다.

# CDISP7343E
source: Operator: {0} requires at least {1} input port(s).
de: Operator {0} erfordert mindestens {1} Eingabeport(s).
fr: L''opérateur {0} requiert au moins {1} port(s) d''entrée.
ja: オペレーター: {0} は、少なくとも {1} 個の入力ポートを必要とします。
ko: 연산자: {0}은(는) 최소 {1}개의 입력 포트를 필요로 합니다.

# CDISP7344E
source: Operator: {0} requires exactly {1} output port(s).
de: Operator {0} erfordert genau {1} Ausgabeport(s).
fr: L''opérateur {0} requiert exactement {1} port(s) de sortie.
ja: オペレーター: {0} は、厳密に {1} 個の出力ポートを必要とします。
ko: 연산자: {0}은(는) 정확히 {1}개의 출력 포트를 필요로 합니다.

# CDISP7345E
source: Operator: {0} requires at least {1} output port(s).
de: Operator {0} erfordert mindestens {1} Ausgabeport(s).
fr: L''opérateur {0} requiert au moins {1} port(s) de sortie.
ja: オペレーター: {0} は、少なくとも {1} 個の出力ポートを必要とします。
ko: 연산자: {0}은(는) 최소 {1}개의 출력 포트를 필요로 합니다.

# CDISP7346E
source: Blob cannot support length of: {0}
de: Blob kann folgende Länge nicht unterstützen: {0}
fr: L''objet BLOB ne prend pas en charge la longueur {0}
ja: blob は次の長さをサポートできません: {0}
ko: BLOB은 다음 길이를 지원할 수 없습니다: {0}

# CDISP7347E
source: Complex SPL character format is invalid, expecting: ''(real, imaginary)'', was {0}
de: Komplexes SPL-Zeichenformat ist ungültig, erwartet wurde ''(real, imaginary)'', {0} wurde festgestellt.
fr: Format du caractère SPL complexe non valide. Attendu : ''(real, imaginary)'', trouvé : {0}
ja: 複素数の SPL 文字フォーマットが無効です。''(real, imaginary)'' を予期していましたが、{0} でした。
ko: 복합 SPL 문자 형식이 유효하지 않습니다. ''(real, imaginary)''를 기대했으나 {0}입니다.

# CDISP7348I
source: Extracts information from an application bundle file.
de: Extrahiert Informationen aus einer Anwendungsbundledatei.
fr: Extrait des informations d''un fichier bundle d''applications.
ja: アプリケーション・バンドル・ファイルから情報を抽出します。
ko: 애플리케이션 번들 파일로부터 정보를 추출합니다.

# CDISP7349E
source: File {0} does not exist.
de: Datei {0} ist nicht vorhanden.
fr: Le fichier {0} n''existe pas.
ja: ファイル {0} が存在しません。
ko: 파일 {0}이(가) 존재하지 않습니다.

# CDISP7350E
source: Unsupported bundle version
de: Nicht unterstützte Bundleversion
fr: Version de bundle non prise en charge
ja: サポートされないバンドル・バージョン
ko: 지원되지 않는 번들 버전

# CDISP7351E
source: File error: {0}
de: Dateifehler: {0}
fr: Erreur de fichier : {0}
ja: ファイル・エラー: {0}
ko: 파일 오류: {0}

# CDISP7352E
source: Bundle error: {0}
de: Bundlefehler: {0}
fr: Erreur de bundle : {0}
ja: バンドル・エラー: {0}
ko: 번들 오류: {0}

# CDISP7353I
source: -h, --help Get (this) usage information.
de: -h, --help (Diese) Syntaxinformationen abrufen.
fr: -h, --help Obtenir des informations sur cette syntaxe.
ja: -h, --help 使用法情報 (この情報) を取得します。
ko: -h, --help 사용법 정보를 가져옵니다.

# CDISP7354I
source: --build-id Get the build id from this bundle.
de: --build-id Build-ID aus diesem Bundle abrufen.
fr: --build-id Obtenir l''ID de génération à partir de ce bundle.
ja: --build-id このバンドルのバンドル ID を入手します。
ko: --build-id 이 번들에서 빌드 ID를 가져옵니다.

# CDISP7355I
source: --build-date Get the build-date from this bundle.
de: --build-date Erstellungsdatum aus diesem Bundle abrufen.
fr: --build-date Obtenir la date de génération à partir de ce bundle.
ja: --build-date このバンドルのビルド日付を入手します。
ko: --build-date 이 번들에서 빌드 날짜를 가져옵니다.

# CDISP7357I
source: --toolkits List all the toolkits in the bundle and their version number.
de: --toolkits Alle Toolkits im Bundle und ihre Versionsnummer auflisten.
fr: --toolkits Afficher tous les kits d''outils présents dans le bundle et leur numéro de version.
ja: --toolkits バンドル内のすべてのツールキットとそのバージョン番号をリストします。
ko: --toolkits 번들에 있는 모든 툴킷 및 해당 버전 번호를 나열합니다.

# CDISP7358I
source: --files List all the files in the bundle. This implies --toolkits.
de: --files Alle Dateien im Bundle auflisten. Dies impliziert --toolkits.
fr: --files Afficher la liste de tous les fichiers présents dans le bundle. Cela implique --toolkits.
ja: --files バンドル内のすべてのファイルをリストします。これは、--toolkits を暗黙指定します。
ko: --files 번들에 있는 모든 파일을 나열합니다. 이는 --toolkits를 포함합니다.

# CDISP7359I
source: --xml <outFile> Emit the application bundle information in machine readable format to the specified file.
de: --xml <Ausgabedatei> Anwendungsbundleinformationen in maschinenlesbarem Format in der angegebenen Datei ausgeben.
fr: --xml <fich_sortie> Générer dans le fichier spécifié les informations de bundle d''applications dans un format lisible par les machines.
ja: --xml <outFile> 機械可読フォーマットのアプリケーション・バンドル情報を指定されたファイルに出力します。
ko: --xml <outFile> 애플리케이션 번들 정보를 시스템 인식 가능 형식을 사용하여 지정된 파일에 생성합니다.

# CDISP7360I
source: --unbundle <dir> Extract the contents of the bundle into the specified directory.
de: --unbundle <dir> Inhalt des Bundles im angegebenen Verzeichnis extrahieren.
fr: --unbundle <rép> Extraire le contenu du bundle dans le répertoire spécifié.
ja: --unbundle <dir> バンドルのコンテンツを指定されたディレクトリーに抽出します。
ko: --unbundle <dir> 번들의 컨텐츠를 지정된 디렉토리에 추출합니다.

# CDISP7361I
source: --execution-mode The execution mode for which the bundle was compiled; standalone or distributed.
de: --execution-mode Ausführungsmodus, für den das Bundle kompiliert wurde; eigenständig oder verteilt.
fr: --execution-mode Mode d''exécution pour lequel le bundle a été compilé : autonome ou réparti.
ja: --execution-mode バンドルがコンパイルされた実行モード。standalone または distributed。
ko: --execution-mode 번들이 컴파일된 실행 모드(독립형 또는 분산)입니다.

# CDISP9252I
source: usage: spl-app-info -h, --help | [--build-id][--build-date][--toolkits][--files][--xml <outFile>][--unbundle <dir>] <sabFile>
de: Syntax: spl-app-info -h, --help | [--build-id][--build-date][--toolkits][--files][--xml <Ausgabedatei>][--unbundle <Verzeichnis>] <SAB-Datei>
fr: Syntaxe : spl-app-info -h, --help | [--build-id][--build-date][--toolkits][--files][--xml <fich_sortie>][--unbundle <rép>] <fich_sab>
ja: 使用法: spl-app-info -h, --help | [--build-id][--build-date][--toolkits][--files][--xml <outFile>][--unbundle <dir>] <sabFile>
ko: 사용법: spl-app-info -h, --help | [--build-id][--build-date][--toolkits][--files][--xml <outFile>][--unbundle <dir>] <sabFile>

# CDISR5500E
source: Input port {0} does not allow any window configuration: {1}
de: Eingabeport {0} lässt Fensterkonfiguration nicht zu: {1}
fr: Le port d''entrée {0} n''autorise aucune configuration de fenêtre : {1}
ja: 入力ポート {0} でウィンドウ構成は許可されません: {1}
ko: 입력 포트 {0}은(는) 창 구성을 허용하지 않습니다: {1}.

# CDISR5501E
source: Port {0} window type is {1}. The expected type is {2}.
de: Fenstertyp des Ports {0} ist {1}. Der erwartete Typ ist {2}.
fr: Le type de fenêtre du port {0} est {1}. Le type attendu est {2}.
ja: ポート {0} のウィンドウ・タイプは {1} です。予期されたタイプは {2} です。
ko: 포트 {0} 창 유형이 {1}입니다. 예상 유형은 {2}입니다.

# CDISR5502E
source: Port {0} window is not partitioned.
de: Fenster des Ports {0} ist nicht partitioniert.
fr: La fenêtre du port {0} n''est pas partitionnée.
ja: ポート {0} のウィンドウは、パーティション化されていません。
ko: 포트 {0} 창이 파티션되지 않았습니다.

# CDISR5503E
source: Port {0} window eviction count policy value {1} is negative.
de: Anzahlrichtlinienwert {1} für Fensterbereinigung des Ports {0} ist negativ.
fr: La valeur de règle de comptage d''expulsion de fenêtre {1} pour le port {0} est négative.
ja: ポート {0} のウィンドウ排除カウント・ポリシー値 {1} は負です。
ko: 포트 {0} 창 제거 개수 정책 값 {1}이(가) 음수입니다.

# CDISR5504E
source: Port {0} window eviction time policy value {1} is negative.
de: Zeitrichtlinienwert {1} für Fensterbereinigung des Ports {0} ist negativ.
fr: La valeur de règle de date d''expulsion de fenêtre {1} pour le port {0} est négative.
ja: ポート {0} のウィンドウ排除時間ポリシー値 {1} は負です。
ko: 포트 {0} 창 제거 시간 정책 값 {1}이(가) 음수입니다.

# CDISR5505E
source: Input port schema {0} does not match output port schema {1}.
de: Eingabeportschema {0} stimmt nicht mit Ausgabeportschema {1} überein.
fr: Le schéma de port d''entrée {0} ne correspond pas au schéma de port de sortie {1}.
ja: 入力ポート・スキーマ {0} が、出力ポート・スキーマ {1} と一致しません。
ko: 입력 포트 스키마 {0}이(가) 출력 포트 스키마 {1}과(와) 일치하지 않습니다.

# CDISR5506E
source: Port {0} window eviction delta policy attribute {1} does not exist.
de: Deltarichtlinienattribut {1} für Fensterbereinigung des Ports {0} ist nicht vorhanden.
fr: L''attribut de règle d''écart d''expulsion de fenêtre {1} du port {0} n''existe pas.
ja: ポート {0} のウィンドウ排除デルタ・ポリシー属性 {1} が存在しません。
ko: 포트 {0} 창 제거 델타 정책 속성 {1}이(가) 존재하지 않습니다.

# CDISR5507E
source: Port {0} window eviction delta policy for attribute {1} value class {2} is not the required type {3} for {4}.
de: Deltarichtlinie für Fensterbereinigung des Ports {0} des Attributs {1} mit Wertklasse {2} ist nicht der erforderliche Typ {3} für {4}.
fr: La règle d''écart d''expulsion de fenêtre du port {0} pour l''attribut {1} et la valeur de classe {2} ne correspond pas au type {3} requis pour {4}.
ja: 属性 {1} 値クラス {2} に対するポート {0} のウィンドウ排除デルタ・ポリシーは、{4} に必要なタイプ {3} ではありません。
ko: 속성 {1} 값 클래스 {2}에 대한 포트 {0} 창 제거 델타 정책이 {4}에 대한 필수 유형 {3}이(가) 아닙니다.

# CDISR5508E
source: Port {0} window trigger time policy value {1} is negative.
de: Zeitrichtlinienwert {1} für Fenstertrigger des Ports {0} ist negativ.
fr: La valeur de règle de déclenchement de fenêtre {1} pour le port {0} est négative.
ja: ポート {0} のウィンドウ・トリガー時間ポリシー値 {1} は負です。
ko: 포트 {0} 창 트리거 시간 정책 값 {1}이(가) 음수입니다.

# CDISR5509E
source: Port {0} window partition eviction age policy value {1} is negative.
de: Altersrichtlinienwert {1} für Fensterpartitionsbereinigung des Ports {0} ist negativ.
fr: La valeur de règle de changement de date d''expulsion de partition de fenêtre {1} pour le port {0} est négative.
ja: ポート {0} のウィンドウ・パーティション排除存続期間ポリシー値 {1} は負です。
ko: 포트 {0} 창 파티션 제거 유효 기간 정책 값 {1}이(가) 음수입니다.
