Repository: IBMStreams/OSStreams
Catalog: src/java/spl/com.ibm.streams.spl.messages/src/main/xlf/doc/StreamsSPLDOCMessages_*.xlf
Languages: fr, it, ja, ko, zh_cn, zh_tw

# CDISP7000E
source: No toolkit specified. Use either the -i or -t parameter to specify the toolkit path(s).
fr: Aucun kit d''outils spécifié. Utilisez le paramètre -i ou -t pour spécifier le chemin du kit d''outils.
it: Nessun toolkit specificato. Utilizzare il parametro -t o -i per specificare i percorsi del toolkit.
ja: ツールキットが指定されていません。-i または -t パラメーターのいずれかを使用して、ツールキット・パスを指定してください。
ko: 툴킷이 지정되지 않았습니다. -i 또는 -t 매개변수 중 하나를 사용하여 툴킷 경로를 지정하십시오.
zh_cn: 未指定工具箱。使用 -i 或 -t 参数指定工具箱路径。
zh_tw: 未指定工具箱。請使用 -i 或 -t 參數來指定工具箱路徑。

# CDISP7002I
source: JVM locale: language: {0}, country: {1}, variant: {2}
fr: Environnement local JVM : langue : {0}, pays : {1}, variante : {2}
it: Locale JVM: lingua: {0}, paese: {1}, variante: {2}
ja: JVM ロケール: 言語: {0}、国: {1}、バリアント: {2}
ko: JVM 로케일: 언어: {0}, 국가: {1}, 변형: {2}
zh_cn: JVM 语言环境：{0}，国家或地区：{1}，变体：{2}
zh_tw: JVM 語言環境：語言：{0}，國家/地區：{1}，變式：{2}

# CDISP7003E
source: Invalid argument: {0}.
fr: Argument non valide : {0}.
it: Argomento non valido: {0}.
ja: 無効な引数: {0}。
ko: 유효하지 않은 인수: {0}.
zh_cn: 自变量无效：{0}。
zh_tw: 引數無效：{0}。

# CDISP7004E
source: Both -i and -t parameters are specified. Use either the -i or -t parameter to specify the toolkit path(s).
fr: Les deux paramètres -i et -t sont définis. Utilisez le paramètre -i ou -t pour spécifier le chemin du kit d''outils.
it: Sono specificati entrambi i parametri, -i e -t. Utilizzare il parametro -t o -i per specificare i percorsi del toolkit.
ja: -i と -t の両方のパラメーターが指定されました。-i または -t パラメーターのいずれかを使用して、ツールキット・パスを指定してください。
ko: -i 및 -t 매개변수가 둘 다 지정되었습니다. -i 또는 -t 매개변수 중 하나를 사용하여 툴킷 경로를 지정하십시오.
zh_cn: 同时指定了 -i 和 -t 参数。使用 -i 或 -t 参数指定工具箱路径。
zh_tw: 同時指定了 -i 和 -t 參數。請使用 -i 或 -t 參數來指定工具箱路徑。

# CDISP7005E
source: The specified toolkit path {0} does not exist or is not a directory.
fr: Le chemin de kit d''outils spécifié, {0}, n''existe pas ou ne correspond pas à un répertoire.
it: Il percorso del toolkit specificato {0} non esiste o non è una directory.
ja: 指定されたツールキット・パス {0} は、存在しないか、ディレクトリーではありません。
ko: 지정된 툴킷 경로 {0}이(가) 존재하지 않거나 디렉토리가 아닙니다.
zh_cn: 指定的工具箱路径 {0} 不存在或不是目录。
zh_tw: 指定的工具箱路徑 {0} 不存在，或者不是目錄。

# CDISP7006E
source: Error loading model file: {0}. File does not exist, or: {1}. Try reindexing or recompiling the toolkit.
fr: Erreur lors du chargement du fichier modèle : {0}. Le fichier n''existe pas, ou : {1}. Relancez l''indexation ou la compilation du kit d''outils.
it: Errore durante il caricamento del file modello: {0}. Il file non esiste, oppure: {1}. Provare di nuovo a indicizzare o compilare il toolkit.
ja: モデル・ファイル: {0} のロード中にエラーが発生しました。ファイルが存在しないか、以下のエラーが発生しました: {1}。ツールキットの再索引付けまたは再コンパイルを試行してください。
ko: 모델 파일을 로드하는 중에 오류가 발생했습니다: {0}. 파일이 존재하지 않거나, 다음 오류가 발생했습니다: {1}. 툴킷을 다시 인덱싱하거나 재컴파일하십시오.
zh_cn: 装入模型文件时出错：{0}。文件不存在，或者：{1}。尝试对工具箱重建索引或重新编译。
zh_tw: 載入模型檔 {0} 時發生錯誤。檔案不存在，或者：{1}。請嘗試重新建立索引或重新編譯工具箱。

# CDISP7007I
source: Exiting spl-make-doc.
fr: Sortie de spl-make-doc.
it: Uscita da spl-make-doc.
ja: spl-make-doc を終了します。
ko: spl-make-doc를 종료합니다.
zh_cn: 正在退出 spl-make-doc。
zh_tw: 正在結束 spl-make-doc。

# CDISP7008E
source: Error reading model file: {0}. Content missing. Try reindexing or recompiling the toolkit.
fr: Erreur lors de la lecture du fichier modèle : {0}. Contenu manquant. Relancez l''indexation ou la compilation du kit d''outils.
it: Errore durante la lettura del file modello: {0}. Contenuto mancante. Provare di nuovo a indicizzare o compilare il toolkit.
ja: モデル・ファイル: {0} の読み取り中にエラーが発生しました。コンテンツがありません。ツールキットの再索引付けまたは再コンパイルを試行してください。
ko: 모델 파일을 읽는 중에 오류가 발생했습니다: {0}. 컨텐츠가 누락되었습니다. 툴킷을 다시 인덱싱하거나 재컴파일하십시오.
zh_cn: 读取模型文件时出错：{0}。缺少内容。尝试对工具箱重建索引或重新编译。
zh_tw: 讀取模型檔 {0} 時發生錯誤。遺漏了內容。請嘗試重新建立索引或重新編譯工具箱。

# CDISP7009E
source: Error reading SPL file: {0}. Verify that the SPL file exists and can be read.
fr: Erreur lors de la lecture du fichier SPL : {0}. Assurez-vous que le fichier SPL existe et qu''il est lisible.
it: Errore durante la lettura del file SPL: {0}. Verificare che il file SPL esista e possa essere letto.
ja: SPL ファイル: {0} の読み取り中にエラーが発生しました。SPL ファイルが存在し、読み取り可能であることを確認してください。
ko: SPL 파일을 읽는 중에 오류가 발생했습니다: {0}. SPL 파일이 존재하며 읽을 수 있는지 확인하십시오.
zh_cn: 读取 SPL 文件时出错：{0}。验证 SPL 文件是否存在且可读取。
zh_tw: 讀取 SPL 檔 {0} 時發生錯誤。請驗證 SPL 檔存在，並且可以讀取。

# CDISP7010E
source: Exception encountered:\n {0}
fr: Exception détectée :\n {0}
it: Rilevata eccezione:\n {0}
ja: 例外が検出されました:\n {0}
ko: 예외가 발생했습니다:\n {0}.
zh_cn: 遇到异常：\n {0}
zh_tw: 發生異常狀況：\n{0}

# CDISP7011I
source: SPL composite operator image not displayed. Problem loading file: {0}\n
fr: Image d''opérateur composite SPL non affichée. Problème lors du chargement du fichier : {0}\n
it: Immagine dell''operatore composito SPL non visualizzata. Problema durante il caricamento del file: {0}\n
ja: SPL コンポジット・オペレーター・イメージが表示されません。ファイルの読み込み中の問題: {0}\n
ko: SPL 복합 연산자 이미지가 표시되지 않았습니다. 파일을 로드하는 중에 문제가 발생했습니다: {0}\n
zh_cn: 未显示 SPL 组合操作程序图像。装入文件时发生问题：{0}\n
zh_tw: 未顯示 SPL 複合運算子影像。載入檔案時遇到問題：{0}\n

# CDISP7012I
source: Primitive operator image not displayed. Problem loading file: {0}\n
fr: Image d''opérateur primitif non affichée. Problème lors du chargement du fichier : {0}\n
it: Immagine dell''operatore primitivo non visualizzata. Problema durante il caricamento del file: {0}\n
ja: プリミティブ・オペレーター・イメージが表示されません。ファイルの読み込み中の問題: {0}\n
ko: 기본 연산자 이미지가 표시되지 않았습니다. 파일을 로드하는 중에 문제가 발생했습니다: {0}\n
zh_cn: 未显示基本操作程序图像。装入文件时发生问题：{0}\n
zh_tw: 未顯示初始運算子影像。載入檔案時遇到問題：{0}\n

# CDISP7013E
source: Exception loading the model file {0}. Try reindexing or recompiling the toolkit.
fr: Exception lors du chargement du fichier modèle {0}. Relancez l''indexation ou la compilation du kit d''outils.
it: Eccezione durante il caricamento del file modello {0}. Provare di nuovo a indicizzare o compilare il toolkit.
ja: モデル・ファイル {0} をロード中に例外が発生しました。ツールキットの再索引付けまたは再コンパイルを試行してください。
ko: 모델 파일 {0}을(를) 로드하는 중에 예외가 발생했습니다. 툴킷을 다시 인덱싱하거나 재컴파일하십시오.
zh_cn: 装入模型文件 {0} 时发生异常。尝试对工具箱重建索引或重新编译。
zh_tw: 載入模型檔 {0} 時發生異常狀況。請嘗試重新建立索引或重新編譯工具箱。

# CDISP7014E
source: Source model inconsistency. Start column number {0} on line {1} exceeds line length {2}. Contact IBM Software Support.
fr: Incohérence de modèle source. Le numéro de colonne de début {0} sur la ligne {1} est supérieur à la longueur de ligne {2}. Contactez le service de support logiciel IBM.
it: Incongruenza del modello di origine. Il numero colonna iniziale {0} alla riga {1} supera la lunghezza di riga {2}. Rivolgersi al supporto software IBM.
ja: ソース・モデルに不整合があります。行 {1} の開始列番号 {0} は、行の長さ {2} を超えます。IBM ソフトウェア・サポートにお問い合わせください。
ko: 소스 모델 불일치가 있습니다. {1}행의 시작 컬럼 번호 {0}이(가) 행 길이 {2}을(를) 초과합니다. IBM 소프트웨어 지원 센터에 문의하십시오.
zh_cn: 源模型不一致。行 {1} 上的起始列号 {0} 超出行长度 {2}。请与 IBM 软件支持人员联系。
zh_tw: 原始檔模型不一致。第 {1} 行上的起始欄號碼 {0} 超過行長度 {2}。請與「IBM 軟體支援中心」聯絡。

# CDISP7015E
source: Source model inconsistency. End column number {0} on line {1} exceeds line length {2}. Contact IBM Software Support.
fr: Incohérence de modèle source. Le numéro de colonne de fin {0} sur la ligne {1} est supérieur à la longueur de ligne {2}. Contactez le service de support logiciel IBM.
it: Incongruenza del modello di origine. Il numero colonna finale {0} alla riga {1} supera la lunghezza di riga {2}. Rivolgersi al supporto software IBM.
ja: ソース・モデルに不整合があります。行 {1} の終了列番号 {0} は、行の長さ {2} を超えます。IBM ソフトウェア・サポートにお問い合わせください。
ko: 소스 모델 불일치가 있습니다. {1}행의 종료 컬럼 번호 {0}이(가) 행 길이 {2}을(를) 초과합니다. IBM 소프트웨어 지원 센터에 문의하십시오.
zh_cn: 源模型不一致。行 {1} 上的结束列号 {0} 超出行长度 {2}。请与 IBM 软件支持人员联系。
zh_tw: 原始檔模型不一致。第 {1} 行上的結束欄號碼 {0} 超過行長度 {2}。請與「IBM 軟體支援中心」聯絡。

# CDISP7016E
source: File does not exist, or incorrect path name: {0}. Try reindexing or recompiling the toolkit.
fr: Fichier inexistant ou nom de chemin incorrect : {0}. Relancez l''indexation ou la compilation du kit d''outils.
it: Il file non esiste oppure il nome percorso non è corretto: {0}. Provare di nuovo a indicizzare o compilare il toolkit.
ja: ファイルが存在しないか、パス名が誤りです: {0}。ツールキットの再索引付けまたは再コンパイルを試行してください。
ko: 파일이 존재하지 않거나 경로 이름이 올바르지 않습니다: {0}. 툴킷을 다시 인덱싱하거나 재컴파일하십시오.
zh_cn: 文件不存在，或路径名不正确：{0}。尝试对工具箱重建索引或重新编译。
zh_tw: 檔案不存在，或者路徑名稱不正確：{0}。請嘗試重新建立索引或重新編譯工具箱。

# CDISP7017E
source: URI table not found for toolkit {0}. Try reindexing or recompiling the toolkit.
fr: Table d''URI introuvable pour le kit d''outils {0}. Relancez l''indexation ou la compilation du kit d''outils.
it: Tabella URI non trovata per il toolkit {0}. Provare di nuovo a indicizzare o compilare il toolkit.
ja: ツールキット {0} の URI 表が見つかりませんでした。ツールキットの再索引付けまたは再コンパイルを試行してください。
ko: 툴킷 {0}의 URI 테이블을 찾을 수 없습니다. 툴킷을 다시 인덱싱하거나 재컴파일하십시오.
zh_cn: 找不到工具箱 {0} 的 URI 表。尝试对工具箱重建索引或重新编译。
zh_tw: 找不到工具箱 {0} 的 URI 表格。請嘗試重新建立索引或重新編譯工具箱。

# CDISP7018E
source: URI index for toolkit {0} missing entry: {1}. Try reindexing or recompiling the toolkit.
fr: L''index d''URI pour le kit d''outils {0} ne comporte pas l''entrée {1}. Relancez l''indexation ou la compilation du kit d''outils.
it: All''indice URI per il toolkit {0} manca la voce: {1}. Provare di nuovo a indicizzare o compilare il toolkit.
ja: ツールキット {0} の URI 索引に次の項目がありません: {1}。ツールキットの再索引付けまたは再コンパイルを試行してください。
ko: 툴킷 {0}의 URI 인덱스에 누락된 항목이 있습니다: {1}. 툴킷을 다시 인덱싱하거나 재컴파일하십시오.
zh_cn: 工具箱 {0} 的 URI 索引缺少条目：{1}。尝试对工具箱重建索引或重新编译。
zh_tw: 工具箱 {0} 的 URI 索引遺漏項目：{1}。請嘗試重新建立索引或重新編譯工具箱。

# CDISP7019E
source: The toolkit in directory {0} has the same name as the toolkit in directory {1}. Specify the toolkit {2} only once.
fr: Le kit d''outils défini dans le répertoire {0} porte le même nom que le kit d''outils spécifié dans le répertoire {1}. Indiquez le kit d''outils {2} une seule fois.
it: Il toolkit nella directory {0} ha lo stesso nome del toolkit nella directory {1}. Specificare il toolkit {2} solo una volta.
ja: ディレクトリー {0} のツールキットが、ディレクトリー {1} のツールキットと同じ名前です。ツールキット {2} は 1 回だけ指定してください。
ko: 디렉토리 {0}에 있는 툴킷과 디렉토리 {1}에 있는 툴킷의 이름이 같습니다. 툴킷 {2}을(를) 한 번만 지정하십시오.
zh_cn: 目录 {0} 中的工具箱与目录 {1} 中工具箱的名称相同。仅指定工具箱 {2} 一次。
zh_tw: 目錄 {0} 中的工具箱與目錄 {1} 中的工具箱具有相同的名稱。請僅指定工具箱 {2} 一次。

# CDISP7020E
source: Toolkit model inconsistency for the toolkit in directory {0}. Try rebuilding the toolkit.
fr: Incohérence de modèle de kit d''outils pour le kit d''outils dans le répertoire {0}. Relancez la régénération du kit d''outils.
it: Incongruenza del modello di toolkit per il toolkit nella directory {0}. Provare di nuovo a generare il toolkit.
ja: ディレクトリー {0} のツールキットのツールキット・モデルに不整合があります。ツールキットの再ビルドを試行してください。
ko: 디렉토리 {0}에 있는 툴킷에 툴킷 모델 불일치가 있습니다. 툴킷을 재빌드하십시오.
zh_cn: 目录 {0} 中工具箱的工具箱模型不一致。尝试重建工具箱。
zh_tw: 目錄 {0} 中工具箱的工具箱模型不一致。請嘗試重建工具箱。

# CDISP7021E
source: A line of SPLDOC markup text starts with characters reserved for possible future markup. Suppress interpretation by using the backslash (\\\\) escape character in this line: {0}
fr: Une ligne de texte de balisage SPLDOC commence avec des caractères réservés pour un futur balisage éventuel. Supprimez l''interprétation en ajoutant le caractère d''échappement de barre oblique inversée (\\\\) sur la ligne suivante : {0}
it: Una riga del testo di markup SPLDOC inizia con caratteri riservati per possibili markup future. Sopprimere l''interpretazione utilizzando il carattere di escape barra retroversa (\\\\) in questa riga: {0}
ja: SPLDOC マークアップ・テキストの行が、将来使用される可能性があるマークアップ用に予約済みの文字で開始します。次の行で、バックスラッシュ (\\\\) エスケープ文字を使用して解釈を抑止してください: {0}
ko: SPLDOC 마크업 텍스트의 행이 가능한 이후 마크업을 위해 예약된 문자로 시작합니다. 이 행에서 백슬래시(\\\\) Escape 문자를 사용하여 해석을 제외하십시오: {0}
zh_cn: SPLDOC 标记文本行以保留字符开头，这些保留字符供将来可能的标记使用。通过在此行中使用反斜杠 (\\\\) 转义字符来禁止解释：{0}
zh_tw: SPLDOC 標記文字的某一行以保留字元開頭，這些保留字元供未來可能的標記使用。請透過在此行中使用反斜線 (\\\\) 跳出字元，來暫停解譯：{0}

# CDISP7022E
source: A title in SPLDOC markup text starts with characters reserved for possible future SPLDOC markup. Suppress interpretation by using the backslash (\\\\) escape character in this title: {0}
fr: Un titre dans un texte de balisage SPLDOC commence avec des caractères réservés pour un futur balisage SPLDOC éventuel. Supprimez l''interprétation en ajoutant le caractère d''échappement de barre oblique inversée (\\\\) dans le titre suivant : {0}
it: Un titolo nel testo di markup SPLDOC inizia con caratteri riservati per possibili markup SPLDOC future. Sopprimere l''interpretazione utilizzando il carattere di escape barra retroversa (\\\\) in questo titolo: {0}
ja: SPLDOC マークアップ・テキストのタイトルが、将来使用される可能性がある SPLDOC マークアップ用に予約済みの文字で開始します。次のタイトルで、バックスラッシュ (\\\\) エスケープ文字を使用して解釈を抑止してください: {0}
ko: SPLDOC 마크업 텍스트의 제목이 가능한 이후 SPLDOC 마크업을 위해 예약된 문자로 시작합니다. 이 제목에서 백슬래시(\\\\) Escape 문자를 사용하여 해석을 제외하십시오: {0}
zh_cn: SPLDOC 标记文本中的标题以保留字符开头，这些保留字符供将来可能的 SPLDOC 标记使用。通过在此标题中使用反斜杠 (\\\\) 转义字符来禁止解释：{0}
zh_tw: SPLDOC 標記文字中的標題以保留字元開頭，這些保留字元供未來可能的 SPLDOC 標記使用。請透過在此標題中使用反斜線 (\\\\) 跳出字元，來暫停解譯：{0}

# CDISP7023E
source: A line of SPLDOC markup text includes characters reserved for possible future SPLDOC markup. Suppress interpretation by using the backslash (\\\\) escape character in this text: {0}
fr: Une ligne de texte de balisage SPLDOC comporte des caractères réservés pour un futur balisage SPLDOC éventuel. Supprimez l''interprétation en ajoutant le caractère d''échappement de barre oblique inversée (\\\\) dans le texte suivant : {0}
it: Una riga del testo di markup SPLDOC include caratteri riservati per possibili markup SPLDOC future. Sopprimere l''interpretazione utilizzando il carattere di escape barra retroversa (\\\\) in questo testo: {0}
ja: SPLDOC マークアップ・テキストの行が、将来使用される可能性がある SPLDOC マークアップ用に予約済みの文字を含みます。このテキストで、バックスラッシュ (\\\\) エスケープ文字を使用して解釈を抑止します: {0}
ko: SPLDOC 마크업 텍스트의 행이 가능한 이후 SPLDOC 마크업을 위해 예약된 문자를 포함합니다. 이 텍스트에서 백슬래시(\\\\) Escape 문자를 사용하여 해석을 제외하십시오: {0}
zh_cn: SPLDOC 标记文本行包含保留字符，这些保留字符供将来可能的 SPLDOC 标记使用。通过在此文本中使用反斜杠 (\\\\) 转义字符来禁止解释：{0}
zh_tw: SPLDOC 標記文字的某一行包括保留字元，這些保留字元供未來可能的 SPLDOC 標記使用。請透過在此文字中使用反斜線 (\\\\) 跳出字元，來暫停解譯：{0}

# CDISP7024E
source: A line of SPLDOC markup text that requires a title has no title.
fr: Une ligne de texte de balisage SPLDOC ne comporte pas de titre, or, un titre est requis.
it: Una riga del testo di markup SPLDOC che richiede un titolo non ha nessun titolo.
ja: タイトルが必要な SPLDOC マークアップ・テキストの行に、タイトルがありません。
ko: 제목을 필요로 하는 SPLDOC 마크업 텍스트의 행에 제목이 없습니다.
zh_cn: SPLDOC 标记文本行需要具备标题，但是没有标题。
zh_tw: SPLDOC 標記文字的某一行需要標題，但卻沒有標題。

# CDISP7025E
source: A line of SPLDOC markup text is incorrect.
fr: Une ligne de texte de balisage SPLDOC est incorrecte.
it: Una riga del testo di markup SPLDOC non è corretta.
ja: SPLDOC マークアップ・テキストの行が正しくありません。
ko: SPLDOC 마크업 텍스트의 행이 올바르지 않습니다.
zh_cn: SPLDOC 标记文本行不正确。
zh_tw: SPLDOC 標記文字的某一行不正確。

# CDISP7026W
source: A line of SPLDOC markup text contains in-line markup that is not closed or that contains incorrect SPLDOC markup. Correct the markup or suppress interpretation of the markup tag by using the backslash (\\\\) escape character in this text: {0}
fr: Une ligne de texte de balisage SPLDOC contient un balisage en ligne qui n''est pas fermé ou qui comporte un balisage SPLDOC incorrect. Corrigez le balisage ou supprimez l''interprétation de la balise de marquage en ajoutant le caractère d''échappement de barre oblique inversée (\\\\) dans le texte suivant : {0}
it: Una riga del testo di markup SPLDOC contiene una markup in-line che non è chiusa o contiene una markup SPLDOC errata. Correggere la markup o sopprimere l''interpretazione del tag di markup utilizzando il carattere di escape barra retroversa (\\\\) in questo testo: {0}
ja: SPLDOC マークアップ・テキストの行に含まれるインライン・マークアップが、閉じていないか、正しくない SPLDOC マークアップを含んでいます。マークアップを訂正するか、次のテキストで、バックスラッシュ (\\\\) エスケープ文字を使用してマークアップ・タグの解釈を抑止してください: {0}
ko: SPLDOC 마크업 텍스트의 행에 닫히지 않거나 올바르지 않은 SPLDOC 마크업을 포함하는 인라인 마크업이 포함되어 있습니다. 마크업을 정정하거나 이 텍스트에서 백슬래시(\\\\) Escape 문자를 사용하여 마크업 태그의 해석을 제외하십시오: {0}
zh_cn: SPLDOC 标记文本行包含的直接插入标记未结束或包含了不正确的 SPLDOC 标记。纠正标记，或通过在此文本中使用反斜杠 (\\\\) 转义字符来禁止解释标记标签：{0}
zh_tw: SPLDOC 標記文字的某一行包含行內標記，該行內標記不完整或包含不正確的 SPLDOC 標記。請更正該標記，或者透過在此文字中使用反斜線 (\\\\) 跳出字元，來暫停標記標籤的解譯：{0}

# CDISP7027W
source: An SPLDOC in-line markup tag is nested within other in-line markup where this is not currently supported. Suppress interpretation by using the backslash (\\\\) escape character in this text: {0}
fr: Une balise de marquage en ligne SPLDOC est imbriquée dans un autre balisage en ligne où cela n''est pas pris en charge pour l''instant. Supprimez l''interprétation en ajoutant le caractère d''échappement de barre oblique inversée (\\\\) dans le texte suivant : {0}
it: Un tag di markup SPLDOC in-line è nidificato all''interno di un''altra markup in-line che non è attualmente supportata. Sopprimere l''interpretazione utilizzando il carattere di escape barra retroversa (\\\\) in questo testo: {0}
ja: SPLDOC インライン・マークアップ・タグは、現在このタグをサポートしていない他のインライン・マークアップ内でネストされています。このテキストで、バックスラッシュ (\\\\) エスケープ文字を使用して解釈を抑止します: {0}
ko: SPLDOC 인라인 마크업 태그가 다른 인라인 마크업 내에 중첩되어 있으며 이는 이 위치에서 현재 지원되지 않습니다. 이 텍스트에서 백슬래시(\\\\) Escape 문자를 사용하여 해석을 제외하십시오: {0}
zh_cn: 在其他当前不受支持的直接插入标记中嵌入了 SPLDOC 直接插入标记标签。通过在此文本中使用反斜杠 (\\\\) 转义字符来禁止解释：{0}
zh_tw: 某個 SPLDOC 行內標記標籤巢套在其他行內標記中，但這種情況目前不受支援。請透過在此文字中使用反斜線 (\\\\) 跳出字元，來暫停解譯：{0}

# CDISP7028E
source: description line {0}
fr: ligne de description {0}
it: riga descrizione {0}
ja: 説明行 {0}
ko: 설명 행 {0}
zh_cn: 描述行 {0}
zh_tw: 說明行 {0}

# CDISP7029E
source: The SPLDOC markup for a table is missing the markup to end the table at this line: {0}
fr: Le balisage SPLDOC pour une table ne comporte pas le balisage de fin de table sur la ligne suivante : {0}
it: A una markup SPLDOC per una tabella manca la markup per terminare la tabella in questa riga: {0}
ja: 表の SPLDOC マークアップで、次の行に表を終了するマークアップがありません: {0}
ko: 테이블에 대한 SPLDOC 마크업의 다음 행에서 테이블을 종료하기 위한 마크업이 누락되어 있습니다: {0}
zh_cn: 表的 SPLDOC 标记缺少用于在此行结束表的标记：{0}
zh_tw: 在下列行中，某個表格的 SPLDOC 標記遺漏了用來結束該表格的標記：{0}

# CDISP7030E
source: There is a syntax error in the SPLDOC markup for a table. Correct the markup at this text: {0}
fr: Erreur de syntaxe dans le balisage SPLDOC pour une table. Corrigez le balisage dans le texte suivant : {0}
it: Errore di sintassi nella markup SPLDOC per una tabella. Correggere la markup in questo testo: {0}
ja: 表の SPLDOC マークアップに構文エラーがあります。次のテキストのマークアップを訂正してください: {0}
ko: 테이블에 대한 SPLDOC 마크업에 구문 오류가 있습니다. 다음 텍스트에서 마크업을 정정하십시오: {0}
zh_cn: 表的 SPLDOC 标记中出现语法错误。纠正此文本中的标记：{0}
zh_tw: 某個表格的 SPLDOC 標記存在語法錯誤。請更正下列文字中的標記：{0}

# CDISP7031E
source: Required SPLDOC markup is missing from the end of this line of SPLDOC markup for a table: {0}
fr: Le balisage SPLDOC requis est manquant à la fin de cette ligne de balisage SPLDOC pour une table : {0}
it: La markup SPLDOC richiesta è mancante alla fine di questa riga della markup SPLDOC per una tabella: {0}
ja: 表の SPLDOC マークアップで次の行の終わりに、必要な SPLDOC マークアップがありません: {0}
ko: 테이블에 대한 SPLDOC 마크업의 다음 행에서 필수 SPLDOC 마크업이 누락되어 있습니다: {0}
zh_cn: 表的此 SPLDOC 标记行结尾缺少所需 SPLDOC 标记：{0}
zh_tw: 針對某個表格，SPLDOC 標記的以下行末尾，遺漏了必要的 SPLDOC 標記：{0}

# CDISP7032E
source: This line of SPLDOC markup for a table has fewer columns than the number already defined for the table: {0}
fr: Cette ligne de balisage SPLDOC pour une table comporte un nombre de colonnes inférieur au nombre déjà défini pour la table : {0}
it: Questa riga di markup SPLDOC per una tabella ha meno colonne del numero già definito per la tabella: {0}
ja: 表の SPLDOC マークアップのこの行には、表に既に定義されている数より少ない列が含まれます: {0}
ko: 테이블에 대한 SPLDOC 마크업의 이 행에 있는 컬럼 수가 테이블에 대해 이미 정의된 컬럼 수보다 적습니다: {0}
zh_cn: 表的此 SPLDOC 标记行所具有的列数少于已为表定义的列数：{0}
zh_tw: 針對某個表格，SPLDOC 標記的以下行所具有的直欄數目，少於已經為該表格定義的數目：{0}

# CDISP7033E
source: A line of SPLDOC markup for a table has more columns than the number already defined for the table, starting at this text: {0}
fr: Une ligne de balisage SPLDOC pour une table comporte un nombre de colonnes supérieur au nombre déjà défini pour la table, à partir du texte suivant :{0}
it: Una riga di markup SPLDOC per una tabella ha più colonne del numero già definito per la tabella, a partire da questo testo: {0}
ja: このテキストで始まる、表の SPLDOC マークアップの行には、表に既に定義されている数より多くの列が含まれます: {0}
ko: 이 텍스트부터, 테이블에 대한 SPLDOC 마크업의 행에 있는 컬럼 수가 테이블에 대해 이미 정의된 컬럼 수를 초과합니다: {0}
zh_cn: 从此文本开始，表的 SPLDOC 标记行所具有的列数多于已为表定义的列数：{0}
zh_tw: 針對某個表格，SPLDOC 標記的某一行所具有的直欄數目，多於已經為該表格定義的數目（從下列文字開始）：{0}

# CDISP7034E
source: The SPLDOC markup for a column boundary in a table uses both normal and row header column boundary markup for the same column, at this text: {0}
fr: Le balisage SPLDOC pour une limite de colonne dans une table utilise à la fois un balisage de limite de colonne de type normal et un balisage de limite de colonne de type en-tête de ligne pour la même colonne, au niveau du texte suivant : {0}
it: La markup SPLDOC per un limite di colonna in una tabella utilizza sia una markup di limite colonna di intestazione di riga che normale per la stessa colonna, in questo testo: {0}
ja: 表の列境界の SPLDOC マークアップが、次のテキストで、同じ列に通常と行見出し列境界マークアップの両方を使用しています: {0}
ko: 다음 텍스트에서, 테이블의 컬럼 경계에 대한 SPLDOC 마크업이 같은 컬럼에 대해 일반 컬럼 경계 마크업 및 행 헤더 컬럼 경계 마크업을 둘 다 사용합니다: {0}
zh_cn: 在此文本中，表中列边界的 SPLDOC 标记对相同列同时使用普通列边界标记和行标题列边界标记：{0}
zh_tw: 在下列文字處，表格中某個直欄界限的 SPLDOC 標記為同一直欄同時使用了一般直欄界限標記和列標頭直欄界限標記：{0}

# CDISP7035E
source: The SPLDOC markup for a row boundary in a table occurs before all columns have been defined, at this text: {0}
fr: Le balisage SPLDOC pour une limite de ligne dans une table apparaît avant que toutes les colonnes aient été définies, au niveau du texte suivant : {0}
it: La markup SPLDOC per un limite di riga in una tabella si trova prima della definizione di tutte le colonne, in questo testo: {0}
ja: 次のテキストで、すべての列の定義が完了する前に、表の行境界の SPLDOC マークアップが出現しています: {0}
ko: 다음 텍스트에서, 테이블의 행 경계에 대한 SPLDOC 마크업이 모든 컬럼이 정의되기 전에 발생합니다: {0}
zh_cn: 在此文本中，表中行边界的 SPLDOC 标记出现在已定义的所有列之前：{0}
zh_tw: 在下列文字處，在已定義所有直欄之前，出現了表格中某個列界限的 SPLDOC 標記：{0}

# CDISP7036E
source: The SPLDOC markup for a row boundary in a table has fewer than three characters between columns before this text: {0}
fr: Le balisage SPLDOC pour une limite de ligne dans une table comporte moins de trois caractères entre des colonnes, avant le texte suivant : {0}
it: La markup SPLDOC per un limite di riga in una tabella ha meno di tre caratteri tra le colonne prima di questo testo: {0}
ja: 表の行境界の SPLDOC マークアップで、次のテキストの前の列間にある文字が 3 文字未満です: {0}
ko: 테이블의 행 경계에 대한 SPLDOC 마크업에서 다음 텍스트 이전의 컬럼 간 문자 수가 3자보다 적습니다: {0}
zh_cn: 在此文本之前，表中行边界的 SPLDOC 标记在两个列之间具有的字符少于 3 个：{0}
zh_tw: 在下列文字前面的直欄之間，表格中某個列界限的 SPLDOC 標記所具有的字元數目少於 3 個：{0}

# CDISP7040E
source: An error occurred during generation of image file: {0}. Contact IBM Software Support.
fr: Une erreur s''est produite lors de la génération du fichier image suivant : {0}. Contactez le service de support logiciel IBM.
it: Si è verificato un errore durante la generazione del file di immagine: {0}. Rivolgersi al supporto software IBM.
ja: イメージ・ファイル: {0} の生成中にエラーが発生しました。IBM ソフトウェア・サポートにお問い合わせください。
ko: 이미지 파일 생성 중에 오류가 발생했습니다: {0}. IBM 소프트웨어 지원 센터에 문의하십시오.
zh_cn: 生成图像文件期间发生错误：{0}。请与 IBM 软件支持人员联系。
zh_tw: 產生影像檔 {0} 期間發生錯誤。請與「IBM 軟體支援中心」聯絡。

# CDISP7060I
source: Toolkit path(s): {0}
fr: Chemin(s) de kit d''outils : {0}
it: Percorsi del toolkit: {0}
ja: ツールキット・パス: {0}
ko: 툴킷 경로: {0}
zh_cn: 工具箱路径：{0}
zh_tw: 工具箱路徑：{0}

# CDISP7061I
source: Output directory: {0}
fr: Répertoire de sortie : {0}
it: Directory di output: {0}
ja: 出力ディレクトリー: {0}
ko: 출력 디렉토리: {0}
zh_cn: 输出目录：{0}
zh_tw: 輸出目錄：{0}

# CDISP7062I
source: Document format: {0}
fr: Format de document : {0}
it: Formato del documento: {0}
ja: 文書フォーマット: {0}
ko: 문서 형식: {0}
zh_cn: 文档格式：{0}
zh_tw: 文件格式：{0}

# CDISP7063I
source: Author: {0}
fr: Auteur : {0}
it: Autore: {0}
ja: 作成者: {0}
ko: 저자: {0}
zh_cn: 作者：{0}
zh_tw: 作者：{0}

# CDISP7064I
source: Verbose: {0}
fr: Mode prolixe : {0}
it: Dettagliato: {0}
ja: 詳細: {0}
ko: 상세: {0}
zh_cn: 详细：{0}
zh_tw: 詳細：{0}

# CDISP7065I
source: Processing completed for: {0}
fr: Traitement terminé pour : {0}
it: Elaborazione completata per: {0}
ja: 処理が完了しました: {0}
ko: 다음 항목에 대한 처리가 완료되었습니다: {0}
zh_cn: 已针对以下项完成处理：{0}
zh_tw: 已完成對下列項目的處理：{0}
