Repository: IBMStreams/OSStreams
Catalog: src/java/spl/com.ibm.streams.spl.messages/src/main/xlf/doc/StreamsSPLDOCMessages_*.xlf
Languages: fr, it, ja, ko, zh_cn, zh_tw

# CDISP7066I
source: Output warning if link is to an absent toolkit or namespace: {0}
fr: Génération d''un avertissement si le lien renvoie à un kit d''outils ou un espace de nom absent : {0}
it: Avvertenza di output se il link è a un toolkit o namespace assente: {0}
ja: 存在しないツールキットまたは名前空間に対するリンクである場合、警告を出力します: {0}
ko: 링크가 존재하지 않는 툴킷 또는 네임스페이스에 대한 링크인 경우에는 출력 경고가 발생합니다: {0}
zh_cn: 如果链接指向缺少的工具箱或名称空间，那么会输出警告：{0}
zh_tw: 如果鏈結指向某個不存在的工具箱或名稱空間，則輸出警告：{0}

# CDISP7067I
source: DitaDriver translating: {0} to {1}
fr: Conversion DitaDriver : {0} vers {1}
it: Conversione DitaDriver: da {0} a {1}
ja: DitaDriver が変換しています: {0} から {1}
ko: DitaDriver 변환 중: {0}에서 {1}(으)로
zh_cn: DitaDriver 正在将 {0} 转换为 {1}
zh_tw: DitaDriver 正在將 {0} 轉換為 {1}

# CDISP7068I
source: DitaDriver using ditamap: {0}
fr: Utilisation de ditamap par DitaDriver : {0}
it: DitaDriver che utilizza ditamap: {0}
ja: DitaDriver は ditamap を使用します: {0}
ko: ditamap을 사용 중인 DitaDriver: {0}
zh_cn: DitaDriver 正在使用位图：{0}
zh_tw: DitaDriver 正在使用 ditamap：{0}

# CDISP7070I
source: Command exit value: {0}
fr: Valeur d''exit de commande : {0}
it: Valore di uscita comando: {0}
ja: コマンド終了値: {0}
ko: 명령 종료 값: {0}
zh_cn: 命令出口值：{0}
zh_tw: 指令結束值：{0}

# CDISP7071I
source: Image format: {0}
fr: Format d''image : {0}
it: Formato dell''immagine: {0}
ja: イメージ・フォーマット: {0}
ko: 이미지 형식: {0}
zh_cn: 图像格式：{0}
zh_tw: 影像格式：{0}

# CDISP7072I
source: Using default dimensions for image: {0}
fr: Utilisation de dimensions par défaut pour l''image : {0}
it: Utilizzo delle dimensioni predefinite per l''immagine: {0}
ja: イメージのデフォルト・ディメンションを使用します: {0}
ko: 이미지에 대해 기본 차원 사용: {0}
zh_cn: 使用图像的缺省尺寸：{0}
zh_tw: 使用影像的預設維度：{0}

# CDISP7073I
source: No dimension defined for image: {0}. Using default dimensions.
fr: Aucune dimension définie pour l''image : {0}. Utilisation des dimensions par défaut.
it: Nessuna dimensione definita per l''immagine: {0}. Vengono utilizzate le dimensioni predefinite.
ja: イメージにディメンションが定義されていません: {0}。デフォルト・ディメンションを使用します。
ko: 이미지에 대해 차원이 정의되지 않았습니다: {0}. 기본 차원을 사용합니다.
zh_cn: 没有为图像定义尺寸：{0}。使用缺省尺寸。
zh_tw: 未定義影像的維度：{0}。將使用預設維度。

# CDISP7074I
source: Processing primitive operator: {0}
fr: Traitement en cours de l''opérateur primitif : {0}
it: Elaborazione dell''operatore primitivo: {0}
ja: プリミティブ・オペレーターを処理しています: {0}
ko: 기본 연산자 처리 중: {0}
zh_cn: 正在处理基本操作程序：{0}
zh_tw: 正在處理初始運算子：{0}

# CDISP7075I
source: Processing native function model: {0}
fr: Traitement en cours du modèle de fonction native : {0}
it: Elaborazione del modello di funzione nativo: {0}
ja: ネイティブ関数モデルを処理しています: {0}
ko: 원시(native) 함수 모델 처리 중: {0}
zh_cn: 正在处理本机函数模型：{0}
zh_tw: 正在處理原生函數模型：{0}

# CDISP7076I
source: Generation complete. Top-level document: {0}
fr: Génération terminée. Document de niveau supérieur : {0}
it: Generazione completata. Documento di primo livello: {0}
ja: 生成が完了しました。最上位の文書: {0}
ko: 생성이 완료되었습니다. 최상위 레벨 문서: {0}
zh_cn: 生成完成。顶级文档：{0}
zh_tw: 產生已完成。最上層文件：{0}

# CDISP7077I
source: Check tags: {0}
fr: Vérification des balises : {0}
it: Controllare tag: {0}
ja: タグをチェックします: {0}
ko: 태그 확인: {0}
zh_cn: 检查标记：{0}
zh_tw: 檢查標籤：{0}

# CDISP7078I
source: Output warning if no SPLDOC comment provided: {0}
fr: Génération d''un avertissement si aucun commentaire SPLDOC n''est fourni : {0}
it: Avvertenza output se nessun commento SPLDOC fornito: {0}
ja: SPLDOC コメントが指定されない場合、警告を出力します: {0}
ko: SPLDOC 주석이 제공되지 않은 경우 출력 경고가 발생합니다: {0}
zh_cn: 如果未提供 SPLDOC 注释，那么会输出警告：{0}
zh_tw: 如果未提供 SPLDOC 註解，則輸出警告：{0}

# CDISP7079I
source: Copy image files: {0}
fr: Copie de fichiers image : {0}
it: Copiare file immagine: {0}
ja: イメージ・ファイルをコピーします: {0}
ko: 이미지 파일 복사: {0}
zh_cn: 复制图像文件：{0}
zh_tw: 複製影像檔：{0}

# CDISP7080W
source: No SPLDOC comment provided for composite "{0}".
fr: Aucun commentaire SPLDOC fourni pour le composite "{0}".
it: Nessun commento SPLDOC fornito per il composito "{0}".
ja: コンポジット "{0}" に SPLDOC コメントが指定されていません。
ko: 복합 "{0}"에 대해 SPLDOC 주석이 제공되지 않았습니다.
zh_cn: 没有为组合体“{0}”提供 SPLDOC 注释。
zh_tw: 未向複合項 "{0}" 提供 SPLDOC 註解。

# CDISP7081W
source: No SPLDOC comment provided for function "{0}".
fr: Aucun commentaire SPLDOC fourni pour la fonction "{0}".
it: Nessun commento SPLDOC fornito per la funzione "{0}".
ja: 関数 "{0}" に SPLDOC コメントが指定されていません。
ko: 함수 "{0}"에 대해 SPLDOC 주석이 제공되지 않았습니다.
zh_cn: 没有为函数“{0}”提供 SPLDOC 注释。
zh_tw: 未向函數 "{0}" 提供 SPLDOC 註解。

# CDISP7082W
source: No SPLDOC comment provided for type "{0}".
fr: Aucun commentaire SPLDOC fourni pour le type "{0}".
it: Nessun commento SPLDOC fornito per il tipo "{0}".
ja: タイプ "{0}" に SPLDOC コメントが指定されていません。
ko: 유형 "{0}"에 대해 SPLDOC 주석이 제공되지 않았습니다.
zh_cn: 没有为类型“{0}”提供 SPLDOC 注释。
zh_tw: 未向類型 "{0}" 提供 SPLDOC 註解。

# CDISP7083I
source: Processing SPL artifacts.
fr: Traitement en cours des artefacts SPL.
it: Elaborazione delle risorse SPL.
ja: SPL 成果物を処理しています。
ko: SPL 아티팩트를 처리하는 중입니다.
zh_cn: 正在处理 SPL 工件。
zh_tw: 正在處理 SPL 構件。

# CDISP7084I
source: Loading toolkit: {0} : {1}
fr: Chargement en cours du kit d''outils : {0} : {1}
it: Caricamento del toolkit: {0} : {1}
ja: ツールキットをロードしています: {0} : {1}
ko: 툴킷 로드 중: {0} : {1}
zh_cn: 正在装入工具箱：{0}：{1}
zh_tw: 正在載入工具箱：{0}：{1}

# CDISP7085W
source: Unrecognized SPLDOC annotation tag "{0}" for artifact "{1}". Skipping tag.
fr: Balise d''annotation SPLDOC "{0}" non reconnue pour l''artefact "{1}". La balise est ignorée.
it: Tag di annotazione SPLDOC "{0}" non riconosciuto per la risorsa "{1}". Tag ignorato.
ja: 成果物 "{1}" の SPLDOC アノテーション・タグ "{0}" は認識されません。タグをスキップします。
ko: "{0}"은(는) 아티팩트 "{1}"에 대한 인식할 수 없는 SPLDOC 어노테이션 태그입니다. 이 태그를 건너뜁니다.
zh_cn: 工件“{1}”的未识别 SPLDOC 注释标记“{0}”。正在跳过标记。
zh_tw: 無法辨識構件 "{1}" 的 SPLDOC 註釋標籤 "{0}"。將跳過標籤。

# CDISP7086E
source: SPLDOC annotation tag for artifact "{0}" has no name.
fr: La balise d''annotation SPLDOC pour l''artefact "{0}" ne porte pas de nom.
it: Il tag di annotazione SPLDOC per la risorsa "{0}" non ha nessun nome.
ja: 成果物 "{0}" の SPLDOC アノテーション・タグに名前がありません。
ko: 아티팩트 "{0}"에 대한 SPLDOC 어노테이션 태그에 이름이 없습니다.
zh_cn: 工件“{0}”的 SPLDOC 注释标记不具有名称。
zh_tw: 構件 "{0}" 的 SPLDOC 註釋標籤沒有名稱。

# CDISP7087E
source: SPLDOC annotation "@{0}" for artifact "{1}" has no value.
fr: L''annotation SPLDOC "@{0}" pour l''artefact "{1}" ne comporte aucune valeur.
it: L''annotazione SPLDOC "@{0}" per la risorsa "{1}" non ha nessun valore.
ja: 成果物 "{1}" の SPLDOC アノテーション "@{0}" に値がありません。
ko: 아티팩트 "{1}"에 대한 SPLDOC 어노테이션 "@{0}"에 값이 없습니다.
zh_cn: 工件“{1}”的 SPLDOC 注释“@{0}”不具有值。
zh_tw: 構件 "{1}" 的 SPLDOC 註釋 "@{0}" 沒有值。

# CDISP7088W
source: No SPLDOC comment provided for operator "{0}".
fr: Aucun commentaire SPLDOC fourni pour l''opérateur "{0}".
it: Nessun commento SPLDOC fornito per l''operatore "{0}".
ja: オペレーター "{0}" に SPLDOC コメントが指定されていません。
ko: 연산자 "{0}"에 대해 SPLDOC 주석이 제공되지 않았습니다.
zh_cn: 没有为操作程序“{0}”提供 SPLDOC 注释。
zh_tw: 未向運算子 "{0}" 提供 SPLDOC 註解。

# CDISP7089I
source: Include function set header: {0}
fr: Inclure l''en-tête d''ensemble de fonctions : {0}
it: Includere intestazioni di serie di funzioni: {0}
ja: 関数セット・ヘッダーを組み込みます: {0}
ko: 함수 세트 헤더 포함: {0}
zh_cn: 包含函数集头：{0}
zh_tw: 包括函數集標頭：{0}

# CDISP7090I
source: Include excluded SPL artifacts: {0}
fr: Inclure les artefacts SPL exclus : {0}
it: Includere risorse SPL escluse: {0}
ja: 除外された SPL 成果物を組み込みます: {0}
ko: 제외된 SPL 아티팩트 포함: {0}
zh_cn: 包含排除的 SPL 工件：{0}
zh_tw: 包括已排除的 SPL 構件：{0}

# CDISP7091I
source: Include non-public SPL artifacts: {0}
fr: Inclure des artefacts SPL non publics : {0}
it: Includere risorse SPL escluse non pubbliche: {0}
ja: 非公開 SPL 成果物を組み込みます: {0}
ko: public이 아닌 SPL 아티팩트 포함: {0}
zh_cn: 包含非公共 SPL 工件：{0}
zh_tw: 包括非公用 SPL 構件：{0}

# CDISP7092I
source: Include SPL source code: {0}
fr: Inclure un code source SPL : {0}
it: Includere codice sorgente SPL: {0}
ja: SPL ソース・コードを組み込みます: {0}
ko: SPL 소스 코드 포함: {0}
zh_cn: 包含 SPL 源代码：{0}
zh_tw: 包括 SPL 原始碼：{0}

# CDISP7093E
source: Generation complete with {0} errors and {1} warnings. Generation of the SPL documentation failed.
fr: La génération s''est terminée avec {0} erreurs et {1} avertissements. La génération de la documentation SPL a échoué.
it: Generazione completata con {0} errori e {1} avvertenze. La generazione della documentazione SPL non è riuscita.
ja: 生成は完了しました。{0} 件のエラーと {1} 件の警告があります。SPL ドキュメンテーションの生成に失敗しました。
ko: 생성이 완료되었으며 {0}개 오류 및 {1}개 경고가 발생했습니다. SPL 문서 생성이 실패했습니다.
zh_cn: 生成完成，具有 {0} 个错误和 {1} 个警告。生成 SPL 文档失败。
zh_tw: 產生已完成，發生了 {0} 個錯誤和 {1} 個警告。產生 SPL 說明文件失敗。

# CDISP7095I
source: Debug mode enabled: {0}
fr: Mode débogage activé : {0}
it: Modalità debug abilitata: {0}
ja: デバッグ・モードが有効になりました: {0}
ko: 디버그 모드가 사용으로 설정되었습니다: {0}
zh_cn: 已启用调试方式：{0}
zh_tw: 已啟用除錯模式：{0}

# CDISP7096I
source: Command: {0}
fr: Commande : {0}
it: Comando: {0}
ja: コマンド: {0}
ko: 명령: {0}
zh_cn: 命令：{0}
zh_tw: 指令：{0}

# CDISP7097E
source: Generation complete with {0} errors and {1} warnings. Top-level document: {2}
fr: La génération s''est terminée avec {0} erreurs et {1} avertissements. Document de niveau supérieur : {2}
it: Generazione completata con {0} errori e {1} avvertenze. Documento di primo livello: {2}
ja: 生成は完了しました。{0} 件のエラーと {1} 件の警告があります。最上位の文書: {2}
ko: 생성이 완료되었으며 {0}개 오류 및 {1}개 경고가 발생했습니다. 최상위 레벨 문서: {2}
zh_cn: 生成完成，具有 {0} 个错误和 {1} 个警告。顶级文档：{2}
zh_tw: 產生已完成，發生了 {0} 個錯誤和 {1} 個警告。最上層文件：{2}

# CDISP7101W
source: Generation complete with 0 errors and {0} warnings. Top-level document: {1}
fr: La génération s''est terminée avec 0 erreur et {0} avertissements. Document de niveau supérieur : {1}
it: Generazione completa con 0 errori e {0} avvertenze. Documento di primo livello: {1}
ja: 生成は完了しました。エラーはなく、{0} 件の警告があります。最上位の文書: {1}
ko: 생성이 완료되었으며 0개 오류 및 {0}개 경고가 발생했습니다. 최상위 레벨 문서: {1}
zh_cn: 生成完成，具有 0 个错误和 {0} 个警告。顶级文档：{1}
zh_tw: 產生已完成，發生了 0 個錯誤和 {0} 個警告。最上層文件：{1}

# CDISP7103E
source: Invalid image URI: {0}. Correct the image file name in the SPLDOC comment.
fr: URI d''image non valide : {0}. Corrigez le nom du fichier image dans le commentaire SPLDOC.
it: URI immagine non valido: {0}. Correggere il nome file di immagine nel commento SPLDOC.
ja: 無効なイメージ URI: {0}。SPLDOC コメントのイメージ・ファイル名を訂正してください。
ko: 유효하지 않은 이미지 URI: {0}. SPLDOC 주석에서 이미지 파일 이름을 정정하십시오.
zh_cn: 图像 URI 无效：{0}。在 SPLDOC 注释中纠正图像文件名。
zh_tw: 影像 URI {0} 無效。請更正 SPLDOC 註解中的影像檔名稱。

# CDISP7104E
source: Image file not found or cannot be read: {0}. Correct the image file name in the SPLDOC comment or correct its access permissions.
fr: Fichier image introuvable ou illisible : {0}. Corrigez le nom du fichier image dans le commentaire SPLDOC ou corrigez les droits d''accès à ce fichier image.
it: File immagine non trovato o che non può essere letto: {0}. Correggere il nome file di immagine nel commento SPLDOC oppure correggere le relative autorizzazioni di accesso.
ja: イメージ・ファイルが見つからないか、読み取れません: {0}。SPLDOC コメントのイメージ・ファイル名を訂正するか、そのアクセス許可を訂正してください。
ko: 이미지 파일을 찾을 수 없거나 읽을 수 없습니다: {0}. SPLDOC 주석에서 이미지 파일 이름을 정정하거나 해당 액세스 권한을 정정하십시오.
zh_cn: 图像文件找不到或无法读取：{0}。在 SPLDOC 注释中纠正图像文件名或纠正其访问许可权。
zh_tw: 找不到影像檔，或者無法讀取影像檔：{0}。請更正 SPLDOC 註解中的影像檔名稱，或者更正其存取權。

# CDISP7105W
source: The "@return" annotation for function "{0}" with return type void has been skipped.
fr: L''annotation "@return" pour la fonction "{0}" avec le type de retour void a été ignorée.
it: L''annotazione "@return" per la funzione "{0}" con tipo di ritorno void è stata ignorata.
ja: 戻りタイプ void の関数 "{0}" の "@return" アノテーションをスキップしました。
ko: 리턴 유형이 void인 함수 "{0}"에 대한 "@return" 어노테이션을 건너뛰었습니다.
zh_cn: 已跳过返回类型为 void 的函数“{0}”的“@return”注释。
zh_tw: 已跳過傳回類型為 void 之函數 "{0}" 的 "@return" 註釋。

# CDISP7107E
source: Ambiguous link to SPL artifact "{0}". Link matches: {1}.
fr: Lien ambigu vers l''artefact SPL "{0}". Correspondances du lien : {1}.
it: Link ambiguo alla risorsa SPL "{0}". Corrispondenze link: {1}.
ja: SPL 成果物 "{0}" へのリンクがあいまいです。リンクは以下に一致しています: {1}。
ko: SPL 아티팩트 "{0}"에 대한 앰비규어스한 링크입니다. 링크 일치 항목은 다음과 같습니다: {1}.
zh_cn: 指向 SPL 工件“{0}”的链接不明确。链接匹配：{1}。
zh_tw: 指向 SPL 構件 "{0}" 的鏈結語意不明。鏈結相符項：{1}。

# CDISP7108E
source: The link to SPL artifact "{0}" must include a namespace to reference an artifact in another toolkit. The link matches: {1}.
fr: Le lien vers l''artefact SPL "{0}" doit comporter un espace de nom pour référencer un artefact d''un autre kit d''outils. Le lien correspond à : {1}.
it: Il link alla risorsa SPL "{0}" deve includere un namespace per fare riferimento a una risorsa in un altro toolkit. Il link corrisponde a: {1}.
ja: SPL 成果物 "{0}" へのリンクには、別のツールキットの成果物を参照するための名前空間が含まれなければなりません。リンクは以下に一致しています: {1}。
ko: SPL 아티팩트 "{0}"에 대한 링크는 다른 툴킷의 아티팩트를 참조하기 위한 네임스페이스를 포함해야 합니다. 링크 일치 항목은 다음과 같습니다: {1}.
zh_cn: 指向 SPL 工件“{0}”的链接必须包含名称空间，才能引用其他工具箱中的工件。链接匹配：{1}。
zh_tw: 指向 SPL 構件 "{0}" 的鏈結必須包括一個名稱空間，以參照另一個工具箱中的某個構件。鏈結相符項：{1}。

# CDISP7109E
source: The SPL artifact referenced by the link "{0}" is not in the document. Correct the reference to the SPL artifact in the SPLDOC link. If the link is to a function with parameters, include the parameter types.
fr: L''artefact SPL référencé par le lien "{0}" ne figure pas dans le document. Corrigez la référence à l''artefact SPL dans le lien SPLDOC. Si le lien renvoie à une fonction avec des paramètres, ajoutez les types de paramètre.
it: La risorsa SPL a cui fa riferimento il link "{0}" non è nel documento. Correggere il riferimento alla risorsa SPL nel link SPLDOC. Se il link è a una funzione con parametri, includere i tipi di parametro.
ja: リンク"{0}" で参照される SPL 成果物が文書内にありません。SPLDOC リンク内の SPL 成果物への参照を訂正してください。パラメーターを使用する関数へのリンクの場合は、パラメーター・タイプを含めてください。
ko: 링크 "{0}"에서 참조하는 SPL 아티팩트가 이 문서에 없습니다. SPLDOC 링크에서 이 SPL 아티팩트에 대한 참조를 정정하십시오. 링크가 매개변수가 있는 함수에 대한 링크인 경우에는 매개변수 유형을 포함시키십시오.
zh_cn: 链接“{0}”所引用的 SPL 工件不在文档中。纠正 SPLDOC 链接中指向 SPL 工件的引用。如果链接指向具有参数的函数，请包含参数类型。
zh_tw: 鏈結 "{0}" 所參照的 SPL 構件不在文件中。請更正 SPLDOC 鏈結中對 SPL 構件的參照。如果該鏈結指向某個帶參數的函數，請包括參數類型。

# CDISP7110W
source: Missing "@param {0}" annotation, or annotation description, for composite operator parameter "{1}".
fr: Annotation "@param {0}" ou description d''annotation manquantes pour le paramètre d''opérateur composite "{1}".
it: Annotazione "@param {0}", o descrizione dell''annotazione, mancante per il parametro di operatore composito "{1}".
ja: コンポジット・オペレーター・パラメーター "{1}" に "@param {0}" アノテーションまたはアノテーション記述がありません。
ko: 복합 연산자 매개변수 "{1}"에서 "@param {0}" 어노테이션 또는 어노테이션 설명이 누락되었습니다.
zh_cn: 组合操作程序参数“{1}”缺少“@param {0}”注释或注释描述。
zh_tw: 針對複合運算子參數 "{1}"，遺漏了 "@param {0}" 註釋或註釋說明。

# CDISP7111W
source: Missing "{0}" annotation, or annotation description, on operator port "{1}" for composite operator "{2}".
fr: Annotation "{0}" ou description d''annotation manquantes sur le port d''opérateur "{1}" pour l''opérateur composite "{2}".
it: Annotazione "{0}", o descrizione dell''annotazione, mancante sulla porta di operatore "{1}" per l''operatore composito "{2}".
ja: コンポジット・オペレーター "{2}" のオペレーター・ポート "{1}" に "{0}" アノテーションまたはアノテーション記述がありません。
ko: 복합 연산자 "{2}"의 연산자 포트 "{1}"에서 "{0}" 어노테이션 또는 어노테이션 설명이 누락되었습니다.
zh_cn: 组合操作程序“{2}”的操作程序端口“{1}”上缺少“{0}”注释或注释描述。
zh_tw: 在複合運算子 "{2}" 的運算子埠 "{1}" 上，遺漏了 "{0}" 註釋或註釋說明。

# CDISP7112W
source: Missing "{0}" annotation, or annotation description, for SPL or native function "{1}".
fr: Annotation "{0}" ou description d''annotation manquantes pour la fonction SPL ou native "{1}".
it: Annotazione "{0}", o descrizione dell''annotazione, mancante per la funzione SPL o nativa "{1}".
ja: SPL またはネイティブ関数 "{1}" に "{0}" アノテーションまたはアノテーション記述がありません。
ko: SPL 또는 원시(native) 함수 "{1}"에서 "{0}" 어노테이션 또는 어노테이션 설명이 누락되었습니다.
zh_cn: SPL 或本机函数“{1}”缺少“{0}”注释或注释描述。
zh_tw: 針對 SPL 或原生函數 "{1}"，遺漏了 "{0}" 註釋或註釋說明。

# CDISP7113W
source: The "@param {0}" annotation does not match any parameter defined by the SPL or native function "{1}".
fr: L''annotation "@param {0}" ne correspond à aucun des paramètres définis par la fonction SPL ou native "{1}".
it: L''annotazione "@param {0}" non corrisponde a alcun parametro definito dalla funzione SPL o nativa "{1}".
ja: "@param {0}" アノテーションが、SPL またはネイティブ関数 "{1}" で定義されたどのパラメーターにも一致しません。
ko: "@param {0}" 어노테이션이 SPL 또는 원시(native) 함수 "{1}"에 의해 정의된 매개변수와 일치하지 않습니다.
zh_cn: “@param {0}”注释与 SPL 或本机函数“{1}”定义的任何参数不匹配。
zh_tw: "@param {0}" 註釋與 SPL 或原生函數 "{1}" 定義的任何參數均不符。

# CDISP7115W
source: The "{0} {1}" annotation does not match any port for the composite operator "{2}".
fr: L''annotation "{0} {1}" ne correspond à aucun des ports de l''opérateur composite "{2}".
it: L''annotazione "{0} {1}" non corrisponde a alcuna porta per l''operatore composito "{2}".
ja: "{0} {1}" アノテーションは、コンポジット・オペレーター "{2}" のどのポートにも一致しません。
ko: "{0} {1}" 어노테이션이 복합 연산자 "{2}"의 포트와 일치하지 않습니다.
zh_cn: “{0} {1}”注释与组合操作程序“{2}”的任何端口都不匹配。
zh_tw: "{0} {1}" 註釋與複合運算子 "{2}" 的任何埠均不符。

# CDISP7116W
source: The "@param {0}" annotation does not match any parameter defined by the composite operator "{1}".
fr: L''annotation "@param {0}" ne correspond à aucun des paramètres définis par l''opérateur composite "{1}".
it: L''annotazione "@param {0}" non corrisponde a alcun parametro definito dall''operatore composito "{1}".
ja: "@param {0}" アノテーションが、コンポジット・オペレーター "{1}" で定義されたどのパラメーターにも一致しません。
ko: "@param {0}" 어노테이션이 복합 연산자 "{1}"에 의해 정의된 매개변수와 일치하지 않습니다.
zh_cn: “@param {0}”注释与组合操作程序“{1}”定义的任何参数不匹配。
zh_tw: "@param {0}" 註釋與複合運算子 "{1}" 定義的任何參數均不符。

# CDISP7117W
source: The link to SPL artifact "{0}" references a toolkit or namespace that is not in the document.
fr: Le lien vers l''artefact SPL "{0}" fait référence à un kit d''outils ou à un espace de nom qui ne figure pas dans le document.
it: Il link alla risorsa SPL "{0}" fa riferimento a un toolkit o namespace che non è presente nel documento.
ja: SPL 成果物 "{0}" へのリンクが、文書内にないツールキットまたは名前空間を参照します。
ko: SPL 아티팩트 "{0}"에 대한 링크가 문서에 없는 툴킷 또는 네임스페이스를 참조합니다.
zh_cn: 指向 SPL 工件“{0}”的链接引用的工具箱或名称空间不在文档中。
zh_tw: 指向 SPL 構件 "{0}" 的鏈結所參照的工具箱或名稱空間，不在文件中。

# CDISP7118I
source: Suppress generation of SPL reference documents: {0}
fr: Supprimer la génération des documents de référence SPL : {0}
it: Sopprimere la generazione di documenti di riferimento SPL: {0}
ja: SPL 参照文書の生成を抑止します: {0}
ko: SPL 참조 문서의 생성 제외: {0}
zh_cn: 禁止生成 SPL 引用文档：{0}
zh_tw: 暫停產生 SPL 參照文件：{0}

# CDISP7119E
source: Error reading SPL model or reference file: {0}. Contact IBM Software Support.
fr: Erreur lors de la lecture du modèle SPL ou du fichier de référence : {0}. Contactez le service de support logiciel IBM.
it: Errore durante la lettura del modello SPL o del file di riferimento: {0}. Rivolgersi al supporto software IBM.
ja: SPL モデルまたは参照ファイルの読み取り中にエラーが発生しました: {0}。IBM ソフトウェア・サポートにお問い合わせください。
ko: SPL 모델 또는 참조 파일을 읽는 중에 오류가 발생했습니다: {0}. IBM 소프트웨어 지원 센터에 문의하십시오.
zh_cn: 读取 SPL 模型或引用文件时出错：{0}。请与 IBM 软件支持人员联系。
zh_tw: 讀取 SPL 模型或參照檔案時發生錯誤：{0}。請與「IBM 軟體支援中心」聯絡。

# CDISP7120I
source: Loading file: {0}
fr: Chargement en cours du fichier : {0}
it: Caricamento del file: {0}
ja: ファイルをロードしています: {0}
ko: 파일 로드 중: {0}
zh_cn: 正在装入文件：{0}
zh_tw: 正在載入檔案：{0}

# CDISP7121E
source: The link "{0}" is not a valid SPL artifact, local file or URI link.
fr: Le lien "{0}" n''est pas un artefact SPL, un fichier local ou un lien d''URI valides.
it: Il link "{0}" non è una risorsa SPL, un file locale o un link URI valido.
ja: リンク "{0}" は、有効な SPL 成果物、ローカル・ファイル、URI リンクのいずれでもありません。
ko: 링크 "{0}"이(가) 유효한 SPL 아티팩트, 로컬 파일 또는 URI 링크가 아닙니다.
zh_cn: 链接“{0}”不是有效的 SPL 工件、本地文件或 URI 链接。
zh_tw: 鏈結 "{0}" 不是有效的 SPL 構件、本端檔案或 URI 鏈結。

# CDISP7122I
source: Include composite operator diagram: {0}
fr: Inclure un diagramme d''opérateur composite: {0}
it: Includere diagramma di operatore composito: {0}
ja: コンポジット・オペレーター・ダイアグラムを組み込みます: {0}
ko: 복합 연산자 다이어그램 포함: {0}
zh_cn: 包含组合操作程序图：{0}
zh_tw: 包括複合運算子圖：{0}

# CDISP7123I
source: Suppress primitive operator diagram: {0}
fr: Supprimer un diagramme d''opérateur primitif : {0}
it: Sopprimere diagramma di operatore primitivo: {0}
ja: プリミティブ・オペレーター・ダイアグラムを抑止します: {0}
ko: 기본 연산자 다이어그램 제외: {0}
zh_cn: 禁止基本操作程序图：{0}
zh_tw: 暫停初始運算子圖：{0}

# CDISP7124E
source: Internal error: {0}. Contact IBM Software Support.
fr: Erreur interne : {0}. Contactez le service de support logiciel IBM.
it: Errore interno: {0}. Rivolgersi al supporto software IBM.
ja: 内部エラー: {0}。IBM ソフトウェア・サポートにお問い合わせください。
ko: 내부 오류: {0}. IBM 소프트웨어 지원 센터에 문의하십시오.
zh_cn: 内部错误：{0}。请与 IBM 软件支持人员联系。
zh_tw: 內部錯誤：{0}。請與「IBM 軟體支援中心」聯絡。

# CDISP7125I
source: Document title: {0}
fr: Titre de document : {0}
it: Titolo del documento: {0}
ja: 文書タイトル: {0}
ko: 문서 제목: {0}
zh_cn: 文档标题：{0}
zh_tw: 文件標題：{0}

# CDISP7126E
source: Command exit value: {0}
fr: Valeur d''exit de commande : {0}
it: Valore di uscita comando: {0}
ja: コマンド終了値: {0}
ko: 명령 종료 값: {0}
zh_cn: 命令出口值：{0}
zh_tw: 指令結束值：{0}

# CDISP7127E
source: Malformed SPLDOC link: {0}, {1}. Link is output as plain text. Update SPLDOC to enable link.
fr: Lien SPLDOC incorrectement formé: {0}, {1}. Le lien est généré sous la forme d''un texte en clair. Mettez à jour SPLDOC pour activer le lien.
it: Link SPLDOC con formato errato: {0}, {1}. Il link è generato come testo semplice. Aggiornare SPLDOC per abilitare il link.
ja: 誤った形式の SPLDOC リンク: {0}、{1}。リンクは、プレーン・テキストとして出力されます。SPLDOC を更新してリンクを有効にしてください。
ko: 잘못된 SPLDOC 링크: {0}, {1}. 링크가 평문으로 출력됩니다. SPLDOC를 갱신하여 링크를 사용으로 설정하십시오.
zh_cn: SPLDOC 链接格式错误：{0}，{1}。链接作为纯文本输出。更新 SPLDOC 以启用链接。
zh_tw: SPLDOC 鏈結的形態異常：{0}，{1}。鏈結輸出為純文字。更新 SPLDOC 以啟用鏈結。

# CDISP7128E
source: Unexpected path for native function model: {0} in toolkit directory {1}.
fr: Chemin inattendu pour le modèle de fonction native : {0} dans le répertoire de kit d''outils {1}.
it: Percorso non previsto per il modello di funzione nativa: {0} nella directory del toolkit {1}.
ja: ネイティブ関数モデルに予期しないパス: ツールキット・ディレクトリー {1} の {0}。
ko: 툴킷 디렉토리 {1}에 원시(native) 함수 모델에 대한 예기치 않은 경로가 있습니다: {0}.
zh_cn: 工具箱目录 {1} 中本机函数模型 {0} 的路径不是预期路径。
zh_tw: 在工具箱目錄 {1} 中，原生函數模型 {0} 的路徑是非預期的。

# CDISP7129E
source: Composite operator diagram is not supported on Windows.
fr: Le diagramme d''opérateur composite n''est pas pris en charge sous Windows.
it: Il diagramma dell''operatore composito non è supportato in Windows.
ja: コンポジット・オペレーター・ダイアグラムは Windows でサポートされません。
ko: Windows에서는 복합 연산자 다이어그램이 지원되지 않습니다.
zh_cn: 组合操作程序图在 Windows 上不受支持。
zh_tw: 複合運算子圖在 Windows 上不受支援。

# CDISP7130E
source: Operator model object is missing.
fr: Objet de modèle d''opérateur manquant.
it: L''oggetto modello di operatore è mancante.
ja: オペレーター・モデル・オブジェクトがありません。
ko: 연산자 모델 오브젝트가 누락되었습니다.
zh_cn: 缺少操作程序模型对象。
zh_tw: 遺漏運算子模型物件。

# CDISR5186E
source: This is a test message - String: {0} - Integer: {1,number,0} - Formatted Integer: {2,number} - Real: {3,number,integer.##########} - Formatted Real: {4,number} - Date: {5,date} - Time: {6,time} - DateTime: {7,date} {7,time}.
it: Questo è un messaggio di prova - String: {0} - Integer: {1,number,0} - Integer formattato: {2,number} - Real: {3,number,integer.##########} - Real formattato: {4,number} - Date: {5,date} - Time: {6,time} - DateTime: {7,date} {7,time}.
ja: これはテスト・メッセージです - String: {0} - Integer: {1,number,0} - Formatted Integer: {2,number} - Real: {3,number,integer.##########} - Formatted Real: {4,number} - Date: {5,date} - Time: {6,time} - DateTime: {7,date} {7,time}。
zh_tw: 這是測試訊息 - 字串：{0} - 整數：{1,number,0} - 格式化整數：{2,number} - 實數：{3,number,integer.##########} - 格式化實數：{4,number} - 日期：{5,date} - 時間：{6,time} - 日期時間：{7,date} {7,time}。
